[
    {
        "id": "4475106774946369388",
        "title": "Eli Lilly looks beyond its blockbuster obesity drugs with another smart deal",
        "url": "https://www.cnbc.com/2025/06/17/eli-lilly-looks-beyond-obesity-drugs-with-another-smart-acquisition.html",
        "site": "cnbc.com",
        "time": 1750182965000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Club name Eli Lilly made its third deal of the year to acquire an attractive experimental drug.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-257112833491336963",
        "title": "FDA to launch national vouchers to cut drug review time | $BMY $PFE $LLY $MRK $AMGN",
        "url": "https://seekingalpha.com/news/4458991-fda-to-launch-national-vouchers-to-cut-drug-review-time",
        "site": "seekingalpha.com",
        "time": 1750178330000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "991933813018499615",
        "title": "White House reportedly eyeing restrictions to prescription drug advertising | $JNJ $NVO $LLY $ABBV $WPP",
        "url": "https://seekingalpha.com/news/4458931-white-house-planning-restrict-pharma-advertising",
        "site": "seekingalpha.com",
        "time": 1750173447000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7438668139098377442",
        "title": "Starbucks and Others Rethink Recipe for Success in China",
        "url": "https://www.bloomberg.com/news/newsletters/2025-06-17/starbucks-and-others-rethink-recipe-for-success-in-china",
        "site": "bloomberg.com",
        "time": 1750172486000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Hi, it’s Dong Cao and Manuel Baigorri in Hong Kong, looking at how some big-name international brands are reassessing their approach to business in China. Also today, Eli Lilly’s latest move to build its drug pipeline in heart disease. Today’s top stories A Starbucks store in Shanghai. Photographer: Qilai Shen/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "3875904552436312039",
        "title": "Lilly-Verve deal sends gene editing stocks higher | $LLY $VERV $EDIT $NTLA $CRSP",
        "url": "https://seekingalpha.com/news/4458896-lilly-verve-deal-sends-gene-editing-stocks-higher",
        "site": "seekingalpha.com",
        "time": 1750170577000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6055473092567456370",
        "title": "Lilly to Acquire Verve Therapeutics for Up to $1.3B",
        "url": "https://www.genengnews.com/topics/genome-editing/lilly-to-acquire-verve-therapeutics-for-up-to-1-3b/",
        "site": "genengnews.com",
        "time": 1750168253000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The deal comes two months after publicly-traded Verve announced positive initial data from the Phase Ib Heart-2 trial (NCT06164730) assessing VERVE-102 in patients with heterozygous familial hypercholesterolemia (HeFH) and/or premature coronary artery disease. The post Lilly to Acquire Verve Therapeutics for Up to $1.3B appeared first on GEN - Genetic Engineering and Biotechnology News. Eli Lilly has agreed to acquire Verve Therapeutics for up to $1.3 billion, the companies said today, in a deal designed to bolster the buyer’s cardiovascular treatment pipeline with Verve’s gene edited therapies, led by PCSK9-targeting VERVE-102. The deal comes two months after publicly-traded Verve announced positive initial data from the Phase Ib Heart-2 trial (NCT06164730) assessing VERVE-102 in patients with heterozygous familial hypercholesterolemia (HeFH) and/or premature coronary artery disease. Among 14 participants across three dose levels, a single VERVE-102 infusion yielded dose-dependent decreases in blood PCSK9 protein levels and low-density lipoprotein cholesterol (LDL-C), with a mean reduction in blood LDL-C of 53% and a maximum of 69% seen among four participants in the 0.6 mg/kg dose cohort. Yet last year, investors punished Verve by sending its shares nosediving 35% after the company reported a serious adverse event in one patient during its Phase Ib Heart-1 trial (NCT05398029), a grade 3 drug-induced transient elevation of serum alanine aminotransferase (ALT) and grade 3 drug-induced thrombocytopenia. After pausing Heart-1 which assessed VERVE-101 in heterozygous familial hypercholesterolemia (HeFH), Verve pivoted its development effort toward VERVE-102. “VERVE-102 has the potential to be the first in vivo gene editing therapy for broad patient populations and could shift the treatment paradigm for cardiovascular disease from chronic care to one-and-done treatment,” Ruth Gimeno, Lilly group vice president, Diabetes and Metabolic Research and Development, said in a statement. Verve has said it expected to dose the first patient in its Phase II trial of VERVE-102 in the second half of this year. Also during the second half, Verve expects to offer a program update on its second LDL-C fighting clinical program, VERVE-201. Verve ranked fifth in GEN’s recent-updated annual A-List of Top 10 Publicly-Owned Editing Therapy Companies, published Friday. During the first quarter, Verve reported collaboration revenue of $32.976 million, while placing fourth among the 10 ranked companies in cash position ($497.077 million), fifth in market cap ($384.207 million), and sixth in pipeline activity with VERVE-102 and -201. ‘Chronic care to a one-dose future’ “Verve was founded with one mission in mind: transform the treatment of cardiovascular disease from chronic care to a one-dose future. In just seven years, our team has progressed three in vivo gene editing products, with two currently in the clinic,” stated Sekar Kathiresan, MD, Verve’s co-founder and CEO. “Now, we will take the next steps in the drug development journey together with an ideal strategic partner in Lilly. Lilly shares our vision, and we believe their global research, clinical, regulatory and commercial capabilities will help to accelerate the development of our medicines.” Lilly has agreed to pay Verve $1 billion upfront or $10.50 per share, plus a potential additional $300 million non-tradeable contingent value right (CVR) per share entitling shareholders to up to an additional $3 per share. CVR holders would receive the payment when the first patient is dosed with VERVE-102 for ASCVD in a U.S. Phase III trial—or before the 10th anniversary of closing or termination of the CVR. The deal price marks an approximately 113% premium to the 30-day volume weighted average trading price of Verve’s common stock as of Monday. The deal is expected to close in the third quarter subject to the tender of a majority of outstanding shares of Verve’s common stock, and other customary closing conditions. Verve’s board has unanimously recommended that its shareholders tender their shares in the offer. Among shareholders agreeing to do so are Kathiresan, Andrew Ashe, and entities affiliated with GV (formerly Google Ventures), which together represent about 17.8% of Verve’s outstanding common stock. Upon a successful closing of the tender offer, Lilly would acquire any shares of Verve that had not been tendered through a second step merger, at the same $10.50 per share price. “My deepest thanks to the entire Verve team for their expertise, creativity, and grit. We are grateful to the investigators and patients who have contributed to the success of our clinical trials so far,” Kathiresan added. “Under Lilly’s stewardship, we are excited to realize the next chapter in cardiovascular care where a single treatment can lead to lifelong reduction of cardiovascular risk factors and make life better for millions of patients living with cardiovascular disease.” The post Lilly to Acquire Verve Therapeutics for Up to $1.3B appeared first on GEN - Genetic Engineering and Biotechnology News.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "2855671903364248084",
        "title": "4 stocks to watch on Tuesday: JBL, TMUS, LLY and YUM | $YUM $LLY $JBL $TMUS $SFTBF",
        "url": "https://seekingalpha.com/news/4458813-4-stocks-to-watch-on-tuesday-jbl-tmus-lly-and-yum",
        "site": "seekingalpha.com",
        "time": 1750165698000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8660269987667126860",
        "title": "This one-and-done heart-disease treatment just got a $1.3 billion endorsement from Eli Lilly",
        "url": "https://www.marketwatch.com/story/this-one-and-done-heart-disease-treatment-just-got-a-1-3-billion-endorsement-from-eli-lilly-5c163b61?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1750162380000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-4786837378191900923"
        ],
        "description": "Verve Therapeutics’ stock rallies by a record 80% on Eli Lilly’s premium purchase price for the drug-development company.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7445250141635524941",
        "title": "Eli Lilly to Acquire Verve Therapeutics for Up to $1.3 Billion",
        "url": "https://www.wsj.com/health/pharma/eli-lilly-to-acquire-verve-therapeutics-for-up-to-1-3-billion-02b3ad5e?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1750161300000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8780552709086461911",
        "title": "Stock Movers: LMT, COP, Eli Lilly (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-17/stock-movers-lmt-cop-eli-lilly-podcast",
        "site": "bloomberg.com",
        "time": 1750159539000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 4:00 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4786837378191900923",
        "title": "This Stock Jumps 77% After $1.3 Billion Bid From Eli Lilly",
        "url": "https://www.barrons.com/articles/eli-lilly-stock-verve-therapeutics-bid-0ffda96e?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1750158060000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "5894391444368332935",
        "title": "Eli Lilly to acquire for Verve Therapeutics for up to $1.3B | $LLY $VERV",
        "url": "https://seekingalpha.com/news/4458710-eli-lilly-to-acquire-for-verve-therapeutics-for-up-to-13b",
        "site": "seekingalpha.com",
        "time": 1750157650000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-7445250141635524941"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4879161005791973175",
        "title": "Eli Lilly to Buy Gene-Editing Biotech Verve for $1.3 Billion",
        "url": "https://www.bloomberg.com/news/articles/2025-06-17/lilly-to-buy-us-biotech-verve-for-1-3-billion",
        "site": "bloomberg.com",
        "time": 1750157540000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly & Co. agreed to buy Verve Therapeutics Inc., a US biotech that’s seeking to use gene editing to prevent clogged arteries, for as much as $1.3 billion in the drugmaker’s latest move to build its pipeline in heart disease. Eli Lilly & Co. signage on the floor of the New York Stock Exchange.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4555377695893358422",
        "title": "Eli Lilly nears $1.3B deal for Verve Therapeutics - report | $LLY $VERV",
        "url": "https://seekingalpha.com/news/4458710-eli-lilly-nears-13b-deal-for-verve-therapeutics---report",
        "site": "seekingalpha.com",
        "time": 1750147768000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1559159413034206654",
        "title": "Eli Lilly close to buying gene-editing biotech Verve Therapeutics",
        "url": "https://www.ft.com/content/53d021c9-d15f-4471-86ef-e9abfc3ae7db",
        "site": "ft.com",
        "time": 1750116748000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "4807631235028907070",
            "-4879161005791973175"
        ],
        "description": "Drugmaker nears $1.3bn deal in search for experimental medicines",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7750139074052884284",
        "title": "Eli Lilly is making it cheaper and easier to buy high-doses of blockbuster weight loss drug Zepbound",
        "url": "https://www.fastcompany.com/91353065/eli-lilly-zepbound-high-doses-weight-loss-drug-zepbound-website?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1750108500000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly announced on Monday it will soon make the two highest-doses of its popular weight-loss drug Zepbound available for self-paying customers on its website. Starting in August, 12.5 mg and 15 mg single-doses will be added to the company’s website, effectively making all Zepbound doses available for $499 a month, or less. Unlike the pen form sold at pharamcies like Walgreens and CVS, the drug will be available in vial form through its LillyDirect self-pay pharmacy, which will require patients to draw their own shots into a syringe rather than have them prefilled. The drug will be to any eligible adult with obesity and a valid prescription regardless of insurance coverage. Health care providers and doctors can start prescribing the higher doses on July 7, according to Lilly. Zepbound is an injectable prescription medicine that belongs to a class of drugs known as GLP-1 receptor agonists originally developed for type 2 diabetes, that may help adults for treating obesity and weight-related medical issues. “Obesity is a serious, chronic disease, and access to obesity medications should be treated with the same urgency as other chronic conditions,” Rhonda Pacheco, group vice president of U.S. Cardiometabolic Health at Lilly said in the press release. “Lilly was the first company to offer a self-pay solution for an FDA-approved obesity medication, and we continue to work to expand coverage for Zepbound. In the meantime, the availability of the two highest-dose Zepbound vials gives providers and patients another important treatment option.” While the weight-loss drugs are popular with consumers, not so much with insurance companies, who don’t always widely cover the drugs, leading Lily, and rival Novo Nordisk, the maker of Wegovy, to start offering their own self-pay options. The company first rolled out its self-pay, single-dose vials last summer in an effort to meet high consumer demand. Shares in the (NYSE: LLY) were trading down less than 2% at the market’s close on Monday. Eli Lily: By the numbers In Eli Lily’s latest round of earnings for the first quarter of 2025, ending March 31, 2025, the company showed a mixed performance, and reported net income of $2.76 billion and earnings per share (EPS) of $3.34, with revenue guidance between $58 billion and $61 billion. The drug maker has a market capitalization of $724.99 billion, as of this writing. The company is slated to report Q2 earnings in early August.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8891973717065078938",
        "title": "Eli Lilly to offer highest-dose Zepbound vials on LillyDirect",
        "url": "https://seekingalpha.com/news/4458301-eli-lilly-offer-all-zepbound-doses-on-lillydirect",
        "site": "seekingalpha.com",
        "time": 1750072276000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4091470494983604398",
        "title": "Eli Lilly’s early-stage obesity drug causes up to 11% of weight loss in three months",
        "url": "https://seekingalpha.com/news/4458167-eli-lillys-obesity-drug-causes-weight-loss",
        "site": "seekingalpha.com",
        "time": 1749905203000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1249908575668042521",
        "title": "Lilly’s Experimental Obesity Drug Shows Promise in Early Study",
        "url": "https://www.bloomberg.com/news/articles/2025-06-13/lilly-s-experimental-obesity-drug-shows-promise-in-early-study",
        "site": "bloomberg.com",
        "time": 1749846609000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "An experimental weight-loss drug from Eli Lilly & Co. helped patients lose weight with few side effects, according to the summary of a small study that suggests the company has another foothold in the obesity market. The Eli Lilly & Co. offices in Madrid, Spain, on Wednesday, April 23, 2025. Spain has risen to the top of European rankings for clinical trials, using some of the region’s most generous tax breaks and a relatively speedy regulatory process to reduce the lag from the start of a drug trial to approval.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2133347589051337469",
        "title": "Short bets on S&P 500 Healthcare sector ease in May; MRNA stays most shorted stock | $IBB $XLV $PPH $JNJ $LLY",
        "url": "https://seekingalpha.com/news/4457517-short-bets-on-sp-500-healthcare-sector-ease-in-may-mrna-stays-most-shorted-stock",
        "site": "seekingalpha.com",
        "time": 1749821745000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5915525540669759649",
        "title": "Lilly and Juvena partner to develop muscle health drugs | $LLY",
        "url": "https://seekingalpha.com/news/4457246-lilly-and-juvena-partner-to-develop-muscle-health-drugs",
        "site": "seekingalpha.com",
        "time": 1749647432000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8681872864149041986",
        "title": "Lilly Pacts Bar Telehealth Firms From Selling Copycat Zepbound",
        "url": "https://www.bloomberg.com/news/articles/2025-06-10/lilly-pacts-bar-telehealth-firms-from-selling-copycat-zepbound",
        "site": "bloomberg.com",
        "time": 1749574673000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly & Co. will only work with telehealth firms that agree to stop selling copycat versions of weight-loss drugs, diminishing the likelihood of a partnership with one most visible players in the industry, Hims & Hers Health Inc. An Eli Lilly & Co. Zepbound injection pens.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-815939242626436837",
        "title": "Novo Nordisk rises on report activist Parvus building stake | $NVO $LLY",
        "url": "https://seekingalpha.com/news/4456729-novo-nordisk-rises-on-report-activist-parvus-building-stake",
        "site": "seekingalpha.com",
        "time": 1749548396000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "3088507678349434337",
        "title": "Biggest stock movers Tuesday: LMNR, NVO, and more | $NVO $CBRL $LMNR $LLY",
        "url": "https://seekingalpha.com/news/4456733-biggest-stock-movers-tuesday-lmnr-nvo-and-more",
        "site": "seekingalpha.com",
        "time": 1749546248000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "58091967137390905",
        "title": "Biotech behind Eli Lilly obesity pill aims for new standard of care",
        "url": "https://www.ft.com/content/4fd1fd94-0b70-48fb-861b-3bad6286ebae",
        "site": "ft.com",
        "time": 1749355201000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Chugai Pharmaceutical looks to combine orforglipron with its drug to tackle muscle wasting",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7342404776105472155",
        "title": "Eli Lilly is said to have posted 60% rise in obesity drug sales in India last month",
        "url": "https://seekingalpha.com/news/4456348-eli-lilly-obesity-drug-sales-rise-60-india",
        "site": "seekingalpha.com",
        "time": 1749297118000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6943548427702809168",
        "title": "Lilly’s Obesity Drug Sales Rise 60% in India Amid Rising Demand",
        "url": "https://www.bloomberg.com/news/articles/2025-06-07/lilly-s-obesity-drug-sales-rise-60-in-india-amid-rising-demand",
        "site": "bloomberg.com",
        "time": 1749281703000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "4475106774946369388",
            "-1249908575668042521",
            "-7342404776105472155",
            "8158837564222393455"
        ],
        "description": "Eli Lilly & Co. increased sales of weight-loss and diabetes drug Mounjaro 60% in India in May from April in its second full month of being on offer in the South Asian country, which has the world’s third-highest number of obese people. CARLSBAD, CA-NOV 30TH: Mounjaro injection pen on display at Rachel Graham's home in Carlsbad, CA on Wednesday, November 30, 2022. Graham has battled excess weight for years, cycling through trendy diets, various drugs, and even bariatric surgery. she started a new medication, Mounjaro, and now is 30 pounds lighter(Photo by Sandy Huffaker for The Washington Post via Getty Images)",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5591673002200283817",
        "title": "Lack of permanent director sowing uncertainty at CDC - report | $AMGN $GSK $BMY $PFE $LLY",
        "url": "https://seekingalpha.com/news/4455918-lack-permanent-director-sowing-uncertainty-cdc",
        "site": "seekingalpha.com",
        "time": 1749141151000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4911135600595154274",
        "title": "Here's what is driving Tuesday's stock rally — plus, an analyst comes to Eli Lilly's defense",
        "url": "https://www.cnbc.com/2025/06/03/heres-what-is-driving-tuesdays-stock-rally-plus-an-analyst-comes-to-eli-lillys-defense.html",
        "site": "cnbc.com",
        "time": 1748975963000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8158837564222393455",
        "title": "Eli Lilly, Camurus in major deal to develop obesity, diabetes drugs | $LLY",
        "url": "https://seekingalpha.com/news/4455140-eli-lilly-camurus-in-major-deal-to-develop-obesity-diabetes-drugs",
        "site": "seekingalpha.com",
        "time": 1748974659000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8386255113273344535",
        "title": "Report finds an alarming rise in Wegovy use among U.S. teens | $NVO $LLY",
        "url": "https://seekingalpha.com/news/4454941-wegovy-use-rising-among-us-teens",
        "site": "seekingalpha.com",
        "time": 1748965013000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-783532900405951859",
        "title": "Notable healthcare headlines for the week: AstraZeneca, Eli Lilly, Bristol Myers in focus | $XLV $AMGN $BMY $CVS $LLY",
        "url": "https://seekingalpha.com/news/4454060-notable-healthcare-headlines-for-the-week-astrazeneca-eli-lilly-bristol-myers-in-focus",
        "site": "seekingalpha.com",
        "time": 1748783123000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1206013942323676594",
        "title": "Key deals this week: EOG Resources, VivoPower, Servotronics, Eli Lilly and more",
        "url": "https://seekingalpha.com/news/4454030-key-deals-this-week-eog-resources-vivopower-servotronics-eli-lilly-and-more",
        "site": "seekingalpha.com",
        "time": 1748718916000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1957382553089000449",
        "title": "Eli Lilly boosts pain pipeline with SiteOne Therapeutics acquisition | $VRTX $LLY",
        "url": "https://seekingalpha.com/news/4452585-eli-lilly-boosts-pain-pipeline-siteone-therapeutics-acquisition",
        "site": "seekingalpha.com",
        "time": 1748358223000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4191458929204993910",
        "title": "Obesity drug market forecast cut by Goldman Sachs | $NVO $LLY",
        "url": "https://seekingalpha.com/news/4452224-obesity-drug-market-forecast-cut-by-goldman-sachs",
        "site": "seekingalpha.com",
        "time": 1748189055000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8766612104696979945",
        "title": "Cramer's Lightning Round: Eli Lilly is a buy",
        "url": "https://www.cnbc.com/2025/05/23/cramers-lightning-round-eli-lilly-is-a-buy.html",
        "site": "cnbc.com",
        "time": 1748040907000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "\"Mad Money\" host Jim Cramer rings the lightning round bell, which means he's giving his answers to callers' stock questions at rapid speed.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "7446798418357645162",
        "title": "The Obesity-Drug Battle Is Heating Up After Novo's CEO Ouster",
        "url": "https://www.bloomberg.com/news/features/2025-05-23/wegovy-zepbound-weight-loss-drug-battle-heats-up-with-novo-ceo-ouster",
        "site": "bloomberg.com",
        "time": 1747972819000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The Wegovy maker’s executive shift is a sign of just how much it has fallen behind rival Lilly and its Zepbound shot. Injection pen parts on the Wegovy line at the Novo Nordisk A/S production facilities in Hillerod, Denmark, on Friday, March 8, 2024. Novo is Europe's most valuable company and little in Denmark can escape the drugmaker's gravitational pull.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6637834781307955643",
        "title": "Eli Lilly’s Alzheimer’s drug cleared in Australia despite setback for Biogen | $BIIB $LLY $ESALF $BRCTF $ESAIY",
        "url": "https://seekingalpha.com/news/4451501-eli-lilly-alzheimers-drug-cleared-australia",
        "site": "seekingalpha.com",
        "time": 1747912325000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8054047308284311430",
        "title": "Cigna’s Evernorth caps weight-loss drug copays at $200/month | $NVO $LLY $CI",
        "url": "https://seekingalpha.com/news/4451481-cignas-evernorth-caps-weight-loss-drug-copays-at-200month",
        "site": "seekingalpha.com",
        "time": 1747909869000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-3438671097212098335",
        "title": "Cigna announces new deal for copay caps on Eli Lilly and Novo Nordisk weight loss drugs",
        "url": "https://www.cnbc.com/2025/05/21/cigna-eli-lilly-novo-nordisk-weight-loss-drugs.html",
        "site": "cnbc.com",
        "time": 1747859824000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Cigna's pharmacy benefits unit Evernorth said the deal will bring prices down for employers and their workers.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-9157267883938704374",
        "title": "FDA offering states help for Canada drug importation proposals | $AMGN $JNJ $BMY $PFE $LLY",
        "url": "https://seekingalpha.com/news/4451119-fda-offering-states-help-canada-drug-importation-proposals",
        "site": "seekingalpha.com",
        "time": 1747843402000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8628092359729796805",
        "title": "Novo Nordisk is betting on a CEO shakeup to regain its weight loss drug edge over Eli Lilly",
        "url": "https://www.cnbc.com/2025/05/19/novo-nordisk-new-ceo-weight-loss-drugs-eli-lilly.html",
        "site": "cnbc.com",
        "time": 1747674754000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Novo Nordisk's new top executive will need to help the company close the gap with Eli Lilly, fend off emerging rivals and navigate other challenges",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6386547427043959949",
        "title": "Zepbound, Mounjaro sales buoy Eli Lilly family endowment | $LLY",
        "url": "https://seekingalpha.com/news/4449870-zepbound-mounjaro-sales-buoy-eli-lilly-family-endowment",
        "site": "seekingalpha.com",
        "time": 1747511846000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "809532335789140637",
        "title": "FDA greenlights first blood test to diagnose Alzheimer's disease | $BIIB $LLY $ESALF $ESAIY $LH",
        "url": "https://seekingalpha.com/news/4449862-fda-clears-first-blood-based-alzheimers-test",
        "site": "seekingalpha.com",
        "time": 1747489560000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6889392328104442510",
        "title": "Weight-Loss Drug Craze Boosts $80 Billion Lilly Endowment to Largest in US",
        "url": "https://www.bloomberg.com/news/articles/2025-05-16/eli-lilly-stock-boom-from-zepbound-boosts-lilly-endowment-to-largest-in-us",
        "site": "bloomberg.com",
        "time": 1747416583000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The endowment started by the founding family of drugmaker Eli Lilly saw its assets surge to $80 billion at the end of 2024, passing Bill Gates’ foundation for the top spot. Eli Lilly & Co. Mounjaro brand tirzepatide medication arranged in Austin, Texas, US, on Sunday, March 3, 2024. Weight-loss shot users are looking to influencers for guidance absent proper follow-up care.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-255153399234694401",
        "title": "Eli Lilly, compounders partly to blame for Novo CEO’s ouster | $NVO $LLY $NONOF $HIMS",
        "url": "https://seekingalpha.com/news/4449657-eli-lilly-compounders-blame-novo-ceo-ouster",
        "site": "seekingalpha.com",
        "time": 1747412779000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2291657598153540232",
        "title": "Novo Replaces CEO Jorgensen After Lilly Rivalry Hits Shares",
        "url": "https://www.bloomberg.com/news/videos/2025-05-16/novo-replaces-ceo-after-lilly-rivalry-hits-shares-video",
        "site": "bloomberg.com",
        "time": 1747409351000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Novo Nordisk A/S is replacing CEO Lars Fruergaard Jorgensen due to increased competition for its Wegovy obesity shots and a 53% decline in its share price over the past 12 months. The company's share price has sliced more than $300 billion off its market value, and it has faced setbacks in trials of new weight-loss drugs and growing competition from Eli Lilly & Co. Jorgensen will continue as CEO for a period to support a smooth transition to new leadership, and the search for a new leader has begun. Bloomberg Intelligence's Michael Shah reports. (Source: Bloomberg)",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6511409615637593420",
        "title": "Zealand CEO: Oral weight loss meds are not the future for treating obesity | $AMGN $RHHBY $NVO $LLY $ALT",
        "url": "https://seekingalpha.com/news/4449296-zealand-ceo-oral-weight-loss-meds-not-future-for-treating-obesity",
        "site": "seekingalpha.com",
        "time": 1747346044000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7130066717530328825",
        "title": "Eli Lilly sees Alzheimer's drug development beyond amyloid beta targeting",
        "url": "https://seekingalpha.com/news/4449048-eli-lilly-sees-alzheimers-drug-development-beyond-amyloid-beta-targeting",
        "site": "seekingalpha.com",
        "time": 1747332216000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2891057196057950192",
        "title": "Bayer exec: Trump pharma tariffs would negatively impact R&D | $AMGN $BMY $PFE $LLY $MRK",
        "url": "https://seekingalpha.com/news/4448939-bayer-exec-trump-pharma-tariffs-would-negatively-impact-research-and-development",
        "site": "seekingalpha.com",
        "time": 1747323346000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1882696942065312279",
        "title": "Short bets against S&P 500 healthcare stocks climb in April; MRNA retains top shorted ranking | $IBB $XLV $PPH $JNJ $LLY",
        "url": "https://seekingalpha.com/news/4447073-short-bets-against-sp-500-healthcare-stocks-climb-in-april-mrna-retains-top-shorted-ranking",
        "site": "seekingalpha.com",
        "time": 1747316130000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-2133347589051337469"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-238493686481362586",
        "title": "Irish Exports to US Soar 395% in March on Tariff Threat",
        "url": "https://www.bloomberg.com/news/articles/2025-05-15/irish-exports-to-us-soar-395-in-march-on-tariff-threat",
        "site": "bloomberg.com",
        "time": 1747303925000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The value of exports from Ireland to the US rose 394.9% in March from a year earlier, on medical and pharmaceutical goods, the statistics office said. Sample bottles at the production lab in the Eli Lilly & Co. manufacturing plant in Kinsale, Ireland.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-611165736927414161",
        "title": "Sanofi will invest at least $20B in the U.S., focus on R&D spends | $SNY $GILD $JNJ $LLY",
        "url": "https://seekingalpha.com/news/4448146-sanofi-will-invest-at-least-20b-in-the-us-focus-on-rd-spends",
        "site": "seekingalpha.com",
        "time": 1747242035000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "572368284042353599",
        "title": "Stock Movers: Apple, Eli Lilly, NRG Energy (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-12/stock-movers-apple-eli-lilly-nrg-energy-podcast",
        "site": "bloomberg.com",
        "time": 1747084872000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 5:51 Apple Inc Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8754954249369292258",
        "title": "Roche plans $700M North Carolina facility | $RHHBY $GILD $JNJ $LLY",
        "url": "https://seekingalpha.com/news/4446479-roche-plans-700m-north-carolina-facility",
        "site": "seekingalpha.com",
        "time": 1747061591000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4475676524578403789",
        "title": "Patricia Clarkson's biggest career regret? Losing out on a role in 'Big.'",
        "url": "https://www.businessinsider.com/patricia-clarkson-movie-tv-roles-untouchables-harvey-weinstein-station-agent-2025-5",
        "site": "businessinsider.com",
        "time": 1747059197000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Patricia Clarkson in \"Sharp Objects,\" \"Lilly,\" and \"The Station Agent.\"HBO; Blue Harbor Entertainment; MiramaxBy the mid-1990s, Patricia Clarkson's career had reached new heights — literally.\"I got flown first class to Vancouver!\" Clarkson, 65, recalled to Business Insider of shooting the 1995 fantasy adventure movie \"Jumanji.\" \"Things were going well.\"A bigger paycheck for a small role in a blockbuster starring Robin Williams was Clarkson's first real taste of being in the big leagues, something she'd dutifully worked towards since her breakout role as the wife of Kevin Costner's character Eliot Ness in Brian De Palma's 1987 hit \"The Untouchables.\"Life was good — until suddenly, it wasn't. By 1997, the worked had dried up.\"I was starting to struggle,\" Clarkson said. \"That's when 'High Art' came into my life and changed everything.\"Patricia Clarkson in \"High Art.\"October FilmsThe independent romantic drama, in which Clarkson played Greta, the German heroin-addicted girlfriend of photographer Lucy (Ally Sheedy), who's entangled in a love affair, was the darling of the 1998 Sundance Film Festival. The role opened up the world of independent film to Clarkson, garnering her her first nomination for an Independent Spirit Award and paving the way for her to become a fixture in indie film for the rest of her career.Since then, Clarkson has become one of the most dependable character actors on both the big and small screens. She won two Emmys playing Sarah O'Connor on the acclaimed HBO series \"Six Feet Under,\" earned an Oscar nomination for \"Pieces of April,\" and scared the hell out of audiences in Martin Scorsese's \"Shutter Island\" (and the HBO miniseries \"Sharp Objects\").Now, she's returning to her indie roots playing the eponymous lead in \"Lilly,\" a biopic on Lilly Ledbetter, whose landmark win against her employer, Goodyear Tire and Rubber Co., for gender pay discrimination was a major moment in the fight for fair and equal pay in America.Patricia Clarkson in \"Lilly.\"Blue Harbor Entertainment\"What was important to me was to see this woman as just an ordinary mother and woman who kind of rises from the ashes,\" Clarkson said of the role.Thanks to independent film, Clarkson has done the same.In our latest \"Role Play\" interview, Clarkson looks back on her big break, battling with Harvey Weinstein over her awards season run for \"The Station Agent,\" and her \"spicy era\" starring in romantic dramas.On her career beginnings and how Brian DePalma got her paid extra on 'The Untouchables'Patricia Clarkson in \"The Untouchables.\"Paramount PicturesBusiness Insider: Your first screen credit is quite impressive, playing Kevin Costner's wife in Brian De Palma's \"The Untouchables.\" Tell me about that audition process. Patricia Clarkson: I was out of Yale several months, and I had just gotten my first Broadway job, \"House of Blue Leaves,\" and then I go in to read for \"The Untouchables\" with the legendary casting director Lynn Stalmaster.I went in kind of dressed as Southern glamorous. I had my hair done, makeup, pretty sexy dress. Lynn said to me he thought Brian De Palma would like me, but he said, \"Don't look like this. Put on a simple dress and no makeup.\" I was like, No makeup? So I did. I had very long hair at the time and had this dress that tied in the back, and maybe a touch of lipstick. I came in and I was supposed to do my lines with a reader, but Brian said, \"I'm going to read with you.\" He liked the juxtaposition of me in this \"Little House on the Prairie\" dress and my deep voice. We started talking, and I made him laugh, and he was just lovely to me. So I went right to Chicago and met Kevin Costner because he was already there preparing, and I got the job. Patricia Clarkson in 1991.Bob D'Amico/ABC/GettyAnd then right when you thought you were done with the job, Brian surprised you with something. Yes! This was a very supporting part, so I was set to be done, and Brian decided that I had to be in the courtroom scene. He wanted to have one close-up of me in the courtroom. So he told Paramount, \"Look, I guess we'll have to hold Patti for a month because we're not shooting the courtroom for another month.\" And it was a godsend.I was making scale, I was an unknown, but that extra month helped me out. I mean, I had student loans to pay, I was living in New York. Despite it being scale, which back then was maybe $1,000, it was more money than I had. It was a saving grace, and it was all because of Brian De Palma. On her path to indie film and sparring with Harvey WeinsteinPeter Dinklage, Patricia Clarkson, and Bobby Cannavale in \"The Station Agent.\"Miramax FilmsAfter \"High Art,\" you had become something of an indie darling: \"Pieces of April,\" \"The Station Agent,\" and \"All the Real Girls\" all had their world premieres at the 2003 Sundance Film Festival. But during the filming of any of that, did you ever question your choices, say, sitting in a station wagon all day making \"Pieces of April\" or hanging out by a train station doing \"The Station Agent\"? No. These were gifts. They were remarkable films, and I knew it. I didn't know Tom McCarthy, who made \"The Station Agent.\" He knew Bobby [Cannavale] and Pete [Dinklage], but he didn't know me, though he wrote the part for me. So I read it and I couldn't say yes fast enough. We struggled to get it made, it was $500,000 to make. We made \"Pieces of April\" for something like $200,000, but it was such a beautiful part, and Peter Hedges, the director, made me a better actor. So did Tom.These were parts that required so much of me. A lot of myself is in these parts, a lot of my own life's struggles and traumas. But also joy. I mean, can you imagine being on a set all day with Peter Dinklage and Bobby Cannavale? It doesn't get better than that. It was truly a labor of love, those movies. But it was glorious. Being a fixture in independent film in the 2000s, you crossed paths with Harvey Weinstein, whose Miramax Films released \"The Station Agent.\" He wanted to campaign you for award season in the supporting actress category despite you being the lead in \"The Station Agent.\" At the same time, United Artists head Bingham Ray was doing a supporting actress campaign for you on \"Pieces of April.\" Tell me about the battle with Harvey.I hate false categories. I hate when actors put themselves in false categories. I think that's something that needs to be addressed by the Academy. Too often it happens. When you are supporting, you should be truly a supporting player, and when you're the lead, you have to step up and go into a harder category.I was the lead in \"Station Agent,\" so I said, \"No, Harvey, I'm not going into supporting, I'm going in supporting for 'Pieces of April' because I'm definitely supporting in that. Katie Holmes is clearly the lead of that film.\" I was not going to betray Bingham. So I went up against Harvey, and he told me I'd never work again. Well, na, na, na, na, naaa. [Laughs.]Did it get uglier than that?Oh, yes. Threatening. It got very ugly. Some people hoped I'd switch categories but I wasn't going to. They didn't understand that I would be a shit to do that. It would have been dishonest and wrong. And I had the greatest moment of my career when the SAG awards came out and I was nominated for best actress in \"The Station Agent\" and best supporting for \"Pieces.\" You then got the Oscar nomination for \"Pieces of April.\" Going through all of that with Weinstein, was that motivation to take the role of New York Times editor Rebecca Corbett in \"She Said\"?Oh yeah. I don't talk about it much because of the women who were abused by him physically and deeply emotionally. This was patter to me, what I went through with Harvey. It was still difficult and terrible what he did to me, but compared to so many women who went through so much more, it was odd to talk about it. But, yes, of course, it was a motivation to do \"She Said.\" Of course it was. On spending hours inside a cave shooting Martin Scorsese's 'Shutter Island' and the role she still wishes she'd gottenPatricia Clarkson in \"Shutter Island.\"Paramount PicturesI believe working with Martin Scorsese on \"Shutter Island\" was quite memorable, right?[Laughs.] Oh, I shot quite some time in that cave scene. But it was a scene that you dream of as an actor working with arguably the greatest American director. It was just me and Leo [DiCaprio], that doesn't get any better.I remember, I was shooting the Woody Allen movie \"Whatever Works\" at the same time. I left Woody to go shoot with Marty. And I remember, Woody was like, \"He better get you back here.\" A car picked me up from the set of \"Whatever Works\" in New York City, where we were shooting by the UN, and drove me to Boston. And I'm in that cave, and we did so many takes, I didn't know if I would ever see light again. [Laughs.] But Marty is glorious because he just lets you play. Every suggestion you have, he loves and he wants you to try it. He's the emblem of greatness. When your heroes don't disappoint, it's always the greatest time of your life. From 2008 to 2009, there was a brief Patti Clarkson spicy era with you in romantic starring roles in \"Elegy\" and \"Cairo Time\"—Oh, and I loved my spicy era! I mean, I often play downtrodden women, but in life I'm actually spicy. I'm New Orleans. I love my tight dresses and my high heels. And I still do. So doing those two movies, I hope those aren't the last time doing those.Going to Cairo, I fell in love with that city and the people. I have such beautiful memories, and it was so much fun playing a romantic leading woman. It was sexy and fun. And with \"Elegy,\" I started that shoot naked on top of Sir Ben Kingsley. No better way to start the day! Is there a role you most regret passing on, or one you still wish you'd gotten?Early on, I lost quite a few parts. I went out to be opposite Tom Hanks in \"Big.\" I didn't get cast, but I would have loved to have been in that.You have to learn with rejection. There is always rejection in this",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2846839545410729080",
        "title": "Pfizer, Eli Lilly, Merck and Other Pharma Stocks Fall as Trump Targets Lower Drug Prices",
        "url": "https://www.barrons.com/articles/pfizer-merck-stock-pharma-prices-trump-dbab7d47?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1747048200000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "2128700832216391200",
        "title": "Here’s how much extra weight is lost with Zepbound over Wegovy",
        "url": "https://www.marketwatch.com/story/heres-how-much-extra-weight-is-lost-with-eli-lillys-drug-over-novo-nordisks-e90db3c6?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1747045200000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "lly"
        ],
        "description": "A study of two blockbuster weight-loss drugs came out in favor of Eli Lilly over its rival Novo Nordisk.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1973464485162140034",
        "title": "These Stocks Are Moving the Most Today: Amazon, Nvidia, Tesla, Alibaba, Eli Lilly, Pfizer, and More",
        "url": "https://www.barrons.com/articles/stock-market-movers-66443cec?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1747041600000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7838170574292392425",
        "title": "Biggest stock movers Monday: Magnificent Seven, and more | $AAPL $AMZN $NVO $LLY $TSLA",
        "url": "https://seekingalpha.com/news/4446257-biggest-stock-movers-monday-magnificent-seven-and-more",
        "site": "seekingalpha.com",
        "time": 1747041062000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6945131278645638453",
        "title": "Lilly’s Zepbound Trims More Belly Fat Than Novo’s Wegovy",
        "url": "https://www.bloomberg.com/news/articles/2025-05-11/lilly-s-zepbound-trims-more-belly-fat-than-novo-s-wegovy",
        "site": "bloomberg.com",
        "time": 1747000860000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-8801508296851543381"
        ],
        "description": "Eli Lilly & Co.’s obesity drug Zepbound helped people trim about two inches more off their waists than Novo Nordisk A/S’s Wegovy in the first head-to-head study of the rival medicines. A Zepbound injection pen.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "7238071687898198149",
        "title": "Lilly to expand Purdue University partnership with up to a $250M investment | $LLY",
        "url": "https://seekingalpha.com/news/4445728-lilly-to-expand-purdue-university-partnership-with-up-to-a-250m-investment",
        "site": "seekingalpha.com",
        "time": 1746796186000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2375935541970471505",
        "title": "Dividend Roundup: Eli Lilly, Pepsico, Ford, Delta Air Lines, and more | $F $PEP $LLY $DAL $VLO",
        "url": "https://seekingalpha.com/news/4445637-dividend-roundup-eli-lilly-pepsico-ford-delta-air-lines-and-more",
        "site": "seekingalpha.com",
        "time": 1746789853000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1461587724979544407",
        "title": "Why Eli Lilly is falling — plus, what new Costco sales say about the consumer",
        "url": "https://www.cnbc.com/2025/05/08/why-eli-lilly-is-falling-plus-what-costco-sales-say-about-consumer.html",
        "site": "cnbc.com",
        "time": 1746719378000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "2365901275799788361",
        "title": "Merck boosts U.S. investments with $895M expansion in Kansas site | $MRK $GILD $JNJ $LLY",
        "url": "https://seekingalpha.com/news/4444575-merck-announces-895m-expansion-kansas-site",
        "site": "seekingalpha.com",
        "time": 1746711772000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1158691217273992330",
        "title": "Lilly names new executives in leadership transition",
        "url": "https://seekingalpha.com/news/4444306-lilly-names-new-executives-in-leadership-transition",
        "site": "seekingalpha.com",
        "time": 1746701685000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1076819156025046496",
        "title": "‘Lilly’ Review: She Did It Her Way",
        "url": "https://www.nytimes.com/2025/05/08/movies/lilly-review-she-did-it-her-way.html",
        "site": "nytimes.com",
        "time": 1746694875000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Patricia Clarkson plays the equal pay activist Lilly Ledbetter in this misty-eyed drama.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "5452945465085535338",
        "title": "Lilly benefits as judge upholds FDA removing Zepbound from shortages list",
        "url": "https://seekingalpha.com/news/4443637-eli-lilly-benefits-judge-upholds-fda-removing-zepbound-shortages-list",
        "site": "seekingalpha.com",
        "time": 1746649111000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8761993409895210421",
        "title": "Gilead to invest about $32B in U.S. manufacturing through 2030 | $GILD $JNJ $LLY",
        "url": "https://seekingalpha.com/news/4443572-gilead-to-invest-about-32b-in-us-manufacturing-through-2030",
        "site": "seekingalpha.com",
        "time": 1746645250000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-507674646924111962",
        "title": "Eli Lilly looks set to steal Novo Nordisk’s weight-loss crown",
        "url": "https://www.economist.com/business/2025/05/07/eli-lilly-looks-set-to-steal-novo-nordisks-weight-loss-crown",
        "site": "economist.com",
        "time": 1746643205000,
        "favicon_url": "https://static.tickertick.com/website_icons/economist.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Despite a late start, the American firm is bearing down on its Danish rival",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6422268438424934778",
        "title": "Healthy Returns: Novo Nordisk’s Wegovy deal with CVS won't derail Eli Lilly's obesity market dominance",
        "url": "https://www.cnbc.com/2025/05/07/healthy-returns-novo-nordisk-cvs-wegovy-deal-eli-lilly.html",
        "site": "cnbc.com",
        "time": 1746627843000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "8054047308284311430",
            "-3438671097212098335",
            "4342845254453690640",
            "-507674646924111962"
        ],
        "description": "Eli Lilly won't lose its grip on the weight loss market despite recent investor concerns. Meanwhile, Zocdoc releases an AI-powered scheduling assistant.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4085471695175472836",
        "title": "Novo Nordisk cuts 2025 outlook. But why are its shares rising? | $NVO $NONOF $LLY $HIMS",
        "url": "https://seekingalpha.com/news/4442896-novo-nordisk-stock-rises-despite-guidance-cut",
        "site": "seekingalpha.com",
        "time": 1746616369000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2327789573415714079",
        "title": "Trump Is Threatening Big Pharma With Tariffs. Tax Changes Might Work Better.",
        "url": "https://www.wsj.com/health/pharma/trump-is-threatening-big-pharma-with-tariffs-tax-changes-might-work-better-e543ecbb?.tsrc=rss",
        "site": "wsj.com",
        "time": 1746610200000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Unlike many industries that might never come back, pharma can build more in the U.S.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5943998459091976254",
        "title": "Trump administration cancels meeting with FDA workers union - report | $AMGN $BMY $PFE $LLY $MRK",
        "url": "https://seekingalpha.com/news/4442326-trump-administration-cancels-meeting-fda-workers-union",
        "site": "seekingalpha.com",
        "time": 1746556674000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-939687653920187040",
        "title": "Eli Lilly in licensing pact with Alchemab for ALS program | $LLY",
        "url": "https://seekingalpha.com/news/4441711-eli-lilly-in-pact-alchemab-als-progra",
        "site": "seekingalpha.com",
        "time": 1746528982000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4786229602247175616",
        "title": "Eli Lilly declares $1.50 dividend",
        "url": "https://seekingalpha.com/news/4441187-eli-lilly-declares-1_50-dividend",
        "site": "seekingalpha.com",
        "time": 1746463847000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "2418536624684007320",
        "title": "Healthcare sector flexes earnings muscle, but top-line cracks show | $XLV $AMGN $CVS $PFE $LLY",
        "url": "https://seekingalpha.com/news/4439959-healthcare-scorecard",
        "site": "seekingalpha.com",
        "time": 1746310200000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4491491041333954576",
        "title": "Stock Movers: Apple, Eli Lilly, Spotify (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-02/stock-movers-apple-eli-lilly-spotify-podcast",
        "site": "bloomberg.com",
        "time": 1746222659000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-8780552709086461911",
            "572368284042353599",
            "-8162781910670267719"
        ],
        "description": "Source: Bloomberg, 5:19 Apple Inc Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6296896454412569562",
        "title": "Novo Nordisk says oral version of Wegovy accepted for FDA review | $NVO $NONOF $LLY",
        "url": "https://seekingalpha.com/news/4440551-novo-nordisk-says-oral-wegovy-undergoes-fda-review",
        "site": "seekingalpha.com",
        "time": 1746211838000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-3608476993179785377",
        "title": "Cigna to launch specialized GLP-1 pharmacy next month | $NVO $LLY $CI $NONOF $CVS",
        "url": "https://seekingalpha.com/news/4440348-cigna-to-launch-glp-1-pharmacy-next-month",
        "site": "seekingalpha.com",
        "time": 1746199999000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6212655364388241524",
        "title": "Stock Movers: Eli Lilly, Qualcomm, Carrier Global (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-01/stock-movers-eli-lilly-qualcomm-carrier-global-podcast",
        "site": "bloomberg.com",
        "time": 1746127417000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 5:34 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4647285831546765501",
        "title": "WHO set to back use of weight loss drugs such as Zepbound, Wegovy - report | $NVO $LLY",
        "url": "https://seekingalpha.com/news/4439257-who-set-back-use-weight-loss-drugs-such-zepbound-wegovy",
        "site": "seekingalpha.com",
        "time": 1746125076000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1364072774641997554",
        "title": "Obesity Drug Price Wars Heating Up as CVS Picks Novo Over Lilly",
        "url": "https://www.bloomberg.com/news/articles/2025-05-01/obesity-drug-price-wars-heating-up-as-cvs-picks-novo-over-lilly",
        "site": "bloomberg.com",
        "time": 1746122877000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The obesity drug price wars are finally starting. Wegovy injection pens arranged in Waterbury, Vermont, US, on Monday, April 28, 2025. Novo Nordisk A/S is following in rival Eli Lilly & Co.’s footsteps by selling its hit weight-loss drug Wegovy directly to US patients at a discount.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6973346199937422570",
        "title": "Eli Lilly's earnings beat is clouded by Novo news. What it means for investors",
        "url": "https://www.cnbc.com/2025/05/01/eli-lillys-beat-is-clouded-by-novo-news-what-it-means-for-investors.html",
        "site": "cnbc.com",
        "time": 1746121422000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "We suspect the CVS Health change, which goes into effect on July 1, could put a temporary overhang on Eli Lilly shares.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8264791975714901147",
        "title": "Stock Movers: Kohl's, Eli Lilly, Microsoft (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-01/stock-movers-kohl-s-eli-lilly-microsoft-podcast",
        "site": "bloomberg.com",
        "time": 1746113446000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 3:09 Microsoft Corp Photographer: Kiyoshi Ota/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "2251731687492052661",
        "title": "Stock Movers: Meta, Eli Lilly, Kohl's (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-01/stock-movers-meta-eli-lilly-kohl-s-podcast",
        "site": "bloomberg.com",
        "time": 1746109245000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 3:60 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8598491919089321313",
        "title": "CVS Health picks Novo’s Wegovy ahead of Lilly’s Zepbound | $CVS $NVO $LLY $NONOF",
        "url": "https://seekingalpha.com/news/4439028-cvs-health-favors-novos-wegovy-blow-lilly",
        "site": "seekingalpha.com",
        "time": 1746106983000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "9119293077313284379",
        "title": "Stock Movers: McDonald's, Eli Lilly, Qualcomm (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-01/stock-movers-mcdonald-s-eli-lilly-qualcomm-podcast",
        "site": "bloomberg.com",
        "time": 1746106327000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 3:39 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "7627706470462850232",
        "title": "Eli Lilly CEO says company can help 'respond' to national security concerns around essential drugs as tariffs loom",
        "url": "https://www.cnbc.com/2025/05/01/eli-lilly-ceo-david-ricks-trump-pharmaceutical-tariffs.html",
        "site": "cnbc.com",
        "time": 1746105102000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Ricks said reshoring manufacturing capacity for older essential medicines is \"a valid thing,\" adding that Eli Lilly is \"happy to help.\"",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2209154641527803620",
        "title": "Eli Lilly slips after lowering earnings outlook | $LLY $NVO $NONOF",
        "url": "https://seekingalpha.com/news/4438881-eli-lilly-stock-slips-after-guidance-cut",
        "site": "seekingalpha.com",
        "time": 1746099616000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "7206654542716626384",
        "title": "Eli Lilly in charts: Worldwide Mounjaro revenue rose 113% in Q1 | $LLY",
        "url": "https://seekingalpha.com/news/4438840-eli-lilly-in-charts-worldwide-mounjaro-revenue-rose-113-in-q1",
        "site": "seekingalpha.com",
        "time": 1746097831000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7837330047940734181",
        "title": "CVS Health to exit Obamacare; in pact with Novo to improve Wegovy access | $CVS $NVO $LLY",
        "url": "https://seekingalpha.com/news/4438832-cvs-health-stock-gains-q1-beat",
        "site": "seekingalpha.com",
        "time": 1746097822000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "7733530520975426389",
        "title": "Eli Lilly sales soar 45% on weight loss drug demand, but drugmaker cuts profit outlook after cancer treatment deal",
        "url": "https://www.cnbc.com/2025/05/01/eli-lilly-lly-earnings-q1-2025.html",
        "site": "cnbc.com",
        "time": 1746097600000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly said sales of weight loss drug Zepbound and diabetes treatment Mounjaro soared in the first quarter.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6674757440354740846",
        "title": "Lilly Cuts Earnings Guidance on Research Charges, Shares Fall",
        "url": "https://www.bloomberg.com/news/articles/2025-05-01/lilly-cuts-earnings-guidance-on-research-charges-shares-fall",
        "site": "bloomberg.com",
        "time": 1746097441000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly & Co. cut its earnings outlook on research charges and maintained its full-year sales guidance as its blockbuster weight-loss drug performed in line with Wall Street’s expectations in the first quarter, a result that underwhelmed investors. An Eli Lilly & Co. logo at the company's offices in Madrid. Photographer: Emilio Parra Doiztua/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8925988421862299008",
        "title": "Earnings Snapshot: Eli Lilly profit and revenue outlook lag estimates | $LLY",
        "url": "https://seekingalpha.com/news/4438808-earnings-snapshot-eli-lilly-profit-and-revenue-outlook-lag-estimates",
        "site": "seekingalpha.com",
        "time": 1746097188000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8019551308775468112",
        "title": "Eli Lilly misses bottom-line estimates; updates FY25 outlook",
        "url": "https://seekingalpha.com/news/4438805-eli-lilly-misses-bottom-line-estimates-updates-fy25-outlook",
        "site": "seekingalpha.com",
        "time": 1746096930000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-2209154641527803620",
            "-101521297204461903",
            "-8925988421862299008"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7277596446049466024",
        "title": "CVS Drops Lilly’s Zepbound from Preferred Coverage in Novo Win",
        "url": "https://www.bloomberg.com/news/articles/2025-05-01/cvs-drops-lilly-s-zepbound-from-preferred-coverage-in-novo-win",
        "site": "bloomberg.com",
        "time": 1746095400000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "CVS Health Corp.’s drug-benefits unit negotiated a deal to make Novo Nordisk A/S’s Wegovy more widely available to its members, a blow to rival Eli Lilly & Co.’s Zepbound that was moved off the company’s list of preferred drugs. Wegovy injection pens.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8378675283504180257",
        "title": "Eli Lilly Q1 2025 Earnings Preview | $LLY",
        "url": "https://seekingalpha.com/news/4437583-eli-lilly-q1-2025-earnings-preview",
        "site": "seekingalpha.com",
        "time": 1746020135000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4893455795433429911",
        "title": "Why New Wegovy Deals Won’t Restore Novo Nordisk’s Obesity Lead",
        "url": "https://www.wsj.com/health/pharma/novo-nordisk-ozempic-eli-lilly-c7ac45ae?.tsrc=rss",
        "site": "wsj.com",
        "time": 1746005400000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The Danish drugmaker is expanding Wegovy access via telehealth providers like Hims and Ro. But the gap with Eli Lilly is only getting wider.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6778327120024350339",
        "title": "WeightWatchers rises on partnership with Eli Lilly to enhance Zepbound access",
        "url": "https://seekingalpha.com/news/4436936-weightwatchers-rises-on-partnership-with-eli-lilly-to-enhance-zepbound-access",
        "site": "seekingalpha.com",
        "time": 1745935364000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5174231625881512737",
        "title": "CEOs from Nividia, J&J and Eli Lilly to join Trump's \"Invest in America\" event at White House",
        "url": "https://www.axios.com/2025/04/29/trump-us-investment-ceo-nividia-eli-lilly-tariffs",
        "site": "axios.com",
        "time": 1745899129000,
        "favicon_url": "https://static.tickertick.com/website_icons/axios.com.ico",
        "tags": [
            "lly"
        ],
        "description": "President Trump will host on Wednesday top executives from companies including Nvidia, Johnson & Johnson, Eli Lilly, GE Aerospace and SoftBank, as promotes investment in the U.S., per the White House.Why it matters: The White House regards investment policy as \"critical\" to U.S. national and economic security, but Axios' Courtenay Brown and Neil Irwin report Trump's tariffs threats have left the country's status as the top global investment magnet in doubt as businesses hit pause.Driving the news: Trump will host CEOs and industry leaders who've committed to investing at the U.S. at the \"Invest in America\" event, Bloomberg first reported.The event is designed to attract more investors as it highlights investments so far, a White House official said.Zoom in: Among these investment pledges are the United Arab Emirates' commitment to a 10-year, $1.4 trillion investment framework in the U.S.Trump announced soon after taking office commitments from OpenAI, SoftBank, Oracle and the UAE's MGX to invest in AI infrastructure for OpenAI in the U.S.Johnson & Johnson has pledged to spend $55 billion in the U.S. over the next four years on manufacturing, research and technology investments.And Taiwan Semiconductor Manufacturing Co. said it will invest an additional $100 billion in U.S. chips production.What they're saying: \"President Trump has secured more investments in the United States of America in 100 days than Joe Biden did in four years,\" White House press secretary Karoline Leavitt said in an emailed statement Monday evening.\"President Trump is America's businessman in chief and that's why more than $5.3 trillion dollars have flooded our country bringing new jobs and investments to middle-class communities from coast to coast.\"Zoom out: The Trump administration has said tariffs will encourage domestic production and investment.However, retailers have warned U.S. imports could drop by at least 20% in the second half of 2025 if higher tariffs remain in place and they've expressed concern that there could be shortages if this happens.Trump has in recent days softened his tone on tariffs and Treasury Secretary Scott Bessent has said U.S. and China are talking on key economic matters, despite Beijing saying otherwise as the two nations face off in a trade war.More from Axios:How tariffs can cause a recession Tariffs imperil America's status as world investment magnetTrump ready to bail out farmers amid trade war squeeze, Rollins says President Trump will host on Wednesday top executives from companies including Nvidia, Johnson & Johnson, Eli Lilly, GE Aerospace and SoftBank, as promotes investment in the U.S., per the White House.Why it matters: The White House regards investment policy as \"critical\" to U.S. national and economic security, but Axios' Courtenay Brown and Neil Irwin report Trump's tariffs threats have left the country's status as the top global investment magnet in doubt as businesses hit pause.Driving the news: Trump will host CEOs and industry leaders who've committed to investing at the U.S. at the \"Invest in America\" event, Bloomberg first reported.The event is designed to attract more investors as it highlights investments so far, a White House official said.Zoom in: Among these investment pledges are the United Arab Emirates' commitment to a 10-year, $1.4 trillion investment framework in the U.S.Trump announced soon after taking office commitments from OpenAI, SoftBank, Oracle and the UAE's MGX to invest in AI infrastructure for OpenAI in the U.S.Johnson & Johnson has pledged to spend $55 billion in the U.S. over the next four years on manufacturing, research and technology investments.And Taiwan Semiconductor Manufacturing Co. said it will invest an additional $100 billion in U.S. chips production.What they're saying: \"President Trump has secured more investments in the United States of America in 100 days than Joe Biden did in four years,\" White House press secretary Karoline Leavitt said in an emailed statement Monday evening.\"President Trump is America's businessman in chief and that's why more than $5.3 trillion dollars have flooded our country bringing new jobs and investments to middle-class communities from coast to coast.\"Zoom out: The Trump administration has said tariffs will encourage domestic production and investment.However, retailers have warned U.S. imports could drop by at least 20% in the second half of 2025 if higher tariffs remain in place and they've expressed concern that there could be shortages if this happens.Trump has in recent days softened his tone on tariffs and Treasury Secretary Scott Bessent has said U.S. and China are talking on key economic matters, despite Beijing saying otherwise as the two nations face off in a trade war.More from Axios:How tariffs can cause a recession Tariffs imperil America's status as world investment magnetTrump ready to bail out farmers amid trade war squeeze, Rollins says",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2034221443616859783",
        "title": "Nvidia, Eli Lilly Among CEOs to Tout US Investments With Trump",
        "url": "https://www.bloomberg.com/news/articles/2025-04-28/nvidia-eli-lilly-among-ceos-to-tout-us-investments-with-trump",
        "site": "bloomberg.com",
        "time": 1745874000000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Chief executive officers from Nvidia Corp., Johnson & Johnson, Eli Lilly & Co., General Electric Co. and SoftBank Group Corp. are among corporate leaders slated to visit the White House on Wednesday as President Donald Trump highlights the US investments they’ve announced in the first 100 days of his second term in office. Donald Trump Photographer: Annabelle Gordon/AFP/Getty Images",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4979959741822687782",
        "title": "Stock Movers: Boeing, Eli Lilly, Peloton (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-28/stock-movers-boeing-eli-lilly-peloton-podcast",
        "site": "bloomberg.com",
        "time": 1745853328000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 3:50 Boeing Co/The Photographer: Andrew Harrer/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7757994956688669503",
        "title": "Eli Lilly seeks a review of EU rejection of Alzheimer’s therapy",
        "url": "https://seekingalpha.com/news/4435867-eli-lilly-seeks-review-eu-alzheimers-drug-denial",
        "site": "seekingalpha.com",
        "time": 1745605613000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8684682755698818916",
        "title": "Pharma tariffs could raise prescription drug costs by $51B - report | $JNJ $PFE $LLY $MRK",
        "url": "https://seekingalpha.com/news/4435680-pharma-tariffs-could-raise-prescription-drug-costs-51b",
        "site": "seekingalpha.com",
        "time": 1745590970000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7759835175543297021",
        "title": "Ozempic compounders suffer fresh setback as judge rejects injunction | $NVO $NONOF $LLY $HIMS",
        "url": "https://seekingalpha.com/news/4435538-ozempic-compounders-suffer-fresh-legal-setback",
        "site": "seekingalpha.com",
        "time": 1745581129000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "5776210521687496060",
        "title": "Merck trims 2025 earnings outlook amid tariff impact | $MRK $JNJ $BMY $LLY",
        "url": "https://seekingalpha.com/news/4434742-merck-stock-trades-flat-q1-results",
        "site": "seekingalpha.com",
        "time": 1745493281000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "5670077503524615690",
        "title": "Lilly targets telemedicine providers selling compounded weight loss med Zepbound | $NVO $LLY $HIMS",
        "url": "https://seekingalpha.com/news/4434079-eli-lilly-targets-telemedicine-providers-selling-compounded-weight-loss-med-zepbound",
        "site": "seekingalpha.com",
        "time": 1745421688000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8061728416908768574",
        "title": "Zealand Pharma Hires Lilly Executive as Biotech Ramps Up in Obesity",
        "url": "https://www.bloomberg.com/news/articles/2025-04-23/zealand-hires-lilly-executive-as-biotech-ramps-up-in-obesity",
        "site": "bloomberg.com",
        "time": 1745413200000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Zealand Pharma A/S hired a senior executive from Eli Lilly & Co. after an agreement with a major drugmaker helped bolster its ambitions in obesity. rf lab Cell research, Scientist pipetting samples into a multi well plate during an experiment in the lab with a screen image of cells in the background Photographer: Andrew Brookes/Image Source",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5129522314615649905",
        "title": "Eli Lilly Sues 4 GLP-1 Telehealth Startups, Escalating War on Knockoff Drugs",
        "url": "https://www.wired.com/story/glp-1-compounding-fda-lawsuits/",
        "site": "wired.com",
        "time": 1745398800000,
        "favicon_url": "https://static.tickertick.com/website_icons/wired.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Pharmaceutical giant Eli Lilly alleges the companies are selling off-brand versions of its best-selling diabetes and weight-loss drugs, Mounjaro and Zepbound.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2681440794022769216",
        "title": "Novo Nordisk slides after Eli Lilly's results for oral weight loss drug—orforglipron | $NVO $LLY",
        "url": "https://seekingalpha.com/news/4433071-novo-nordisk-slides-after-eli-lillys-results-for-oral-weight-loss-drugorforglipron",
        "site": "seekingalpha.com",
        "time": 1745314390000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "7647986962557400785",
        "title": "Novo Nordisk Drops on Weight-Loss Study by Rival Lilly (Video)",
        "url": "https://www.bloomberg.com/news/videos/2025-04-22/novo-nordisk-drops-on-weight-loss-study-by-rival-lilly-video",
        "site": "bloomberg.com",
        "time": 1745308110000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Novo Nordisk A/S Photographer: John McConnico/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1222766506191523838",
        "title": "Novo Nordisk Slides on Pressure From Lilly’s Pill Study",
        "url": "https://www.bloomberg.com/news/articles/2025-04-22/novo-nordisk-slides-on-pressure-from-lilly-s-pill-study",
        "site": "bloomberg.com",
        "time": 1745305675000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Novo Nordisk A/S slumped after a pill from rival Eli Lilly & Co. helped patients shed weight and control blood sugar about as well as its injected blockbuster Ozempic.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5339289469825830073",
        "title": "Bloomberg Businessweek Daily: Eli Lilly's New Pill (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-21/bloomberg-businessweek-daily-eli-lilly-s-new-pill-podcast",
        "site": "bloomberg.com",
        "time": 1745240389000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 7:16 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6499328060147063069",
        "title": "StockWatch: Investors Hungry for Lilly after Diabetes Pill Aces Phase III Trial",
        "url": "https://www.genengnews.com/topics/drug-discovery/stockwatch-investors-hungry-for-lilly-after-diabetes-pill-aces-phase-iii-trial/",
        "site": "genengnews.com",
        "time": 1745154741000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Lilly trumpeted positive topline results from ACHIEVE-1 (NCT05971940) showing orforglipron to have met the trial’s primary endpoint of superior A1C reduction vs. placebo at 40 weeks. Patients treated with the diabetes pill showed an average of 1.3% to 1.6% lower A1C compared with a baseline of 8.0%. The post StockWatch: Investors Hungry for Lilly after Diabetes Pill Aces Phase III Trial appeared first on GEN - Genetic Engineering and Biotechnology News. No sooner did Eli Lilly (NYSE: LLY)’s oral diabetes candidate orforglipron make history Thursday as the first oral small molecule glucagon-like peptide-1 (GLP-1) receptor agonist to ace a Phase III trial when investors roared their approval with a buying surge that sent the pharma giant’s stock soaring Thursday. Lilly trumpeted positive topline results from ACHIEVE-1 (NCT05971940), showing that orforglipron met the trial’s primary endpoint of superior A1C reduction vs. placebo at 40 weeks. Patients treated with the diabetes pill showed an average of 1.3% to 1.6% lower A1C compared with a baseline of 8.0%. But the pharma giant appeared to have especially wowed investors with results from two key secondary endpoints in ACHIEVE-1, which randomized 559 participants: More than 65% of participants treated with the trial’s highest dose of orforglipron (36 mg) showed A1C that was less than or equal to 6.5%—below the American Diabetes Association’s (ADA) minimum threshold for diabetes. Also, at that highest dose, orforglipron patients lost an average of 16 pounds, about 7.9% of their body weight. “The results are outstanding,” declared Akash Tewari, equity analyst with Jefferies, in a research note. Outstanding enough, he said, to raise his firm’s peak sales projection for orforglipron by 10%, from ~$39 billion to $43 billion, compared with a $31 billion consensus peak sales estimate cited by Tewari. He also raised Jefferies’ 12-month price target on Lilly shares about 4%, from $1,020 to $1,057. Investors shared Tewari’s enthusiasm for orforglipron, sending Lilly shares surging 14% Thursday, from $734.90 to $839.96 (U.S. markets were closed on Good Friday). Thursday’s jump almost surpassed Lilly’s biggest-ever one-day gain of 17.7% achieved on June 29, 2000. That day, Lilly reported positive clinical results for a sepsis shock treatment later approved as Xigris® (drotrecogin alfa [activated]) but voluntarily withdrawn from the market in 2011 after it failed the Phase III PROWESS-SHOCK trial (NCT00604214). “Preeminent player” Jared Holz, healthcare equity strategist with Mizuho Securities America, predicted in a research note reported by Bloomberg News that Lilly “will remain the preeminent player in this category for a while as its lead over peers, both in pharma and biotech, widens on the back of this data.” Those peers begin with the longtime market leader in sales of GLP-1 diabetes and obesity treatments Novo Nordisk (NASDAQ Copenhagen: NOVO-B and NYSE: NVO), whose blockbuster-level offerings in the category include semaglutide, marketed to treat type 2 diabetes as Ozempic® and marketed to treat obesity as Wegovy®. Novo’s U.S. American Depositary Receipts fell nearly 8% Thursday on Lilly’s good news, from $62.88 to $58.08, though the company’s main Copenhagen shares only dipped 1% from DKK 425.65 ($64.81) to DKK 421.25 ($64.14). BMO Capital Markets analyst Evan David Seigerman downgraded Novo Nordisk shares on Thursday from “Outperform” to “Market Perform,” and cut the firm’s 12-month price target on Novo Nordisk shares 39%, from $105 to $64. Seigerman reasoned that Lilly had made sizable advancements in its commercial and clinical portfolio, causing it to overtake Novo’s early lead. “Has the tortoise caught the hare?” Seigerman asked, not so rhetorically, as reported by Barron’s. “Lilly has made sizable advancements in its commercial and clinical portfolio, causing it to overtake Novo’s early lead.” Orforglipron is a once-daily small molecule (non-peptide) oral GLP-1 receptor agonist that can be taken any time of the day without restrictions on food and water intake. Orforglipron was discovered by Roche-owned Chugai Pharmaceutical, which called the drug OWL833, and was licensed in 2018 by Lilly, which agreed to pay Chugai $50 million upfront. Lilly also agreed to pay Chugai up to $390 million in potential payments tied to achieving milestones. “As of December 31, 2024, Chugai is eligible to receive up to $140.0 million contingent upon the achievement of success-based regulatory milestones and up to $250.0 million in a series of sales-based milestones, contingent upon the commercial success of orforglipron,” Lilly disclosed in its Form 10-K annual report for 2024, filed February 19. “During the years ended December 31, 2024, 2023, and 2022, milestone payments to Chugai were not material.” Some of those potential milestones relate to the development of orforglipron in another metabolic indication. Lilly is conducting Phase III trials of the drug for weight management in adults with obesity or overweight with at least one weight-related medical problem, for which data is expected to be released later this year. Orforglipron is also being studied as a potential treatment for obstructive sleep apnea and hypertension in adults with obesity. The trials are part of Lilly’s Phase III ACHIEVE clinical development program, which has enrolled more than 6,000 people with type 2 diabetes across five global registrational trials. The Phase III program began in 2023 and will be generating results through 2026. No liver-related safety issues A key reason why analysts and investors were so positive on orforglipron was that no liver-related safety issues emerged during ACHIEVE-1. “It looks quite viable,” Tewari enthused. Hepatoxicity was a key reason why a potential competitor of orforglipron, Pfizer (NYSE:PFE), halted development this past week of its oral GLP-1 receptor agonist danuglipron (PF-06882961), which was being studied for chronic weight management in two Phase III trials (NCT06567327 and NCT06568731). Pfizer disclosed that one patient in one of the dose-optimization studies “experienced potential drug-induced liver injury which resolved after discontinuation of danuglipron.” However, orforglipron was not without other safety issues, including: Diarrhea—19%, 21%, and 26% among patients dosed at 3 mg, 12 mg, and 36 mg, respectively, vs. 9% with placebo. Nausea—13%, 18%, and 16%, vs. 2% with placebo Dyspepsia—10%, 20%, and 15%, vs. 7% with placebo. Constipation—8%, 17%, and 14%, vs. 4% with placebo. Vomiting—5%, 7%, and 14%, vs. 1% with placebo. Overall treatment discontinuation rates due to adverse events were 6% (3 mg), 4% (12 mg), and 8% (36 mg) for orforglipron vs. 1% with placebo Lilly said it plans to present full results from ACHIEVE-1 at the American Diabetes Association (ADA) 85th Scientific Sessions, set for June 20-23 in Chicago, and publish the data in a peer-reviewed journal. “While we await more data to be presented at the ADA, we are comforted that no hepatic safety signal was observed, which validates pharmacophores similar to that of orforglipron,” Andy T. Hsieh, PhD, a partner and biotechnology analyst with William Blair, and a colleague, wrote in a research note. Among pharmacophores similar to orforglipron, Hsieh noted, are aleniglipron (GSBR-1290), an oral small molecule selective GLP-1 receptor agonist being developed to treat obesity by Structure Therapeutics (NASDAQ: GPCR) and AZD5004/ECC5004, a small molecule GLP-1 receptor agonist being developed for type-2 diabetes, obesity, and other comorbidities by AstraZeneca (London Stock Exchange: AZN) via exclusive license from privately-held Eccogene through an up-to-$2 billion-plus collaboration launched in 2023. Structure shares jumped 17% Thursday from $18.53 to $21.76, while AstraZeneca shares dipped 1% Thursday to 10,124 pence (£101.24 or $134.44). Data readouts, $60M milestone Structure is expected to report topline data from two fully-enrolled Phase II trials of aleniglipron totaling more than 300 patients, ACCESS (NCT06693843) and ACCESS II (NCT06703021) by the end of this year. Last October, AstraZeneca paid Eccogene a $60 million milestone payment after dosing the first patient in the Phase IIb program of AZD5004/ECC5004, consisting of two trials, VISTA (NCT06579092) and SOLSTICE (NCT06579105). Estimated primary completion dates are December 2025 for VISTA and January 2026 for SOLSTICE. GLP-1 treatment developers should fare better with investors, Hsieh observed, than developers of peptide-based incretin drugs for diabetes and obesity. Those include the Terns Pharmaceuticals (NASDAQ: TERN) oral small molecule GLP-1 receptor agonist TERN-601, originally modeled on Pfizer’s danuglipron. TERN-601 is Phase II ready after showing positive Phase I 28-day proof of concept data last September. Other peptide-based developers include: Altimmune (NASDAQ: ALT)—The company last year reported positive data from the Phase II MOMENTUM trial (NCT05295875) assessing pemvidutide in obesity, and later reached an agreement with the FDA on a Phase III obesity program consisting of four trials. Pemvidutide is a peptide-based GLP-1/glucagon dual receptor agonist in development for the treatment of obesity and metabolic dysfunction-associated steatohepatitis (MASH). Viking Therapeutics (NASDAQ: VKTX)—Last month the company completed subject enrollment in its Phase II trial (NCT06828055) of the oral tablet formulation of VK2735, the company’s dual agonist of the glucagon-like peptide 1 (GLP-1) and glucose-dependent insulinotropic polypeptide (GIP) receptors. Viking said it expects to report data from the study in the second half of this year. Zealand Pharma (NASDAQ Copenhagen: ZEAL.CO)—Zealand found a partner last month for its amylin analog petrelintide when Roche Group (SIX Swiss: RO and ROG; QTCQK: RHHBY) agr",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1556251502047380858",
        "title": "Notable healthcare headlines for the week: UnitedHealth, Eli Lilly, J&J in focus",
        "url": "https://seekingalpha.com/news/4432543-notable-healthcare-headlines-for-the-week-unitedhealth-eli-lilly-j-and-j-in-focus",
        "site": "seekingalpha.com",
        "time": 1745154349000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "3062694231807176112",
        "title": "Eli Lilly plans to make weight-loss pill in U.S. amid Trump’s reshoring push",
        "url": "https://seekingalpha.com/news/4432493-eli-lilly-plans-to-make-weight-loss-pill-in-us-amid-trumps-reshoring-push",
        "site": "seekingalpha.com",
        "time": 1744997888000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7588734135788871409",
        "title": "Lilly Promises to Make Weight-Loss Pill in US in Reshoring Push",
        "url": "https://www.bloomberg.com/news/articles/2025-04-18/lilly-promises-to-make-weight-loss-pill-in-us-in-reshoring-push",
        "site": "bloomberg.com",
        "time": 1744987225000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly & Co. plans to manufacture its new weight-loss pill in the US for patients around the world as President Donald Trump presses companies to move production back to American shores. Eli Lilly and Co. branding.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2940587174920722926",
        "title": "Stock Movers: UnitedHealth, Eli Lilly, Netflix (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-17/stock-movers-unitedhealth-eli-lilly-netflix-podcast",
        "site": "bloomberg.com",
        "time": 1744926583000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 5:08 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4431985334475080783",
        "title": "What to Know About Eli Lilly’s Daily Pill for Weight Loss",
        "url": "https://www.nytimes.com/2025/04/17/health/weight-loss-pill-eli-lilly.html",
        "site": "nytimes.com",
        "time": 1744925091000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly reported promising results from a study of its experimental oral drug that could rival popular injections to treat obesity and diabetes. Eli Lilly, the pill’s manufacturer, is not expected to announce a price tag for the drug until after it wins approval, as is typical for drugmakers.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6240395960508776213",
        "title": "SA Asks: What's the best weight-loss drug stock right now? | $NVO $LLY $AMGN $RHHBY $PFE",
        "url": "https://seekingalpha.com/news/4432350-sa-asks-whats-the-best-weight-loss-drug-stock-right-now",
        "site": "seekingalpha.com",
        "time": 1744920660000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "7004460813148816303",
        "title": "Stock Movers: UnitedHealth Group, Eli Lily, FIS (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-17/stock-movers-unitedhealth-group-eli-lily-fis-podcast",
        "site": "bloomberg.com",
        "time": 1744918840000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 4:01 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "9019589183069625062",
        "title": "Why did Lilly data for oral obesity drug boost Structure and Metsera?",
        "url": "https://seekingalpha.com/news/4432338-lilly-stock-gains-rally-structure-metsera",
        "site": "seekingalpha.com",
        "time": 1744914265000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5695531164638904495",
        "title": "Weight loss in a pill? Eli Lilly just took a big step closer to making it happen",
        "url": "https://www.businessinsider.com/eli-lilly-weight-loss-pill-orforglipron-trial-results-2025-4",
        "site": "businessinsider.com",
        "time": 1744904040000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Drug manufacturers are racing to be the first to develop a GLP-1 pill for weight loss. Eli Lilly just announced promising new results for its product.Peter Meade/Getty ImagesDrugmaker Eli Lilly announced promising Phase 3 study results for its new GLP-1 pill.Orforglipron is a drug similar to Ozempic but without the injection, making it more accessible.The pill, poised to revolutionize the weight loss world, may be up for FDA approval in late 2025.A daily pill to rival Ozempic is one step closer to hitting the market.Pharmaceutical giant Eli Lilly saw its stock jump Thursday morning after announcing initial Phase 3 trial results on orforglipron, a highly anticipated medication for diabetes and weight loss.The drug is in the same class of GLP-1 medications as Ozempic, Wegovy, Mounjaro, and Zepbound — weekly injections that upended the weight-loss industry — but in pill form.Lilly's head of diabetes and obesity Patrik Jonsson recently told Business Insider that orforglipron will likely unlock a much wider market, bringing the benefits of groundbreaking weight-loss drugs to people who can't, or don't want to, use injections.\"Most importantly, when you look at the global need, we expect that there are more than one billion people across the globe that are suffering from obesity,\" Jonsson said. \"There is no way that we can meet those demands with injectable treatments today.\"The race to make the perfect weight-loss pillLilly is racing to bring the first pill version of a GLP-1 for weight loss to market against competitors like Novo Nordisk and Pfizer, whose prospects have not lived up to expectations.Novo Nordisk's Rybelsus, a daily pill with the same properties as Ozempic, was FDA-approved for diabetes in 2019.However, its weight loss results didn't stack up to other GLP-1 drugs in studies, and it's not straightforward to take; users need to fast before and for 30 minutes after taking the pill.Pfizer's daily pill, danuglipron, was scrapped after one study participant developed liver problems and recovered after they stopped taking the drug.What we know about Eli Lilly's orforglipronIf all goes well for Lilly, orforglipron could be up for FDA approval for weight management by the end of 2025, and for type 2 diabetes treatment in 2026.In the topline results released today, adults with diabetes who took orforglipron for 40 weeks had significantly better blood sugar control than those who took a placebo, according to a press release from Lilly.They also lost up to 16 pounds (about 7.6% of their body weight) on average while taking the highest dose, and hadn't plateaued by the end of the study, suggesting even more weight loss could be possible.The study — one of seven trials planned — found orforglipron is just as safe as other GLP-1 drugs, with the similar side effects like diarrhea and nausea.The company intends to release more data later this year, Lilly's CEO David A. Ricks said in the press release.The big question is: will it be cheaper than Ozempic, Wegovy, Mounjaro, or Zepbound?While Eli Lilly has been tight-lipped about list price, analysts say there's a good chance orforglipron could cost less than the $900 monthly list price of current drugs, since a pill is easier to produce and distribute.Read the original article on Business Insider Drug manufacturers are racing to be the first to develop a GLP-1 pill for weight loss. Eli Lilly just announced promising new results for its product.Peter Meade/Getty ImagesDrugmaker Eli Lilly announced promising Phase 3 study results for its new GLP-1 pill.Orforglipron is a drug similar to Ozempic but without the injection, making it more accessible.The pill, poised to revolutionize the weight loss world, may be up for FDA approval in late 2025.A daily pill to rival Ozempic is one step closer to hitting the market.Pharmaceutical giant Eli Lilly saw its stock jump Thursday morning after announcing initial Phase 3 trial results on orforglipron, a highly anticipated medication for diabetes and weight loss.The drug is in the same class of GLP-1 medications as Ozempic, Wegovy, Mounjaro, and Zepbound — weekly injections that upended the weight-loss industry — but in pill form.Lilly's head of diabetes and obesity Patrik Jonsson recently told Business Insider that orforglipron will likely unlock a much wider market, bringing the benefits of groundbreaking weight-loss drugs to people who can't, or don't want to, use injections.\"Most importantly, when you look at the global need, we expect that there are more than one billion people across the globe that are suffering from obesity,\" Jonsson said. \"There is no way that we can meet those demands with injectable treatments today.\"The race to make the perfect weight-loss pillLilly is racing to bring the first pill version of a GLP-1 for weight loss to market against competitors like Novo Nordisk and Pfizer, whose prospects have not lived up to expectations.Novo Nordisk's Rybelsus, a daily pill with the same properties as Ozempic, was FDA-approved for diabetes in 2019.However, its weight loss results didn't stack up to other GLP-1 drugs in studies, and it's not straightforward to take; users need to fast before and for 30 minutes after taking the pill.Pfizer's daily pill, danuglipron, was scrapped after one study participant developed liver problems and recovered after they stopped taking the drug.What we know about Eli Lilly's orforglipronIf all goes well for Lilly, orforglipron could be up for FDA approval for weight management by the end of 2025, and for type 2 diabetes treatment in 2026.In the topline results released today, adults with diabetes who took orforglipron for 40 weeks had significantly better blood sugar control than those who took a placebo, according to a press release from Lilly.They also lost up to 16 pounds (about 7.6% of their body weight) on average while taking the highest dose, and hadn't plateaued by the end of the study, suggesting even more weight loss could be possible.The study — one of seven trials planned — found orforglipron is just as safe as other GLP-1 drugs, with the similar side effects like diarrhea and nausea.The company intends to release more data later this year, Lilly's CEO David A. Ricks said in the press release.The big question is: will it be cheaper than Ozempic, Wegovy, Mounjaro, or Zepbound?While Eli Lilly has been tight-lipped about list price, analysts say there's a good chance orforglipron could cost less than the $900 monthly list price of current drugs, since a pill is easier to produce and distribute.Read the original article on Business Insider",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4196957720309192250",
        "title": "Eli Lilly shares surge on new obesity pill data. What it means for the stock from here",
        "url": "https://www.cnbc.com/2025/04/17/eli-lilly-shares-surge-on-new-obesity-pill-data-what-it-means-for-the-stock-from-here.html",
        "site": "cnbc.com",
        "time": 1744903775000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Jim Cramer said Eli Lilly's new trial data has turned the obesity market into a 'one-horse race.'",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1913663185757473432",
        "title": "Eli Lilly Shares Up 13% After Weight Loss Pill Appears As Effective As Ozempic And Mounjaro In Trials",
        "url": "https://www.forbes.com/sites/gennacontino/2025/04/17/eli-lilly-shares-up-13-after-weight-loss-pill-appears-as-effective-as-ozempic-and-mounjaro-in-trials/",
        "site": "forbes.com",
        "time": 1744902882000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Trial participants on the highest dosage lost an average of 16 pounds during the 40-week trial. Trial participants on the highest dosage lost an average of 16 pounds during the 40-week trial.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "9218987856607289604",
        "title": "Stock Movers: UnitedHealth, Eli Lilly, TSMC (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-17/stock-movers-unitedhealth-eli-lilly-tsmc-podcast",
        "site": "bloomberg.com",
        "time": 1744900013000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 3:33 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "7594140516679279022",
        "title": "Eli Lilly's weigh-loss pill works just as well as Ozempic — and investors are loving it",
        "url": "https://www.businessinsider.com/eli-lilly-stock-price-soars-weight-loss-pill-rivals-ozempic-2025-4",
        "site": "businessinsider.com",
        "time": 1744897893000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The positive data gives Eli Lilly the green light to file the drug with the FDA by the end of the year for a weight loss indication. ReutersEli Lilly stock surged as much as 15% after positive phase-three trial data for Orforglipron.The GLP-1 weight loss pill showed significant weight reductions.The pill form could expand access and reduce costs compared to injectable GLP-1 drugs.The move: Eli Lilly stock soared as much as 15% on Thursday to $843.19.Why: The gains came after Eli Lilly announced positive phase 3 trial data for Orforglipron, the pill form of its GLP-1 weight loss drug.The data showed that the once-daily pill reduced patients' weight by an average of 16 pounds, or about 8% of their body weight, and lowered their A1C by an average of 1.3% to 1.6%.The pill form is in line with injectable GLP-1 drugs, like Novo Nordisk's Ozempic.The positive data gives the company the green light to file the drug with the FDA for approval. The company expects those regulatory filings to happen by the end of the year for obesity, and in 2026 for diabetes.What it means: Current GLP-1 weight loss drugs, including Eli Lilly's Zepbound and Novo Nordisk's Wegovy, are administered via a once-per-week injection.A pill form of the drug could greatly expand access to patients who are afraid of needles. It could also significantly lower the cost of the drug compared to the injectables, as advanced manufacturing processes are required to produce the injectable GLP-1 drugs in their current form.JPMorgan said the data for Orforglipron is exceptional, noting that side effects appear minimal given just an 8% discontinuation rate on the highest dose, and that Eli Lilly did not make any reference to incremental safety concerns in its announcement.\"We continue to see oral GLP-1s as the biggest factor in alleviating global capacity constraints & increasing accessibility of GLP-1's, particularly in international markets,\" analysts at JPMorgan said.They continued: \"With a full-scale launch anticipated, we anticipate a steep ramp in sales for the asset and continue to see upside to both near- and long-term LLY sales estimates.\"Read the original article on Business Insider",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1506804648843657966",
        "title": "Stock Movers: UnitedHealth Group Falls, Hertz Sees Big Gain, Eli Lilly & Taiwan Semiconductor Rise",
        "url": "https://www.bloomberg.com/news/videos/2025-04-17/unitedhealth-group-falls-hertz-eli-lilly-rise-video",
        "site": "bloomberg.com",
        "time": 1744897630000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "UnitedHealth Group (UNH) cut its annual forecast and reported its first earnings miss in over a decade, causing shares of major health insurers to plummet. Hertz (HTZ) soared as much as 40% in premarket trading on Thursday, set to extend Wednesday’s record 56% rally, after CNBC reported that Bill Ackman’s Pershing Square holds about a 19.8% stake in the beleaguered rental-car company. Eli Lilly (LLY) shares rose on news that the company's experimental weight-loss pill, orforglipron, worked as well as the Ozempic shot in a trial, bringing it closer to developing a needle-free alternative. Taiwan Semiconductor (TSMC) climbed after the chipmaker forecast sales for the second quarter that beat the average analyst estimate. The company kept its growth outlook for 2025 on expectations of AI revenue doubling. (Source: Bloomberg)",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "3542868149105269715",
        "title": "Buy, Sell, Or Hold Eli Lilly Stock At $820?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/17/buy-sell-or-hold-eli-lilly-stock-at-820/",
        "site": "forbes.com",
        "time": 1744896089000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The trial met its primary objectives, showing the pill’s effectiveness in helping patients with Type 2 diabetes achieve improved blood sugar control and weight loss. The trial met its primary objectives, showing the pill’s effectiveness in helping patients with Type 2 diabetes achieve improved blood sugar control and weight loss.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4217057346675652921",
        "title": "Stock Movers: United Health, Eli Lilly, TSMC (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-17/stock-movers-united-health-eli-lilly-tsmc-podcast",
        "site": "bloomberg.com",
        "time": 1744895963000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 4:23 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1230573545659736486",
        "title": "Lilly’s stock soars in premarket on successful result in weight-loss-pill trial",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=c741e308-8cd6-4cb9-81f0-b95ee5bc95b3&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1744890837000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-628706705911075751",
        "title": "Eli Lilly’s stock soars as successful trial of weight-loss pill is a game changer",
        "url": "https://www.marketwatch.com/story/eli-lillys-stock-soars-13-after-reporting-positive-data-from-trial-of-diabetes-and-weight-loss-pill-07077417?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1744890480000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "lly"
        ],
        "description": "If approved, the pill is expected to be far easier to administer than current injectables—and far easier to manufacture",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5586829379696714239",
        "title": "Eli Lilly’s new obesity pill lowers blood sugar and aids weight loss",
        "url": "https://www.ft.com/content/1de938b9-2cb5-4fa2-8612-5f930a65f7a2",
        "site": "ft.com",
        "time": 1744889235000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Promising late-stage trial results send shares up in pre-market trading",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4707840908260259298",
        "title": "Stock Movers: United Health, Eli Lilly, Hertz (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-17/stock-movers-united-health-eli-lilly-hertz-podcast",
        "site": "bloomberg.com",
        "time": 1744889009000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Source: Bloomberg, 4:12 Eli Lilly & Co Photographer: JB Reed/Bloomberg News",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "3752495911053217773",
        "title": "Lilly Soars After Weight-Loss Pill Works as Well as Ozempic Shot",
        "url": "https://www.bloomberg.com/news/articles/2025-04-17/lilly-soars-after-pill-shows-its-as-good-as-ozempic",
        "site": "bloomberg.com",
        "time": 1744888842000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly & Co. shares surged following data showing its experimental pill helped diabetic patients lose similar amounts of weight to injectable GLP-1 medications, bringing it one step closer to becoming a needle-free alternative to weight-loss shots. Inside the new production lab in the Eli Lilly & Co. manufacturing plant in Kinsale, Ireland. Photographer: Paulo Nunes dos Santos/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6759624259852550753",
        "title": "Eli Lilly’s stock soars 13% after reporting positive data from trial of diabetes and weight-loss pill",
        "url": "https://www.marketwatch.com/story/eli-lillys-stock-soars-13-after-reporting-positive-data-from-trial-of-diabetes-and-weight-loss-pill-07077417?mod=mw_rss_marketpulse",
        "site": "marketwatch.com",
        "time": 1744888500000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "5718872217026888745",
        "title": "Eli Lilly jumps as oral GLP-1 drug succeeds in Phase 3 trial | $AMGN $NVO $LLY $VKTX $GPCR",
        "url": "https://seekingalpha.com/news/4432041-eli-lilly-stock-jumps-phase-3-win-oral-glp-1",
        "site": "seekingalpha.com",
        "time": 1744887886000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "162889300634540884",
        "title": "Daily Pill May Work as Well as Ozempic for Weight Loss and Blood Sugar",
        "url": "https://www.nytimes.com/2025/04/17/health/pill-glp-1-eli-lilly.html",
        "site": "nytimes.com",
        "time": 1744886704000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Clinical results of a GLP-1 in pill form showed safety and efficacy data similar to blockbuster injectable drugs. Insulin pen production at an Eli Lilly factory in France. The new drug — a pill that can be taken at any time of day, with or without food — is almost unheard-of in the world of peptide drugs.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2282462333392372733",
        "title": "Eli Lilly's weight loss pill succeeds in first late-stage trial on diabetes patients",
        "url": "https://www.cnbc.com/2025/04/17/eli-lilly-weight-loss-pill-orforglipron-clears-first-late-stage-trial.html",
        "site": "cnbc.com",
        "time": 1744886701000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "7733530520975426389",
            "-2681440794022769216",
            "-7204828697771038463",
            "3062694231807176112",
            "2923454298169545126",
            "-7588734135788871409",
            "-4431985334475080783",
            "-8586160641803953171",
            "-5695531164638904495",
            "-4196957720309192250",
            "9069466558503198181",
            "-1913663185757473432",
            "7594140516679279022",
            "463918049421966078",
            "-1230573545659736486",
            "-628706705911075751",
            "-5586829379696714239",
            "3752495911053217773",
            "-6759624259852550753",
            "162889300634540884"
        ],
        "description": "The results bring Eli Lilly's pill orforglipron one step closer to becoming a new, needle-free alternative in the booming weight loss and diabetes market.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8501091565117755107",
        "title": "Healthy Returns: What drugmakers are saying about Trump’s looming pharmaceutical tariffs",
        "url": "https://www.cnbc.com/2025/04/16/healthy-returns-drugmakers-comment-on-trumps-pharmaceutical-tariffs.html",
        "site": "cnbc.com",
        "time": 1744822263000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "What Johnson & Johnson and Eli Lilly are saying about Trump’s pharmaceutical tariffs, and Dexcom scores FDA approval for its glucose monitoring system.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7192013494369029804",
        "title": "Trump targets Medicare price negotiations in new executive order | $JNJ $BMY $PFE $LLY $AMGN",
        "url": "https://seekingalpha.com/news/4431483-trump-orders-changes-medicare-price-negotiations",
        "site": "seekingalpha.com",
        "time": 1744762995000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8135238455400117523",
        "title": "Irish Pharma Exports to US Surge Amid Tariff Threat",
        "url": "https://www.bloomberg.com/news/articles/2025-04-15/irish-pharma-exports-to-us-surge-amid-tariff-threat",
        "site": "bloomberg.com",
        "time": 1744725115000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The value of Ireland’s exports to the US jumped by more than 200% in February from a year earlier, driven by medical and pharmaceutical products, according to the country’s statistics office. The Eli Lilly & Co. manufacturing plant in Kinsale, Ireland.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-3857565779618367666",
        "title": "Wegovy, Zepbound makers’ stocks rally as a weight-loss-drug competitor drops out",
        "url": "https://www.marketwatch.com/story/wegovy-zepbound-makers-stocks-rally-as-a-weight-loss-drug-competitor-drops-out-52b114fb?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1744633860000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "4647285831546765501"
        ],
        "description": "Pfizer’s announcement that it will stop developing its oral weight-loss drug gave shares of Wegovy maker Novo Nordisk and Zepbound maker Eli Lilly a lift.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8845083899601245897",
        "title": "Verve jumps after early-stage trial data for gene editing therapy | $VERV $LLY",
        "url": "https://seekingalpha.com/news/4430800-verve-stock-jumps-early-stage-trial-data",
        "site": "seekingalpha.com",
        "time": 1744633758000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7613415686483827233",
        "title": "Pfizer Abandons Obesity Pill After Liver Injury in Major Setback",
        "url": "https://www.bloomberg.com/news/articles/2025-04-14/pfizer-pfe-abandons-obesity-pill-after-liver-injury-in-major-setback",
        "site": "bloomberg.com",
        "time": 1744627500000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Pfizer Inc. will stop developing an obesity pill that has been closely watched by investors, a severe blow in its efforts to compete with blockbuster weight-loss shots from Novo Nordisk A/S and Eli Lilly & Co. Albert Bourla Photographer: Stefan Wermuth/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5504571313959305903",
        "title": "Notable healthcare headlines of the week: Norvatis, Novo Nordisk, Eli Lilly in focus",
        "url": "https://seekingalpha.com/news/4430568-notable-healthcare-headlines-of-the-week-norvatis-novo-nordisk-eli-lilly-in-focus",
        "site": "seekingalpha.com",
        "time": 1744549505000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1672025687367225460",
        "title": "Notable analyst calls this week: Apple, Eli Lilly and Verizon stocks among top picks | $NFLX $AAPL $F $GM $VZ",
        "url": "https://seekingalpha.com/news/4430528-notable-analyst-calls-this-week-apple-eli-lilly-and-verizon-stocks-among-top-picks",
        "site": "seekingalpha.com",
        "time": 1744464921000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4628509647987915207",
        "title": "Lilly’s Zepbound Keeps Weight Off for Three Years, Study Finds",
        "url": "https://www.bloomberg.com/news/articles/2025-04-11/lilly-s-zepbound-keeps-weight-off-for-three-years-study-finds",
        "site": "bloomberg.com",
        "time": 1744408860000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "7647986962557400785",
            "-1222766506191523838"
        ],
        "description": "Patients regularly taking Eli Lilly & Co.’s obesity shot Zepbound tend to keep the weight off for at least three years, with most regaining 5% or less of the pounds they shed.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1248097759100258073",
        "title": "Eli Lilly's cease-and-desist letter means “nothing”, says GLP-1 compounder | $LLY $NVO $NONOF $HIMS",
        "url": "https://seekingalpha.com/news/4430423-glp-1-compounder-rebuffs-lillys-cease-desist-letter",
        "site": "seekingalpha.com",
        "time": 1744375003000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4177375178286916444",
        "title": "Eli Lilly to recognize $1.57B in Q1 as acquired R&D charges | $LLY",
        "url": "https://seekingalpha.com/news/4430399-eli-lilly-sets-157b-q1-acquired-rd-charges",
        "site": "seekingalpha.com",
        "time": 1744371870000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4344014169713947511",
        "title": "Stock Movers: Eli Lilly, Walmart, Ford (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-09/stock-movers-eli-lilly-walmart-ford-podcast",
        "site": "bloomberg.com",
        "time": 1744212915000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-6212655364388241524",
            "8264791975714901147",
            "2251731687492052661",
            "9119293077313284379",
            "4979959741822687782",
            "-2940587174920722926",
            "7004460813148816303",
            "-889303438520505803",
            "9218987856607289604",
            "-1506804648843657966",
            "-4217057346675652921",
            "4707840908260259298",
            "-4396912363712044307"
        ],
        "description": "Source: Bloomberg, 3:13 Wal-Mart Stores Inc Photographer: Patrick T. Fallon/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2316381185600152594",
        "title": "Viking Therapeutics draws Neutral rating at Goldman Sachs on competitive headwinds | $VKTX $NVO $LLY",
        "url": "https://seekingalpha.com/news/4429479-viking-therapeutics-stock-rated-neutral-goldman",
        "site": "seekingalpha.com",
        "time": 1744125968000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "3001718925782867522",
        "title": "Eli Lilly looks to end selloff as Goldman upgrades on attractive entry point | $LLY $NVO",
        "url": "https://seekingalpha.com/news/4429406-eli-lilly-stock-upgraded-goldman-sachs",
        "site": "seekingalpha.com",
        "time": 1744115102000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-801660407383487896",
        "title": "Here's when we'll consider adding to our positions in Goldman Sachs and Eli Lilly",
        "url": "https://www.cnbc.com/2025/04/07/when-well-consider-adding-to-positions-in-goldman-sachs-and-eli-lilly.html",
        "site": "cnbc.com",
        "time": 1744044724000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1791071473135795422",
        "title": "Lilly Falls After Trump Drops Medicare Obesity Proposal",
        "url": "https://www.bloomberg.com/news/articles/2025-04-07/lilly-falls-after-trump-drops-medicare-obesity-proposal",
        "site": "bloomberg.com",
        "time": 1744038300000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly & Co.’s shares fell Monday morning after the Trump administration spiked a plan late last week to pay for obesity drugs for Medicare patients. The Eli Lilly headquarters in Indianapolis, Indiana, US, on Thursday, Aug. 15, 2024. This fall, the company will begin recruiting for trials to test its popular weight-loss shot Zepbound with psoriasis drug Taltz to see if the combination boosts effectiveness, Chief Scientific Officer Daniel Skovronsky said. Photographer: AJ Mast/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5800324950719778612",
        "title": "These Stocks Are Moving the Most Today: Apple, Tesla, JPMorgan, Nvidia, MicroStrategy, Alibaba, Lilly, and More",
        "url": "https://www.barrons.com/articles/stock-market-movers-74d6dd68?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1744018260000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6076246437743152801",
        "title": "Notable healthcare headlines of the week: Becton, Dickinson, Grifols, Eli Lilly and J&J in focus",
        "url": "https://seekingalpha.com/news/4428937-notable-healthcare-headlines-of-the-week-becton-dickinson-grifols-eli-lilly-and-j-and-j-in",
        "site": "seekingalpha.com",
        "time": 1743944729000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-1556251502047380858",
            "-5504571313959305903"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-9084951706241755704",
        "title": "Trump tariffs live updates: Eli Lilly CEO says tariffs endanger R&D; automakers seek 'opportunity in the chaos'",
        "url": "https://www.cnbc.com/2025/04/05/trump-tariffs-live-updates-global-trade-reacts.html",
        "site": "cnbc.com",
        "time": 1743861318000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "This is CNBC's coverage of how U.S. trade partners, industries and employers respond to President Donald Trump's historic tariffs.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8864768939966865428",
        "title": "Trump Drops Biden’s Medicare Obesity Drug Coverage Proposal",
        "url": "https://www.bloomberg.com/news/articles/2025-04-04/trump-drops-biden-s-medicare-obesity-drug-coverage-proposal",
        "site": "bloomberg.com",
        "time": 1743798241000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "1791071473135795422"
        ],
        "description": "The Trump administration didn’t move forward with a highly anticipated decision on whether costly obesity drugs would be covered by Medicare in its annual regulatory update Friday. An Eli Lilly & Co. Zepbound injection pen arranged in the Brooklyn borough of New York, US, on Thursday, March 28, 2024. Patients, doctors and pharmacists across the US are struggling to get their hands on Eli Lilly & Co.'s powerful new obesity drug Zepbound, as demand for the weight-loss shot soars. Photographer: Shelby Knowles/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-7699367226085272447",
        "title": "Eli Lilly boss: 'Tariffs are pivotal moment and hard to come back from'",
        "url": "https://www.bbc.com/news/articles/c0qndqz41jxo",
        "site": "bbc.com",
        "time": 1743723438000,
        "favicon_url": "https://static.tickertick.com/website_icons/bbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The Chief Executive of Eli Lilly has told the BBC that he is doubtful tariffs could bring manufacturing jobs to the US whilst raising billions in tax revenue",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6412910060523004528",
        "title": "Eli Lilly to leverage Sangamo capsid technology for CNS disease therapies",
        "url": "https://seekingalpha.com/news/4428619-eli-lilly-leverage-sangamo-capsid-technology-cns-disease-therapies",
        "site": "seekingalpha.com",
        "time": 1743715284000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "2887082792174127298",
        "title": "Eli Lilly weight loss therapy added to Hims & Hers platform | $LLY $HIMS $NVO",
        "url": "https://seekingalpha.com/news/4427659-eli-lilly-obesity-drug-hims-hers-platform",
        "site": "seekingalpha.com",
        "time": 1743529507000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1815761423289882840",
        "title": "Hims to Sell Lilly’s Zepbound Through Its Telehealth Platform",
        "url": "https://www.bloomberg.com/news/articles/2025-04-01/hims-to-sell-lilly-s-zepbound-through-its-telehealth-platform",
        "site": "bloomberg.com",
        "time": 1743529081000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Hims & Hers Health Inc.’s shares jumped Tuesday after it said it was broadening its weight-loss offerings, adding access to brand name shots like Zepbound after previously focusing on cheaper versions made by compounding pharmacies. An Eli Lilly & Co. Zepbound injection pen arranged in the Brooklyn borough of New York, US, on Thursday, March 28, 2024. Patients, doctors and pharmacists across the US are struggling to get their hands on Eli Lilly & Co.'s powerful new obesity drug Zepbound, as demand for the weight-loss shot soars. Photographer: Shelby Knowles/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "5493959924556504479",
        "title": "Eli Lilly sues two pharmacies making copycat Zepbound, Mounjaro",
        "url": "https://www.cnbc.com/2025/04/01/eli-lilly-sues-strive-and-empower-over-compounded-tirzepatide.html",
        "site": "cnbc.com",
        "time": 1743511087000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly is suing Strive Pharmacy and Empower Pharmacy for compounding tirzepatide, the active ingredient in Zepbound and Mounjaro.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1402231775207163700",
        "title": "Trump’s Pharma Threats Take Tariffs Into Uncharted Territory",
        "url": "https://www.bloomberg.com/news/articles/2025-04-01/trump-tariffs-pharmaceutical-industry-levies-threaten-major-disruption",
        "site": "bloomberg.com",
        "time": 1743505921000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "For more than three decades, the pharmaceutical sector has been protected from tariffs by a World Trade Organization agreement designed to improve access to life-saving drugs. Inside an Eli Lilly manufacturing plant in Limerick, Ireland.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8245062919953157225",
        "title": "Eli Lilly takes actions to stop compounders from making its weight loss med",
        "url": "https://seekingalpha.com/news/4427205-eli-lilly-takes-actions-stop-compounders-from-making-its-weight-loss-med",
        "site": "seekingalpha.com",
        "time": 1743498308000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1281085792053240299",
        "title": "Eli Lilly’s lepodisiran slashes inherited heart disease risk factor by 94% in Phase 2 trial",
        "url": "https://seekingalpha.com/news/4426752-eli-lilly-lepodisiran-slashes-inherited-heart-disease-risk-factor-by-94-in-phase-2-trial",
        "site": "seekingalpha.com",
        "time": 1743404649000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8295964827905119407",
        "title": "The CoreWeave IPO is key to 2 portfolio stocks — plus, Lilly bucks a down market",
        "url": "https://www.cnbc.com/2025/03/28/coreweave-ipo-is-key-to-nvidia-goldman-plus-lilly-bucks-a-down-market.html",
        "site": "cnbc.com",
        "time": 1743176717000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4619519742335295113",
        "title": "EU regulator declines approval for Eli Lilly’s new Alzheimer’s drug",
        "url": "https://www.ft.com/content/cd789ebb-a638-470e-95b2-c7b0feadbc43",
        "site": "ft.com",
        "time": 1743165442000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "lly"
        ],
        "description": "European Medicines Agency says risks of potentially fatal side effects from donanemab outweigh benefits",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-95704686499965469",
        "title": "Eli Lilly fails to win EU backing for Alzheimer’s therapy | $LLY $BIIB $ESALF $ESAIY",
        "url": "https://seekingalpha.com/news/4426313-eli-lilly-alzheimers-drug-fails-win-eu-nod",
        "site": "seekingalpha.com",
        "time": 1743162489000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-9163070027146796012",
        "title": "Eli Lilly Alzheimer’s Drug Kisunla Fails to Get EU Backing",
        "url": "https://www.bloomberg.com/news/articles/2025-03-28/eli-lilly-s-kisunla-fails-to-get-eu-backing-in-alzheimer-s",
        "site": "bloomberg.com",
        "time": 1743160449000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "1803242026097629496",
            "7447566578358869197",
            "4619519742335295113",
            "-95704686499965469"
        ],
        "description": "Eli Lilly & Co.’s Alzheimer’s disease drug Kisunla failed to get the backing of European regulators, who said its benefits don’t outweigh the risk of potentially fatal bleeding in the brain. Eli Lilly’s Kisunla drug. Source: Eli Lilly",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8137843843205401527",
        "title": "Eli Lilly expands LillyDirect to include Alzheimer's resources",
        "url": "https://seekingalpha.com/news/4425738-eli-lilly-expands-lillydirect-include-alzheimers-resources",
        "site": "seekingalpha.com",
        "time": 1743087999000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4516834980497194663",
        "title": "Organovo gets upfront payments following sale of its FXR Program to Lilly",
        "url": "https://seekingalpha.com/news/4425695-organovo-gets-upfront-payments-following-sale-of-its-fxr-program-to-lilly",
        "site": "seekingalpha.com",
        "time": 1743081916000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "418551185314654358",
        "title": "Lilly Expands Digital Health Site to Include Alzheimer’s Disease",
        "url": "https://www.bloomberg.com/news/articles/2025-03-27/lilly-expands-digital-health-site-to-include-alzheimer-s-disease",
        "site": "bloomberg.com",
        "time": 1743080400000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly & Co. is adding Alzheimer’s disease resources to the online platform it launched a year ago to sell obesity, diabetes and migraine medicines.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8047898251728701731",
        "title": "Marty Makary and Jay Bhattacharya clear Senate hurdles to lead FDA and NIH | $PFE $NVO $LLY $MRK $AMGN",
        "url": "https://seekingalpha.com/news/4425200-marty-makary-and-jay-bhattacharya-clear-senate-hurdles-to-lead-fda-and-nih",
        "site": "seekingalpha.com",
        "time": 1742986577000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6008674504631571023",
        "title": "Healthy Returns: Novo Nordisk scoops up Chinese obesity drug to compete with Eli Lilly",
        "url": "https://www.cnbc.com/2025/03/25/healthy-returns-novo-nordisk-buys-united-laboratories-obesity-drug.html",
        "site": "cnbc.com",
        "time": 1742921981000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Novo Nordisk is taking aim at Eli Lilly with a new obesity drug deal. Meanwhile, a survey shows doctors' perception of the health care system is improving.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4331684571179911700",
        "title": "The market comeback continues — plus, a key catalyst is on the horizon for Eli Lilly",
        "url": "https://www.cnbc.com/2025/03/24/the-market-comeback-continues-plus-a-key-catalyst-is-on-the-horizon-for-eli-lilly.html",
        "site": "cnbc.com",
        "time": 1742841571000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-6697975231069920571",
        "title": "Eli Lilly will soon release key data on its weight loss pill. Here's why it could be a game-changer",
        "url": "https://www.cnbc.com/2025/03/24/eli-lilly-to-release-weight-loss-pill-orforglipron-trial-data-.html",
        "site": "cnbc.com",
        "time": 1742837396000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "The trial results are critical, as it brings Eli Lilly's pill one step closer to becoming a new, needle-free alternative for weight loss and diabetes.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-3503461600950014438",
        "title": "Zepbound copycats remain online despite FDA ban",
        "url": "https://www.cnbc.com/2025/03/21/zepbound-copycats-tirzepatide-compounding-online-fda-ban.html",
        "site": "cnbc.com",
        "time": 1742574423000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Copycat versions of Eli Lilly's diabetes drug Mounjaro and obesity drug Zepbound were supposed to go away this week. They're still available on some websites.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1348312514015131573",
        "title": "Eli Lilly launches weight loss drug in India beating Novo Nordisk | $NVO $LLY $NONOF",
        "url": "https://seekingalpha.com/news/4422730-eli-lilly-launches-weight-loss-drug-india",
        "site": "seekingalpha.com",
        "time": 1742473214000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5398622708192490601",
        "title": "Eli Lilly First to Launch Weight Loss Drug in Obesity-Hit India",
        "url": "https://www.bloomberg.com/news/articles/2025-03-20/india-gets-first-weight-loss-drug-as-eli-lilly-launches-mounjaro",
        "site": "bloomberg.com",
        "time": 1742457990000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Eli Lilly and Co. has begun selling its blockbuster weight-loss and diabetes drug Mounjaro in India, pipping rivals in a country that has the world’s third-largest number of obese people. Eli Lilly's Mounjaro medication.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-4962446664816874067",
        "title": "Hutchmed spikes after cancer trial win despite 2024 revenue miss | $HCM $IVBIY $IVBXF $HMDCF $LLY",
        "url": "https://seekingalpha.com/news/4422329-hutchmed-spikes-cancer-trial-win",
        "site": "seekingalpha.com",
        "time": 1742405800000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "3711301432724062607",
        "title": "Trump administration follows Biden in defending 340B drug-discount program | $JNJ $NVS $BMY $LLY",
        "url": "https://seekingalpha.com/news/4421877-trump-administration-follows-biden-defending-340b-drug-discount-program",
        "site": "seekingalpha.com",
        "time": 1742325758000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-915585994618786933",
        "title": "From cancer vaccines to COPD treatments, these 10 companies are developing innovative medicines",
        "url": "https://www.fastcompany.com/91269637/medicines-therapeutics-pharmaceuticals-most-innovative-companies-2025?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1742295600000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "lly"
        ],
        "description": "In 2024, drug makers delivered breakthrough treatments in conditions that had seen little progress for decades—and helped make existing therapies more accessible. Approved in July, Eli Lilly’s Kisunla is the first limited-duration treatment shown to slow the progression of early-stage Alzheimer’s disease. In September, Bristol Myers Squibb got the agency’s greenlight for Cobenfy, the first major new drug for schizophrenia in 70 years. With the landmark approval of its epinephrine nasal spray, Neffy, ARS Pharmaceuticals has taken the needle—and needle-phobia—out of the equation for people who need epinephrine auto-injectors to treat severe allergic reactions. Cancer immunotherapy remains a focus of innovation across the industry, with notable 2024 wins Iovance’s and Adaptimmune’s first-ever approvals for T-cell therapies targeting solid tumors. Addressing the burden of patients living with chronic disease, Pfizer built on its pipeline of innovative hemophilia therapies, while Verona’s dual-action treatment for COPD offers a breakthrough in maintenance therapy that will help some 16 million adults U.S. living with respiratory disease to breathe easier.1. ARS PharmaFor developing a needle-free way to treat life-threatening allergic reactionsRoughly 1.5 million patients in the U.S. have a prescription for an Epipen or another epinephrine auto-injector, for the emergency treatment of allergic reactions. But many of them don’t regularly carry the drug with them, or they hesitate to use it because of the large needle. They got an alternative with the August 2024 Food and Drug Administration approval of Neffy, the first a nasal spray formulation of epinephrine, made by ARS Pharmaceuticals. The approval, which covers Neffy for adults and children who weigh at least 66 pounds, makes Neffy the first non-injectable epinephrine product for the treatment of life-threatening anaphylaxis. Neffy uses a novel chemical-compound technology called Intravail that ensures the drug can be absorbed through the nose at levels similar to injectable forms. The spray container requires no priming—you just insert and press—and its 30-month shelf life at temperatures up to 122°F is a big advantage over auto-injectors, which have 18-20 month shelf lives and stricter temperature requirements. Neffy could be especially useful for emergency medical units, first responders, and airlines, for whom needle-based therapies may not be permitted. The drug officially hit the U.S. market in late September, and by February 2025 insurance coverage was available for about 50% of people covered by commercial plans. A European version, EURneffy, will be available starting in early 2025, distributed by Denmark’s ALK-Abelló, and licensing partners have filed for approval of Neffy in China, Japan, and Australia. Read more about ARS Pharma, honored as No. 34 on Fast Company’s list of the World’s 50 Most Innovative Companies of 2025.2. Bristol Myers SquibbFor bringing a new approach to schizophrenia treatment—at lastIn September 2024, the FDA approved Cobenfy (xanomeline and trospium chloride) as the first major new schizophrenia drug in 70 years. Cobenfy uses an entirely different mechanism than existing treatments; it works by triggering muscarinic receptors, rather than dopamine receptors, and is the first schizophrenia treatment to do so. Cobenfy has been generally well tolerated in clinical trials and unlike the commonly used atypical antipsychotics, does not have a boxed warning of increased mortality in certain older patients. A rare breakthrough in a chronically difficult and underfunded illness, Cobenfy was acquired when it was in development from Karuna Therapeutics and successfully brought to market by BMS, which is now working to expand indications for the drug: the company could present data from its ADEPT program for Cobenfy in Alzheimer’s disease in 2026. BMS also plans to start three additional phase 3 trials in bipolar I disorder and Alzheimer’s disease.3. Eli LillyFor helping to slow Alzheimer’s-related cognitive declineThe FDA approved Lilly’s Alzheimer’s drug, Kisunla, a monoclonal antibody treatment for early symptomatic Alzheimer’s disease, in July. Developed internally at Lilly, Kisunla is the first and only amyloid plaque-targeting therapy that uses a limited-duration treatment regimen. In phase 3 trials of 1,736 patients, Kisunla slowed cognitive and functional decline by up to 35% compared to placebo at 18 months and reduced the risk of progressing to the next clinical stage of disease by up to 39%. Kisunla differs from its competitor therapy, Leqembi, manufactured by Biogen and Eisai, in that it needs to be administered every four weeks vs. every two weeks. Lilly has also continued to build on its lucrative GLP-1 franchise of Mounjaro and Zepbound. To compete against online compounders of knockoff drugs, in January, the company launched a direct-to-consumer channel for discount Zepbound prescriptions with home delivery. Continuing trials in new indications is also paying off, most notably with the December 23, 2024 FDA approved the weight-loss drug Zepbound as the first prescription medication specifically for treating obstructive sleep apnea, which affects an estimated 22 million Americans or more.4. Aurion BiotechFor designing cell therapy that prevents blindnessApproved in Japan in May 2023 and commercially launched there in September 2024, Aurion’s Vyznova (AURN001) is the first clinically validated cell therapy for corneal care. The drug treats corneal endothelial disease, a progressive condition that affects millions of people throughout the world and which, if left untreated, leads to blindness. Prior to Vyznova, the only definitive treatment for bullous keratopathy, one form of corneal endothelial disease, was corneal transplantation using donor tissue, which is scarce—for every 70 diseased eyes, there is only one donor cornea available. Aurion has developed a manufacturing process that can produce up to 1,000 doses of Vyznova from the corneal endothelial cells of a single donor. In June 2024 the U.S. Food and Drug Administration granted Vyznova coveted Breakthrough Therapy Designation (BTD) and Regenerative Medicine Advanced Therapy (RMAT) designations, giving the cell therapy an expedited path to approval. Data released in December from U.S. phase 1/2 clinical trials showed that the highest dose of Aurion’s cell therapy saw a statistically significant vision improvement.5. Iovance BiotherapeuticsFor fighting melanoma with a tumor-infiltrating immunotherapyIn February 2024, the FDA gave accelerated approval for Iovance’s Amtagvi to treat advanced melanoma (a Phase 3 trial is underway to confirm the clinical benefit seen in earlier trials). Amtagvi is the first one-time, individualized T-cell therapy approved for a solid tumor cancer. While CAR T-cell therapies can be powerfully effective in blood cancers, they haven’t performed as well in solid tumors. A one-time treatment, Amtagvi uses tumor infiltrating lymphocytes (TILs), naturally occurring immune cells that fight cancer, to durably treat some of these solid tumors. Some treated patients have been cancer-free for a decade or more. Amtagvi is manufactured in a proprietary process that collects and expands natural TIL cells that unique to each patient, but are usually depleted when they are sick. Then, billions of these killer cells are put back into their body to fight the cancer. The approval of Amtagvi is promising for TILs as a new class of drugs for solid tumors, with trials ongoing for lung cancer, cervical cancer, and more. The one-time cell has a cost $515,000 per patient, before rebates and discounts. The company expects that many insurance companies will cover the treatment at the same levels as CAR T-cell therapies.6. AdaptimmuneFor engineering T-cells to target solid tumorsOn August 1, 2024, Adaptimmune received accelerated FDA approval of Tecelra, a gene therapy for the treatment of adults with a specific type of synovial sarcoma who have previously undergone chemotherapy. This approval made Tecelra the first engineered cell therapy for a solid tumor cancer approved in the U.S., and the first new therapy option in more than a decade for synovial sarcoma, a rare soft tissue cancer that most commonly impacts young adults. Tecelra is an “autologous” T cell immunotherapy, meaning that it is composed of a patient’s own T cells that are modified in a lab to express a receptor that targets the MAGE-A4 protein on cancer cells. When these modified T cells are infused back into the patient., they are “pre-trained” to find and attack cancer cells that express the MAGE-A4 protein, helping to stop the cancer from growing or spreading.Trial data of Tecelra showed an overall response rate of 43%, with a complete response rate of 4.5% and a median duration of response of 6 months. Among patients who were responsive to the treatment, 39.% had a duration of response of 12 months or longer. In December, Adaptimmune announced that the first patient has been treated with Tecelra, at Moffitt Cancer Center, one of Adaptimmune’s Authorized Treatment Centers. The one-time treatment is launching with a list price of $727,000, the most expensive per-dose cost of any cellular medicine for cancer in the U.S. A second experimental T cell therapy called lete-cel has achieved its primary endpoint in a phase 2 trial. Adaptimmune estimates the two therapies combined could generate $400 million in peak yearly sales in the U.S.7. Verona PharmaFor helping COPD patients breathe easierOn June 26, 2024, the U.S. Food and Drug Administration (FDA) approved Ohtuvayre (ensifentrine), Verona Pharma’s novel therapy for chronic obstructive pulmonary disease (COPD). The treatment is the first inhaled maintenance therapy with a novel mechanism of action in more than 20 years to treat the condition, and offers a breakthrough for some 16 mil",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2354643181975156609",
        "title": "Ireland’s Profits From Weight-Loss Drugs Draw Trump’s Attention",
        "url": "https://www.bloomberg.com/news/articles/2025-03-17/ireland-s-big-tech-and-pharma-profits-put-it-in-trump-s-gaze",
        "site": "bloomberg.com",
        "time": 1742187615000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Irish government mounts a St. Patrick’s Day diplomatic offensive to try and calm Trump anger at ‘massive’ trade surplus. The Eli Lilly manufacturing plant in Limerick. Lilly has been bulking up its Irish production capacity in Kinsale and Limerick.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6819877533797528052",
        "title": "Eli Lilly snaps six days of losses",
        "url": "https://seekingalpha.com/news/4420873-eli-lilly-snaps-six-days-of-losses",
        "site": "seekingalpha.com",
        "time": 1741983013000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5569265807471888105",
        "title": "Roche-Zealand deal is the latest to boost obesity space | $RHHBY $RHHBF $ZLDPF $NVO $LLY",
        "url": "https://seekingalpha.com/news/4419878-roche-zealand-become-latest-lift-obesity-space",
        "site": "seekingalpha.com",
        "time": 1741790619000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1844728448892481950",
        "title": "Novo Nordisk, Lilly Stocks Are Falling. A Rival Weight-Loss Drug Is on the Way.",
        "url": "https://www.barrons.com/articles/novo-nordisk-stock-lilly-weight-roche-f6836624?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1741783980000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8908950746627061317",
        "title": "Roche, Zealand Pharma in $5.3 Billion Pact for Obesity Drugs",
        "url": "https://www.bloomberg.com/news/articles/2025-03-12/roche-zealand-pharma-in-5-3-billion-pact-for-obesity-treatment",
        "site": "bloomberg.com",
        "time": 1741763970000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Roche Holding AG licensed a new weight-loss drug from Zealand Pharma A/S for as much as $5.3 billion, bolstering the Swiss drugmaker’s effort to get into a hot market dominated by Novo Nordisk A/S and Eli Lilly & Co.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1692908325513099595",
        "title": "Nearly 1 in 5 Americans have tried a GLP-1 med - survey | $NVO $LLY",
        "url": "https://seekingalpha.com/news/4419403-nearly-1-in-5-americans-have-tried-glp-1-med",
        "site": "seekingalpha.com",
        "time": 1741705229000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-5141232413581239797",
        "title": "How pharmaceutical companies are training their workers on AI",
        "url": "https://www.businessinsider.com/pharmaceutical-companies-embrace-ai-in-drug-discovery-efforts-2025-3",
        "site": "businessinsider.com",
        "time": 1741635045000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Courtesy of Merck; Karan Singh for BIPharmaceutical giants such as J&J, Merck, and Eli Lilly are embracing AI and prioritizing upskilling.They hope that training thousands of employees on generative AI will boost productivity in drug development.This article is part of \"AI in Action,\" a series exploring how companies are implementing AI innovations.Johnson & Johnson is embracing the concept of a bilingual employee — but not in the classic sense.For the pharmaceutical company, literacy is needed in specialized and core job skills, including research, supply chain, and finance. Then there's fluency in AI technology.\"There are so many ways we've been using AI,\" said Jim Swanson, the chief information officer of J&J. \"But to do that effectively, we had to really create a curriculum and a mindset around upskilling.\"More than 56,000 of J&J's 138,000 workers have taken a generative AI training course, which is required before any employee is authorized to use the technology. After training, J&J's employees can utilize generative AI tools for summarization and prompt engineering, the latter a skill to ask the right question to get the best output from a large language model. A separate, more in-depth digital boot camp that covers topics including AI, augmented reality, and automation has recorded more than 37,000 cumulative hours of training from more than 14,000 employees.Generative AI offers the promise of more quickly identifying compounds for new treatments and vaccines, accelerating drug development, streamlining regulatory compliance, optimizing which patients are best suited for clinical trials, and improving how new drugs are marketed.Deborah Golden, Deloitte's US chief innovation officer, said these advancements were poised to change which skills the pharmaceutical industry prioritizes in recruitment. Biology and chemistry knowledge will still be needed, but it isn't as essential for newer roles like AI engineers, and other new roles might require a mix of traditional expertise and AI know-how if AI-driven drug discovery proliferates.\"When you think about how AI is shifting the balance and the talent requirements, you really need to be able to speak both the language of biology and AI models,\" Golden said.How AI is changing drug developmentGenerative AI could save the pharmaceutical industry tens of billions of dollars each year through improved productivity within drug development.J&J, the maker of treatments like the immunosuppressive drug Stelara and Darzalex, a medication for treating the cancer multiple myeloma, has used more traditional forms of AI for almost a decade. Use cases include AI-enabled software tools that can guide a surgeon through a procedure, speed up drug discovery, and help drug makers manage inventory more effectively.In 2023, J&J piloted a six-week digital immersion program that focused on AI, data science, and other emerging technologies. More than 2,500 employees participated last year, taking 90-minute classes each week, and J&J is planning further expansion this year.Swanson told Business Insider it was critical for company leaders to create a culture that promotes technological literacy. \"We've been around 135 years. We've had to reinvent ourselves multiple times to stay relevant and current,\" he said.The pharmaceutical giant Merck's early generative AI investments included the development of a proprietary platform called GPTeal. Merck — which is responsible for the HPV vaccine Gardasil and the immunotherapy drug Keytruda — said that GPTeal gives employees access to large language models such as OpenAI's ChatGPT, Meta's Llama, and Anthropic's Claude while keeping company data secure from external exposures.Employees are also using generative AI to draft emails and memos and for other productivity-focused tasks, but Merck's aspirations are also getting bolder.\"Now, the journey is clearly to identify, implement, track, and measure use cases that have a dramatic impact on our business,\" said Ron Kim, a senior vice president and the chief technology officer of Merck.Generative AI allows Merck's employees more time to focus on higher-impact tasks. In drug discovery, for example, generative AI can help draft (human-reviewed) regulatory documents that are submitted to health authorities. \"We felt like some of our scientists were taking time being copyeditors,\" Kim said. \"That's not what they trained for.\"Kim said more than 50,000 Merck employees were using GPTeal regularly. The company supported upskilling through a mix of self-serve digital training courses, monthly webcasts focused on generative AI, and boot camps for software developers that could last anywhere from half a day to 10 days.AI can appeal to pharmaceutical companies of various sizesDr. Daniel Stevens, the chief medical officer at Blue Earth Therapeutics, said AI was alluring to the clinical-stage radiopharmaceutical company because, as a small startup founded in 2021, it has to be judicious with how it spends capital.\"The application of artificial intelligence is of interest, because it may help us with some of our efficiency goals,\" Stevens said.A $76.5 million Series A in October, which included funding from the healthcare investment firm Soleus Capital and the diagnostic imaging company Bracco Diagnostics, was mostly intended to support clinical trials that will assess the safety and effectiveness of new prostate cancer treatments.Stevens said that with just 20 full-time employees, Blue Earth has not yet needed to offer AI upskill training. He added that when Blue Earth grows its employee base and is ready to offer instruction about the technology, it plans to use online courses and AI certifications from external vendors.Eli Lilly, the pharmaceutical giant behind treatments including the antidepressant Prozac and the type 2 diabetes and weight loss medicine Mounjaro, has used generative AI to support the research of both small and large molecules. The company also used AI to generate documentation for clinical trials and create materials for regulatory submissions.After ChatGPT launched, major employers such as Apple and Amazon restricted employee use of the popular chatbot, with many citing concerns about data privacy. \"We went in the exact opposite direction,\" said Diogo Rau, the chief information and digital officer at Eli Lilly.Rau encouraged Eli Lilly's workforce to embrace the tool without exposing sensitive company information, similar to how an employee might use Google Search.\"We told everybody you need to use it, you need to start bringing ChatGPT into your work,\" said Rau. But, he added, \"Don't put anything in there that you don't want to get out.\"The company also internally sought to bolster interest with an \"AI Games\" competition timed to the Summer Olympics in Paris. Contests involved using a chatbot to write a message to a colleague or relying on generative AI to make a quiz about Eli Lilly's history.In 2024, Eli Lilly also encouraged all employees and managers to use generative AI for their year-end reviews. This year, the company is set to require all senior leaders and managers to obtain an AI certification.\"We've got a workforce that is embracing AI,\" Rau said, adding that employees often stopped him in the office or emailed him to share the ways they were applying AI to their daily work tasks.Read the original article on Business Insider Courtesy of Merck; Karan Singh for BIPharmaceutical giants such as J&J, Merck, and Eli Lilly are embracing AI and prioritizing upskilling.They hope that training thousands of employees on generative AI will boost productivity in drug development.This article is part of \"AI in Action,\" a series exploring how companies are implementing AI innovations.Johnson & Johnson is embracing the concept of a bilingual employee — but not in the classic sense.For the pharmaceutical company, literacy is needed in specialized and core job skills, including research, supply chain, and finance. Then there's fluency in AI technology.\"There are so many ways we've been using AI,\" said Jim Swanson, the chief information officer of J&J. \"But to do that effectively, we had to really create a curriculum and a mindset around upskilling.\"More than 56,000 of J&J's 138,000 workers have taken a generative AI training course, which is required before any employee is authorized to use the technology. After training, J&J's employees can utilize generative AI tools for summarization and prompt engineering, the latter a skill to ask the right question to get the best output from a large language model. A separate, more in-depth digital boot camp that covers topics including AI, augmented reality, and automation has recorded more than 37,000 cumulative hours of training from more than 14,000 employees.Generative AI offers the promise of more quickly identifying compounds for new treatments and vaccines, accelerating drug development, streamlining regulatory compliance, optimizing which patients are best suited for clinical trials, and improving how new drugs are marketed.Deborah Golden, Deloitte's US chief innovation officer, said these advancements were poised to change which skills the pharmaceutical industry prioritizes in recruitment. Biology and chemistry knowledge will still be needed, but it isn't as essential for newer roles like AI engineers, and other new roles might require a mix of traditional expertise and AI know-how if AI-driven drug discovery proliferates.\"When you think about how AI is shifting the balance and the talent requirements, you really need to be able to speak both the language of biology and AI models,\" Golden said.How AI is changing drug developmentGenerative AI could save the pharmaceutical industry tens of billions of dollars each year through improved productivity within drug development.J&J, the maker of treatments like the immunosuppressive drug Stelara and Darzalex, a medication for treating the cancer multiple myeloma, has used more traditional forms of A",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "6891705989323982443",
        "title": "Lilly sees launching weight loss drugs in China, India starting late 2025",
        "url": "https://seekingalpha.com/news/4419000-lilly-sees-launching-weight-loss-drugs-china-india-starting-late-2025",
        "site": "seekingalpha.com",
        "time": 1741625821000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "798618229957548045",
        "title": "Eli Lilly posts long-term data for eczema therapy Ebglyss",
        "url": "https://seekingalpha.com/news/4418547-eli-lilly-posts-long-term-data-eczema-therapy",
        "site": "seekingalpha.com",
        "time": 1741361969000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "2108957790746715103",
        "title": "LifeMD and Teladoc Health partner with LillyDirect pharmacy provider Gifthealth for Zepbound | $LLY $TDOC $LFMD",
        "url": "https://seekingalpha.com/news/4418038-lifemd-and-teladoc-health-partner-with-lillydirect-pharmacy-provider-gifthealth-for-zepbound",
        "site": "seekingalpha.com",
        "time": 1741272200000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "4906843812414968426",
        "title": "Hims & Hers down as judge denies motion over end to Lilly’s Zepbound shortage",
        "url": "https://seekingalpha.com/news/4418014-hims-hers-stock-down-zepbound-motion-denied",
        "site": "seekingalpha.com",
        "time": 1741268223000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "5677044501897140394",
        "title": "Novo Nordisk goes direct to consumer with Wegovy. What it means for obesity rival Eli Lilly",
        "url": "https://www.cnbc.com/2025/03/05/novo-nordisk-goes-direct-to-consumer-with-wegovy-what-it-means-for-obesity-rival-eli-lilly.html",
        "site": "cnbc.com",
        "time": 1741198747000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Shares of Eli Lilly rose Wednesday despite its rival's announcement.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1113102008618268967",
        "title": "Amgen starts two critical late-stage trials for weight loss drug MariTide",
        "url": "https://www.cnbc.com/2025/03/05/amgen-weight-loss-drug-maritide-starts-two-phase-three-trials.html",
        "site": "cnbc.com",
        "time": 1741186493000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "lly"
        ],
        "description": "MariTide is a monthly injection that investors hope could compete against existing weight loss drugs from Novo Nordisk and Eli Lilly.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-8180623352591626375",
        "title": "Amgen Starts Final-Stage Studies of Its Monthly Obesity Drug",
        "url": "https://www.bloomberg.com/news/articles/2025-03-05/amgen-starts-final-stage-studies-of-its-monthly-obesity-drug",
        "site": "bloomberg.com",
        "time": 1741186372000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Amgen Inc. launched two final-stage studies of its monthly obesity treatment, a closely watched drug that would compete with blockbuster weight-loss medicines from Eli Lilly & Co. and Novo Nordisk A/S. Amgen headquarters in Thousand Oaks, California.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-2274373808145505985",
        "title": "Weight-loss-drug price war is on, as Wegovy prices cut for monthly subscribers",
        "url": "https://www.marketwatch.com/story/weight-loss-drug-price-war-is-on-as-wegovy-prices-cut-for-monthly-subscribers-1b6b34e6?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1741183200000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "lly"
        ],
        "description": "Novo Nordisk is cutting prices on weight-loss drug Wegovy, a week after Eli Lilly did the same for rival Zepbound.",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "-1649564541098903174",
        "title": "Novo Nordisk to Sell Weight-loss Drug Wegovy Direct to Patients",
        "url": "https://www.bloomberg.com/news/articles/2025-03-05/novo-nordisk-to-sell-weight-loss-drug-wegovy-direct-to-patients",
        "site": "bloomberg.com",
        "time": 1741183107000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "lly"
        ],
        "similar_stories": [
            "-8878274235097213552",
            "2887082792174127298",
            "-6330017589852693285",
            "6008674504631571023",
            "-6697975231069920571",
            "-1348312514015131573",
            "-5398622708192490601",
            "5944805997891580081",
            "-738217854582289686",
            "-1844728448892481950",
            "-3286344931650089093",
            "6891705989323982443",
            "4763384342875174456",
            "5677044501897140394",
            "-2439132110407940618",
            "-8180623352591626375",
            "-2274373808145505985"
        ],
        "description": "Novo Nordisk A/S is following in rival Eli Lilly & Co.’s footsteps by selling its hit weight-loss drug Wegovy directly to US patients at a discount. Packets of Wegovy at the Novo Nordisk A/S production facilities in Hillerod, Denmark, on Monday, June 12, 2023. The success of Novo's bestsellers Ozempic and Wegovy, drugs that help people lose significant amounts of weight, has created something of a gold rush in the pharma industry with about 40 companies developing products that will intensify competition. Photographer: Carsten Snejbjerg/Bloomberg",
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "8812691680483120972",
        "title": "Novo Nordisk launches NovoCare rivaling Eli Lilly’s LillyDirect",
        "url": "https://seekingalpha.com/news/4417440-novo-nordisks-novocare-rivals-lillys-lillydirect",
        "site": "seekingalpha.com",
        "time": 1741181940000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    },
    {
        "id": "1042803846945552449",
        "title": "Generic drugmakers could see negative impact from higher Chinese tariffs | $PFE $LLY $MRK $TEVA $VTRS",
        "url": "https://seekingalpha.com/news/4417090-generic-drugmakers-could-see-negative-impact-higher-chinese-tariffs",
        "site": "seekingalpha.com",
        "time": 1741114044000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "lly"
        ],
        "tickers": [
            "lly"
        ]
    }
]