[
    {
        "id": "7861896914616825105",
        "title": "U.S. Bank Expands Suite of Embedded Payment Products",
        "url": "https://www.pymnts.com/payments-as-a-service/2025/u-s-bank-expands-suite-of-embedded-payment-products/",
        "site": "pymnts.com",
        "time": 1750185682000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "usb"
        ],
        "description": "U.S. Bank says it has expanded its suite of embedded payment solutions. [contact-form-7] The expansion, announced Tuesday (June 17), lets businesses integrate payments into their existing systems, and includes a for-benefit-of (FBO) solution for companies to move money on behalf of their customers. “Today’s finance leaders are under increasing pressure to optimize liquidity, reduce friction […] The post U.S. Bank Expands Suite of Embedded Payment Products appeared first on PYMNTS.com. U.S. Bank says it has expanded its suite of embedded payment solutions. [contact-form-7] The expansion, announced Tuesday (June 17), lets businesses integrate payments into their existing systems, and includes a for-benefit-of (FBO) solution for companies to move money on behalf of their customers. “Today’s finance leaders are under increasing pressure to optimize liquidity, reduce friction in payments, move quickly and enhance the customer experience,” Kristy Carstensen, head of U.S. Bank Treasury and Payment Solutions, said in a news release. “Our expanded embedded payments suite empowers organizations to embed secure, real-time payment capabilities directly into their platforms — streamlining operations and strengthening financial control.” The release noted that U.S. Bank has been working to integrate payment capabilities into the software and platforms businesses use each day, with its Elavon subsidiary long supporting “embedded, technology-driven merchant acquiring solutions.” According to the release, examples of the types of companies that can use embedded payments include FinTechs, insurance carriers, healthcare systems, online auto retailers, title companies and more. Among these FinTechs is Basefund, which the release said integrates U.S. Bank’s payment capabilities to securely process high-value, multi-party transactions for the corporations and municipalities that are its customers. “Our customers value how easy it is to use our platform to make their transactions secure. With U.S. Bank Embedded Payment Solutions, we can now process those transactions in the application while also providing the risk, security and compliance expertise of one of the nation’s leading banks,” said Basefund CEO Robert White. As PYMNTS wrote last month, the rise of embedded payments is helping to change the business models of several types of businesses, including legal and financial services companies, accounting firms, nonprofits and logistics operators. “For the payments processors serving those firms — and partnering with independent software vendors (ISVs) and other providers — helping them offer customers the payments options where and when they want them is essential,” that report said. In an interview with PYMNTS, Adam Gray, chief transformation officer at Stax, noted that “as an industry we are always trying to serve new markets — and for embedded payments, there are historically underserved markets that we’re seeing growth.” These small to mid-sized businesses, Gray added, are embracing technology and software, and are looking to consolidate their vendors. That means that technology providers need to function as “one-stop shops” for ways in which they can reduce costs and hone in on their core specialties, without worrying about integrating payments into the mix. The post U.S. Bank Expands Suite of Embedded Payment Products appeared first on PYMNTS.com.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-3238621519430211978",
        "title": "Many Exporters No Longer Want Dollars, US Bank Executive Says",
        "url": "https://www.bloomberg.com/news/articles/2025-06-16/many-exporters-no-longer-want-dollars-us-bank-executive-says",
        "site": "bloomberg.com",
        "time": 1750086144000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "usb"
        ],
        "description": "When Paula Comings, the head of currency sales for US Bancorp, talks to US importers, she increasingly hears the same message: Their foreign counterparties no longer want to be paid in dollars. A worker operates a forklift to sort packaged goods destined for export, at a warehouse along the US-Mexico border in Ciudad Juarez, Chihuahua state, Mexico, on Tuesday, Feb. 4, 2025. US President Donald Trump agreed to delay 25% tariffs against Mexico for one month after a conversation with his counterpart Claudia Sheinbaum on Monday, a dramatic turnabout with the neighboring nations on the brink of a trade war.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-7767578275780140677",
        "title": "Fiserv Integrates Credit Choice Tool With U.S. Bank Card Program",
        "url": "https://www.pymnts.com/partnerships/2025/fiserv-integrates-credit-choice-tool-with-u-s-bank-card-program/",
        "site": "pymnts.com",
        "time": 1749755516000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "usb"
        ],
        "description": "U.S. Bank says its Elan Financial Services has launched a partnership with Fiserv. [contact-form-7] The collaboration, announced Thursday (June 12), will integrate Elan’s credit card program with Fiserv’s Credit Choice solution. As the companies noted in the news release, Credit Choice lets financial institutions provide a “digital-first, branded agent-bank credit card program” for consumer and small […] The post Fiserv Integrates Credit Choice Tool With U.S. Bank Card Program appeared first on PYMNTS.com. U.S. Bank says its Elan Financial Services has launched a partnership with Fiserv. [contact-form-7] The collaboration, announced Thursday (June 12), will integrate Elan’s credit card program with Fiserv’s Credit Choice solution. As the companies noted in the news release, Credit Choice lets financial institutions provide a “digital-first, branded agent-bank credit card program” for consumer and small business customers. The program already serves more than 100 Fiserv financial institution clients. “As part of the partnership, Credit Choice will be enhanced with the Elan Credit Card program to offer integrated digital technology that combines both debit and credit card account information for consumer and small business cardholders within each financial institution’s digital card management solution,” the release added. This allows customers to access credit and debit card information and servicing in a single place, the companies said, while financial institutions will have easier access to the tools they need to onboard and service their cardholders, the companies said. The collaboration will pick up this summer, with “full conversion” of the portfolio by the end of the year. Fiserv will integrate its digital card solutions for consumer and business card and expense management in the first half of 2026. “We’re introducing a new level of digital card integration along with exceptional service and capabilities to the Credit Choice solution,” said Erik Wichita, head of card services at Fiserv. “Our clients need self-service customer journeys and easy to navigate platforms for their cardholders to drive loyalty and increased usage. This collaboration brings two great industry leaders together for one solution.” PYMNTS Intelligence collaborated with Elan recently on the report “Digital Payments Evolution: Virtual Cards Poised to Take Off.” That report found that 42% of consumers in the United States had used a virtual card in the previous six months, chiefly for online purchases and subscriptions. In addition, 65% of consumers said they’d be likely to use a virtual card in the year ahead. As PYMNTS wrote last week, this could indicate a potential turning point not just for adoption, but in the public’s appetite for payment tools that provide control, security and flexibility greater than what digitized physical cards can offer. “Digital wallets have already done much of the heavy lifting in familiarizing consumers with cardless payments. Today, over half of U.S. consumers store at least one card in a wallet like Apple Pay or Google Wallet,” PYMNTS wrote. “That familiarity is increasingly proving crucial to the rise of virtual cards, which don’t exist as plastic first. Instead, they’re issued and used entirely digitally, often with one-time numbers for each transaction, limiting exposure to fraud.” The post Fiserv Integrates Credit Choice Tool With U.S. Bank Card Program appeared first on PYMNTS.com.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-5359798221714241957",
        "title": "U.S. Bank, Fiserv create integrated agent card issuance",
        "url": "https://seekingalpha.com/news/4457656-us-bank-fiserv-create-integrated-agent-card-issuance",
        "site": "seekingalpha.com",
        "time": 1749741887000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-224307529496813958",
        "title": "U.S. Bancorp's crypto custody offering 'is back' after rough first attempt, CEO says",
        "url": "https://seekingalpha.com/news/4457320-us-bancorps-crypto-custody-offering-is-back-after-rough-first-attempt-ceo-says",
        "site": "seekingalpha.com",
        "time": 1749660234000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-6783884726866163822",
        "title": "SA analyst downgrades: PLTR, NEM, USB, SYK, DXCM, BK, ZIM, GERN | $NEM $USB $SYK $BK $GERN",
        "url": "https://seekingalpha.com/news/4446575-sa-analyst-downgrades-pltr-nem-usb-syk-dxcm-bk-zim-gern",
        "site": "seekingalpha.com",
        "time": 1747071444000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-1202087129833518651",
        "title": "Q1 2025 Freight Payment Index giving mixed signals",
        "url": "https://www.freightwaves.com/news/q1-2025-freight-payment-index-giving-mixed-signals",
        "site": "freightwaves.com",
        "time": 1746739321000,
        "favicon_url": "https://static.tickertick.com/website_icons/freightwaves.com.ico",
        "tags": [
            "usb"
        ],
        "description": "Recent Q1 data released by U.S. Bank as part of its Freight Payment Index painted a mixed picture of the national truck freight market, characterized by persistent declines alongside emerging signs of recovery. The post Q1 2025 Freight Payment Index giving mixed signals appeared first on FreightWaves. U.S. Bank Q1 2025 Freight Payment Index pairs declines with emerging recovery (Chart: U.S. Bank) Recent Q1 data released by U.S. Bank as part of its Freight Payment Index painted a mixed picture of the national truck freight market, characterized by persistent declines alongside emerging signs of recovery. The Shipments Index fell 5.8% from Q4 2024 to 75.4 points, while the Spend Index dropped 2.5% to 177.8 points. Despite these quarterly declines, the year-over-year spending drop of 8.6% was the smallest since Q1 2023, a potential stabilization signal after four quarters of declines exceeding 20%. Bob Costello, chief economist at the American Trucking Associations, attributed the ninth consecutive quarter of declines to severe winter storms, wildfires, tariff uncertainties and sluggish retail sales. Extreme weather events, including heavy snowfall in the South and Southeast and devastating wildfires in Southern California, disrupted freight volumes for weeks, though the West reported higher shipments for the quarter. Economic factors contributed to mixed signals. Shippers and manufacturers ramped up imports and production to preempt potential tariffs, temporarily boosting freight demand in certain sectors. However, soft retail sales and cautious consumer spending on big-ticket items created headwinds. The disparity between shipment (-5.8% quarterly, -13.8% yearly) and spending (-2.5% quarterly, -8.6% yearly) declines suggests tightening industry capacity, driven by rising diesel prices and shrinking fleets as some carriers exited or downsized. Freight rates showed modest recovery, with spot rates rising 0.9% and contract rates up 0.8% from Q4, though both remained lower than Q1 2024. Fuel prices, up 2.3% quarterly but down 14% yearly, further influenced spending trends. Regionally, outcomes diverged sharply. The Northeast led with a 3.6% shipment increase and 4.1% spending rise, fueled by robust retail sales and import volumes — its strongest performance since Q2 2022. In contrast, the Midwest and Southeast faced challenges. The Midwest saw declines due to weak manufacturing, a 30% drop in housing starts and winter weather, while the Southeast struggled with unusual snow and flat retail growth. Looking ahead, the freight market faces uncertainties from a declining housing sector, though improved factory output and potential shifts toward goods purchasing offer some hope. April preliminary Class 8 orders take a dive to pandemic levels Recent April Class 8 data released by ACT Research and FTR Transportation Intelligence showed the lowest order total since May 2020 during the days of COVID shutdowns. ACT Research reported 7,600 units, a decline of 52% year over year. Ken Vieth, president and senior analyst at ACT Research, wrote in the release, “Between the end of the industry’s annual ‘order season’ and the uncertainty surrounding the impact of US economic policy that peaked at the start of the month on ‘Liberation Day,’ April delivered the weakest cumulative MD and HD order tally since the beginning of the pandemic when markets were comparably unsettled.” Rival firm FTR Transportation Intelligence reported 7,400 units in April, a decline of 54% both month over month and y/y. For reference, the seven-year April Class 8 order average is 18,963 units. FTR notes that reciprocal U.S. tariffs announced in early April added further challenges for fleets and the overall freight market. Additionally, some fleets are holding off on truck and tractor purchases until market conditions improve or stabilize, according to the release. Looking at cumulative orders for the 2025 Class 8 order season, which ran from September 2024 through April 2025, orders are down 11% compared to the 2024 order season. FTR adds, “Increasing levels of cancellations in response to growing uncertainty might have contributed to the unusually low order levels this month. Both the on-highway and vocational markets saw substantial declines m/m due to weakening demand fundamentals.” Market update: April LMI data shows pricing outgrowing capacity (Chart: The Logistics Managers’ Index) Recent data from Logistics Managers’ Index (LMI) for April showed a freight market under strain, as transportation pricing surged ahead of capacity growth, signaling tighter conditions for shippers. The LMI is a diffusion index where a reading above 50 signals expansion and a reading below that, contraction. The overall LMI index rose 1.7 points, from 57.1 to 58.8, fueled in part by rising inventory levels, warehousing prices and transportation prices. Transportation prices rose 5.8 points from March to 62.3 points while transportation capacity saw a lower rate of expansion, up 1.6 points from 53.6 to 55.2 points. FreightWaves’ Todd Maiden wrote, “The Tuesday report said ‘the negative freight inversion’ experienced in late March, when capacity was growing faster than pricing, didn’t continue into April, ‘meaning that the transportation market is still officially in expansion.’” A continued theme the authors note is the origin inventory costs and warehousing prices, which “suggest that much of the inventory that was rushed in during Q1 is still sitting stagnant in storage facilities and not being sold to consumers. The movements in inventories we observed from January to mid-March are very similar to the movements we would normally see from August to mid-October.” The main difference between the Q1 versus the Q3 rush is Q3 inventory cresting is from items about to be sold for the holiday season; the current inventory buildup will take more time to sell, suggesting higher storage costs across the board. More inventory hoarding due to tariff uncertainty bodes poorly for transportation capacity that hauls it. The LMI authors added, “Generally, our future numbers suggest that we may see dynamics similar to what we saw in the freight recessions of 2019 and 2022. Both of those downturns were led by decreases in B2B activity, during which Upstream activity contracted or expanded very meekly. Downstream activity was a different story during these freight recessions, as U.S. consumers continued spending, leading to more consistent activity at the retail level.” SONAR spotlight: Volumes fall while rejections remain resilient SONAR Ticker: OTRI.USA, OTVI.USA Summary: The first week of May brought declines in outbound tender volumes while outbound tender rejection rates posted a small rally. Outbound tender volumes dropped 375.14 points or 3.57% in the past week from 10,499.85 points on April 28 to 10,124.71 points. Outbound tender rejection rates saw the opposite, increasing 49 basis points w/w from 4.9% to 5.39%. Compared to year-over-year comps, a recurring theme is that despite lower outbound tender volumes, the availability of transportation capacity remains more favorable when looking at outbound tender rejection rates. OTVI last year was at 11,043.42 points, 918.71 points and 8.32% higher than its current level, while OTRI is 216 bps higher vs 3.23% on May 6, 2024. Comparing by segment, dry van continues to underperform the smaller and more volatile reefer segment. Dry van outbound tender rejection rates rose 17 bps w/w from 4.47% to 4.64% while reefer rejection rates remain elevated, up 15 bps w/w from 8.65% to 8.8%. The more favorable pricing power for reefer was also reflected in gains in all-in spot market rates, while dry van rates appear to have temporarily bottomed out. RTI rose 3 cents per mile w/w from $2.44 to $2.47 while NTI dry van spot rates fell 1 cent per mile w/w from $2.21 to $2.20. The Routing Guide: Links from around the web Are you Roadcheck-ready? Inspectors to key in on PC, false logs (Overdrive) Illegal use of foreign drivers undercuts US trucking industry, stakeholders say (FreightWaves) The freight industry has a CDL issue, and it’s deeper than it seems (FreightWaves) Schneider reports intermodal growth in Mexico amid tariff uncertainty (Trucking Dive) Tariff concerns drive April job gains in trucking and warehousing (Commercial Carrier Journal)Labor Department Won’t Enforce Biden-Era Independent Contractor Rule (Truckinginfo) Most recent episode Like the content? Subscribe to the newsletter here. The post Q1 2025 Freight Payment Index giving mixed signals appeared first on FreightWaves.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "6824901978388265794",
        "title": "Inside U.S. Bank’s Push to Simplify Global Payments in an Era of ‘Co-opetition’",
        "url": "https://www.pymnts.com/news/b2b-payments/2025/inside-u-s-banks-push-to-simplify-global-payments-in-an-era-of-co-opetition/",
        "site": "pymnts.com",
        "time": 1746172920000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "usb"
        ],
        "description": "In the digital age, it’s easier than ever to start a business, to build a commerce platform. But getting operations up and running is one thing; thriving is quite another. What a business might look like — and what it needs from its payments and financial services providers — will look different from inception versus […] The post Inside U.S. Bank’s Push to Simplify Global Payments in an Era of ‘Co-opetition’ appeared first on PYMNTS.com. In the digital age, it’s easier than ever to start a business, to build a commerce platform. But getting operations up and running is one thing; thriving is quite another. What a business might look like — and what it needs from its payments and financial services providers — will look different from inception versus three years into its corporate journey. There’s no linear path to success. Rob Seidman, head of U.S. Bank’s Avvance, told PYMNTS that FinTechs, payments processors and banks need to surface the right value-added tools at the right time to help enterprise clients grow, and so they have to evolve right alongside those clients. “There’s demand from our customers for different, and unique services, added to what we provide traditionally,” he said in a conversation for the “What’s Next in Payments: The Changing Service Economy.” The bank’s acquiring business is growing, he told PYMNTS, with a nod to his own firm, and global expansion of clients’ operations demands products geared toward foreign currency management. The rise of fraud in card-not-present transactions demands robust fraud defenses and identity management as digital wallets gain wider embrace. That’s especially true of Avvance, the point-of-sale lending solution offered by U.S. Bank, embedded into checkout flows, where the need for speedy transactions must be balanced against the need for security. Pursuing the Holy Grail “The holy grail is a frictionless experience for your customers,” he said, “and we’re all striving for great user experiences.” For providers, competition is intense, but where once the lines had been drawn between banks and FinTechs, now there is a spirit of “co-opetition” that allows firms to choose the services and products they need, when they’re needed. There exists a plethora of platforms from which enterprises can choose, the data that can be accessed or how they embed everything from marketing to loyalty and rewards systems. U.S. Bank, noted Seidman, has partnered with a variety of providers in its acquiring suite, along with the point-of-sale lending solution and other offerings that move beyond the demand deposit account (DDA). He likened the model to an “omnipresent solution” that exists through offerings that may or may not be owned by the bank. “There’s a lot of specialization in FinTech tooling,” he said, “and so you see a constellation of FinTechs that have specific services, on behalf of larger FinTechs or other companies or other commerce platforms … we partner because it’s built into ‘tooling’ in other places that we operate.” What Lies Ahead Looking ahead, Seidman said there will be increased need and demand for tokenization — both for identity management and for payments. Wallets will continue to transform commerce, as stored wallets can house those identities as holders use them in their day-to-day lives as consumers or even in B2B scenarios. Borderless commerce, he said, has spurred the need for simplicity in currency management. “When you have volatility in the values of currencies,” he said, “it adds to what is ‘necessary’ to carry out successful cross-border payments and an overall payment strategy.” Crypto is emerging as a viable option over the longer term, but no matter the payment method chosen, “it’s the right time to have the best set of rails and the most choice” to facilitate different consumer and commercial use cases — which then boosts the efficiency of transactions for small businesses and even individual remittances. “Every segment is evolving quickly,” said Seidman, “and in the next three to five years, the introduction and normalization of AI into all aspects of banking, payments and acquiring will transform us … the immediacy of everything will drive the demand for how we evolve and what we offer to the market as well.” The post Inside U.S. Bank’s Push to Simplify Global Payments in an Era of ‘Co-opetition’ appeared first on PYMNTS.com.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "5196633907537072157",
        "title": "U.S. Bank Names Dan Son Head of Working Capital Finance Division",
        "url": "https://www.pymnts.com/personnel/2025/u-s-bank-names-dan-son-head-of-working-capital-finance-division/",
        "site": "pymnts.com",
        "time": 1745530234000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "usb"
        ],
        "description": "U.S. Bank has tapped banking industry veteran Dan Son to lead its working capital finance division. A press release Thursday (April 24) stated that Son will succeed Sam Philbrick, who is retiring after a 45-year career in banking, including 18 years at U.S. Bank. Joining U.S. Bank in 2019, Son most recently led the institution’s […] The post U.S. Bank Names Dan Son Head of Working Capital Finance Division appeared first on PYMNTS.com. U.S. Bank has tapped banking industry veteran Dan Son to lead its working capital finance division. A press release Thursday (April 24) stated that Son will succeed Sam Philbrick, who is retiring after a 45-year career in banking, including 18 years at U.S. Bank. Joining U.S. Bank in 2019, Son most recently led the institution’s sales and origination for working capital finance, the release said. He previously served as U.S. Bank’s head of global banking. “Son played a key role helping U.S. Bank clients navigate supply chain challenges with innovative financing solutions throughout the pandemic,” the release noted. Before joining U.S. Bank, Son spent nearly 17 years at Wells Fargo, where he worked in transaction banking roles across seven different countries and held leadership roles in global financial institutions, global payments, and trade finance. His tenure included nearly a decade in Hong Kong, the press release said. Jimmy Whang, head of U.S. Bank’s global capital markets, described Son in a statement as having “deep product expertise, a comprehensive understanding of connecting bank capabilities, and a strong track record of delivering strategic solutions for clients.” According to the release, the working capital finance division at U.S. Bank comprises several product areas, including asset-based finance, supply chain finance and receivables, and trade services. Depending on what happens because of new U.S. trade policies, the latter two could draw some interest from businesses looking to adapt their working capital strategies. According to the release, U.S. Bank supply chain finance and receivables capabilities “improve cash flow for companies and their suppliers by optimizing payment terms for both parties.” In addition, the bank says it has trade finance experts who provide services to importers and exporters, “leveraging a network of partners across six continents.” But in a recent interview with Global Trade Review, Son said that some U.S. Bank clients that export to China have made tactical adjustments in response to tariffs but emphasized that most are not making significant strategic changes right now. In other U.S. Bank news, PYMNTS reported that the bank will serve as the qualified cash custodian and treasury management services provider for the soon-to-launch real-time settlement network Lynq. The post U.S. Bank Names Dan Son Head of Working Capital Finance Division appeared first on PYMNTS.com.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-1478917404293489783",
        "title": "U.S. Bank Shield Visa Card Review 2025: It’s Got The Power (To Help You Knock Out Debt)",
        "url": "https://www.forbes.com/advisor/credit-cards/reviews/u-s-bank-shield-visa-card/",
        "site": "forbes.com",
        "time": 1744894817000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "usb"
        ],
        "description": "Not all superheroes wear capes. When it comes to debt-busting credit cards, the latest offering from U.S. Bank wields a mighty shield from high interest, offering an intro APR on both purchases and balance transfers. The has the longest intro APR offer currently available, making it a standout for anyone looking to fend off mounting […] Not all superheroes wear capes. When it comes to debt-busting credit cards, the latest offering from U.S. Bank wields a mighty 24 billing cycles shield from high interest, offering an intro APR on both purchases and balance transfers. The U.S. Bank Shield Visa® Card* has the longest intro APR offer currently available, making it a standout for anyone looking to fend off mounting credit card bills. It also earns rewards on travel booked through U.S. Bank, but the intro APR offer is the main event with this card.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-558585410243383227",
        "title": "U.S. Bancorp Says Card Delinquencies Improve, Eyes ‘Money Movement’ Growth",
        "url": "https://www.pymnts.com/earnings/2025/us-bancorp-says-card-delinquencies-improve-eyes-money-movement-growth/",
        "site": "pymnts.com",
        "time": 1744832989000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "usb"
        ],
        "description": "U.S. Bancorp’s first-quarter earnings results showed strong credit quality, as consumer card delinquencies slipped year over year even with the current state of macroeconomic uncertainty. Management also pointed to the diversification of the bank’s revenue streams as a benefit in today’s operating environment, where U.S. Bancorp sees long-term potential in its payments-focused businesses and embedded […] The post U.S. Bancorp Says Card Delinquencies Improve, Eyes ‘Money Movement’ Growth appeared first on PYMNTS.com. U.S. Bancorp’s first-quarter earnings results showed strong credit quality, as consumer card delinquencies slipped year over year even with the current state of macroeconomic uncertainty. Management also pointed to the diversification of the bank’s revenue streams as a benefit in today’s operating environment, where U.S. Bancorp sees long-term potential in its payments-focused businesses and embedded money movement. In remarks to analysts during the company’s conference call following the earnings release Wednesday (April 16), CEO Gunjan Kedia said: “Importantly, our credit quality and capital levels are strong. This quarter, our net charge-off ratio improved modestly and we continued to build capital. We are in an environment of intense market and economic volatility … and we are prepared for a variety of possible scenarios.” Eyeing Money Movement Growth “We have an opportunity to do better with our payments businesses,” Kedia said during the call. Money movement capabilities are critical to anchoring client relationships, and we are committed to building a vibrant payments franchise.” Within that segment, the company notched $925 billion in trailing 12 months payments volumes, representing a 4% compound annual growth rate through the past two years. Payments-related average loans were 6.1% higher, compounded, through the same time frame, to $42 billion. “We have a greater focus on the affluent customer,” Kedia said during the call. The merchant payments services business will be transformed through “greater interconnectivity across the bank [and] a strategic shift to a tech-led operating model that is more consistent with the buying behavior of consumers today,” she said. “Tech-led represents over one-third of total merchant processing revenue, and most of our revenue generation is now concentrated in our five targeted verticals,” including retail, services, travel, entertainment and healthcare. Merchant processing fees were up 3.5% year over year. On a day of broad market losses, U.S. Bancorp shares slipped 2% Wednesday. Chief Financial Officer John Stern said during the call that the first-quarter net charge-off ratio of 0.59% improved one basis point linked quarter. The earnings supplementals indicated that overall 90-day delinquency rates were 0.2%. Within the card portfolio, delinquencies up to 90 days stood at 1.3% of card loans, down from 1.4%. Asked by analysts on the call about consumer spending trends, Kedia said: “We saw a modest pullback in consumer spending early in the year, and that was very weather-related. And it has stabilized… We are watching the downward trend in consumer sentiment but not seeing that in our spend patterns. Our mix does tilt toward the more affluent customer and toward non-discretionary everyday spend patterns. So that could be an explanation, but we are seeing steady consumer spend patterns in the first quarter.” Later, in discussing the merchant-facing business, Kedia said: “It’s an important organic growth opportunity … the [merchant payments services] business is about 5% of our overall bank, but a very important differentiator for us. It’s a very competitive space, and the reason to think about focusing on the five verticals is you can build stronger deck-led value propositions for each of the verticals… And the more we have focused our acquisition efforts and our organic growth efforts on those verticals, the deeper and the better execution we have. And today, about 90% of our revenue focus is on those verticals.” The post U.S. Bancorp Says Card Delinquencies Improve, Eyes ‘Money Movement’ Growth appeared first on PYMNTS.com.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "4617885568039811194",
        "title": "U.S. Bancorp targets 200+ basis points operating leverage in 2025 amid strategic expense management",
        "url": "https://seekingalpha.com/news/4431736-u-s-bancorp-targets-200-plus-basis-points-operating-leverage-in-2025-amid-strategic-expense",
        "site": "seekingalpha.com",
        "time": 1744821702000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-5962227880414911963",
        "title": "U.S. Bancorp Q1 earnings beat, helped by strong noninterest income",
        "url": "https://seekingalpha.com/news/4431565-us-bancorp-q1-earnings-beat-helped-by-strong-noninterest-income",
        "site": "seekingalpha.com",
        "time": 1744802925000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-6294186019964717034",
        "title": "Earnings Snapshot: U.S. Bancorp tops Q1 estimates, FY revenue outlook lags",
        "url": "https://seekingalpha.com/news/4431552-earnings-snapshot-us-bancorp-tops-q1-estimates-fy-revenue-outlook-lags",
        "site": "seekingalpha.com",
        "time": 1744802051000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-1387306226634432358",
        "title": "U.S. Bancorp Beats Analysts’ Estimates on Fee Income, Expenses",
        "url": "https://www.bloomberg.com/news/articles/2025-04-16/u-s-bancorp-beats-analysts-estimates-on-fee-income-expenses",
        "site": "bloomberg.com",
        "time": 1744801681000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "usb"
        ],
        "similar_stories": [
            "-5962227880414911963"
        ],
        "description": "U.S. Bancorp, the fifth-largest US bank, beat analysts’ estimates on one of the revenue metrics key to Chief Executive Officer Gunjan Kedia’s plan to boost profitability. A US Bank branch in Walnut Creek, California.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-8108695709623711444",
        "title": "Big Banks Brace For Stressful Times",
        "url": "https://www.bloomberg.com/news/videos/2025-04-15/big-banks-brace-for-stressful-times-video",
        "site": "bloomberg.com",
        "time": 1744726519000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "usb"
        ],
        "description": "Bank of America posted record trading revenue in the first quarter and Citigroup's revenue helping it get closer to Jane Fraser's profitability target. RBC Capital Markets Head of U.S. Bank Equity Strategy Gerard Cassidy joined Bloomberg Open Interest to talk about how banks are bracing for higher unemployment and consumer credit losses. (Source: Bloomberg)",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-7155419613959115538",
        "title": "U.S. Bank’s chief economist on the Fed, tariffs and more — join the discussion",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=90b22ad2-0b43-4559-b7dc-f6ac17b43ffe&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1744640460000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-4499354577540458793",
        "title": "US Bank Debuts Business-Focused Checking and Spend Management Tools",
        "url": "https://www.pymnts.com/spend-management/2025/us-bank-debuts-business-focused-checking-and-spend-management-tools/",
        "site": "pymnts.com",
        "time": 1744626673000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "usb"
        ],
        "description": "U.S. Bank has introduced an all-in-one checking account combined with payments acceptance capabilities for small businesses. U.S. Bank Business Essentials, announced Monday (April 14), lets businesses accept card payments with free same-day access to their funds and a free mobile card reader. The bank said it introduced Business Essentials in response to the needs and […] The post US Bank Debuts Business-Focused Checking and Spend Management Tools appeared first on PYMNTS.com. U.S. Bank has introduced an all-in-one checking account combined with payments acceptance capabilities for small businesses. U.S. Bank Business Essentials, announced Monday (April 14), lets businesses accept card payments with free same-day access to their funds and a free mobile card reader. The bank said it introduced Business Essentials in response to the needs and demands of small business clients, who are seeking service providers who can bundle their digital banking, payments, and operations tools. “With Business Essentials, we are making it easier for small business owners to manage their business,” Shruti Patel, chief product officer for the business banking segment at U.S. Bank, said in a news release provided to PYMNTS. “We are bringing multiple capabilities together — a best-in-class checking account with payments and differentiated easy-to-use software — in a single integrated interface.” Also Monday, the bank debuted a spend management platform to help businesses track and control card-based spending. This platform is being rolled out across U.S. Bank’s business banking credit card portfolios, giving business owners an alternative to using multiple tools. “It’s an additive capability on our credit cards that provides our cardholders with the convenience of monitoring, controlling and tracking business spending — while continuing to enjoy the great rewards and benefits already associated with their business credit cards,” said Courtney Kelso, head of the bank’s consumer/small business segment. “With Spend Management, those same cards are an even more enriching tool for operating a business.” These new product launches are happening at a time when small and medium-sized businesses (SMBs) are facing increasing financial pressures. One out of every two of these businesses in the U.S. now “rely on their day-to-day sales just to keep the lights on,” PYMNTS wrote last week. “Nearly 1 in 5 are pessimistic about their odds of survival over the next two years. Almost 7% think they might not make it.” Only 28% of SMBs have business cards, and of that group, 64% of businesses with access to any form of financing turn to their corporate cards to withdraw cash for operations. Although credit cards potentially carry high interest rates, they “offer a quick and relatively easy way to access funds,” PYMNTS wrote. “At the same time, 4 in 10 businesses with access to financing also rely on their owners’ personal credit cards,” blurring the lines between personal and business finances and potentially putting both at risk. The post US Bank Debuts Business-Focused Checking and Spend Management Tools appeared first on PYMNTS.com.",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "8453799651763774537",
        "title": "U.S. Bancorp upgraded at Wolfe Research on valuation, new CEO's efforts",
        "url": "https://seekingalpha.com/news/4428419-us-bancorp-upgraded-at-wolfe-research-on-valuation-new-ceos-efforts",
        "site": "seekingalpha.com",
        "time": 1743687354000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "3183454350595010211",
        "title": "U.S. Bancorp downgraded to Underweight at J.P. Morgan amid macro uncertainty",
        "url": "https://seekingalpha.com/news/4428371-us-bancorp-downgraded-to-underweight-at-jp-morgan-amid-macro-uncertainty",
        "site": "seekingalpha.com",
        "time": 1743682085000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-8567596524717238863",
        "title": "U.S. Bancorp vice chair believed to be on board plane that crashed",
        "url": "https://seekingalpha.com/news/4426827-us-bancorp-vice-chair-believed-to-be-on-board-plane-that-crashed",
        "site": "seekingalpha.com",
        "time": 1743421728000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-1929366781823731945",
        "title": "Plane Registered to U.S. Bank’s Vice Chair Crashed Saturday",
        "url": "https://www.bloomberg.com/news/articles/2025-03-30/plane-registered-to-u-s-bank-s-vice-chair-crashed-saturday",
        "site": "bloomberg.com",
        "time": 1743365276000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "usb"
        ],
        "similar_stories": [
            "1246346243163718701",
            "-8567596524717238863"
        ],
        "description": "A plane registered to U.S. Bank Vice Chair Terry Dolan crashed over the weekend in Minnesota, according to a statement Sunday from the Minneapolis-based lender. Fire Engine at Emergency Scene Photographer: Dan Reynolds Photography/Moment RF",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "25656616624124087",
        "title": "Can’t Beat This: New U.S. Bank Shield Card Has A 24-Month 0% Intro APR, The Longest Available",
        "url": "https://www.forbes.com/advisor/credit-cards/u-s-bank-launches-a-24-month-0-apr-card/",
        "site": "forbes.com",
        "time": 1742329407000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "usb"
        ],
        "description": "Americans are holding a big, fat I.O.U. to credit card companies and a new card from U.S. Bank might help ease the financial strain. The no annual fee , which launched March 17, 2025, could be a life preserver for the debt-addled with its unmatched . No other card on the market currently offers a […] Americans are holding a big, fat I.O.U. to credit card companies and a new card from U.S. Bank might help ease the financial strain. The no annual fee U.S. Bank Shield Visa® Card*, which launched March 17, 2025, could be a life preserver for the debt-addled with its unmatched 0% intro APR on purchases and balance transfers for 24 billing cycles, then a standard 17.74% to 28.74% variable APR applies. A balance transfer fee of 5% ($5 minimum) applies and balances transferred must be completed within 60 days from account opening. No other card on the market currently offers a low intro period as long as the U.S. Bank Shield Card. “We are excited to introduce our latest credit card solution for consumers looking for a 0% intro APR offer and protections for the unexpected. The U.S. Bank Shield Visa Card offers the best and longest introductory APR offer on purchases and balance transfers in today’s marketplace” says Steve Mattics, head of credit card and debit products at U.S. Bank to Forbes Advisor. Best 0% APR Credit Cards Of 2025 Learn More",
        "tickers": [
            "usb"
        ]
    },
    {
        "id": "-1350789379681837265",
        "title": "U.S. Bancorp declares $0.50 dividend",
        "url": "https://seekingalpha.com/news/4419617-u-s-bancorp-declares-0_50-dividend",
        "site": "seekingalpha.com",
        "time": 1741728077000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "usb"
        ],
        "tickers": [
            "usb"
        ]
    }
]