[
    {
        "id": "-2079296896856869577",
        "title": "Oracle says xAI's models are now available on Oracle Cloud Infrastructure",
        "url": "https://seekingalpha.com/news/4458797-oracle-says-xais-models-are-now-available-on-oracle-cloud-infrastructure",
        "site": "seekingalpha.com",
        "time": 1750162627000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "9112548628635147995",
        "title": "Trump indicates he may ‘probably’ push back TikTok deadline again | $BDNCE $ORCL $BX $DELL",
        "url": "https://seekingalpha.com/news/4458719-trump-indicates-he-may-probably-push-back-tiktok-deadline-again",
        "site": "seekingalpha.com",
        "time": 1750154815000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6433531104819977063",
        "title": "Oracle launches initiative to help smaller vendors sell tech to defense customers",
        "url": "https://seekingalpha.com/news/4458700-oracle-defense-ecosystem-smaller-vendors-defense-customers",
        "site": "seekingalpha.com",
        "time": 1750147813000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2664602976684545312",
        "title": "Top gainers & losers in tech sector this week: Oracle tops the chart, while Paycom lags",
        "url": "https://seekingalpha.com/news/4458120-top-gainers-losers-in-tech-sector-this-week-oracle-tops-the-chart-while-paycom-lags",
        "site": "seekingalpha.com",
        "time": 1750014300000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6498091270417764401",
        "title": "America250, the nonprofit organizing the US Semiquincentennial celebration, says it received sponsorship commitments from Oracle, Amazon, Coinbase, and Palantir (Meridith McGraw/Wall Street Journal)",
        "url": "http://www.techmeme.com/250615/p14#a250615p14",
        "site": "techmeme.com",
        "time": 1750001100000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Meridith McGraw / Wall Street Journal: America250, the nonprofit organizing the US Semiquincentennial celebration, says it received sponsorship commitments from Oracle, Amazon, Coinbase, and Palantir — Twenty two corporations and foundations are sponsoring the 250th Army Birthday Parade and Festival on the National Mall, according to the Army.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-603164997653166994",
        "title": "Stock Movers: Halliburton, Smuckers, Oracle (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-13/stock-movers-halliburton-smuckers-oracle-podcast",
        "site": "bloomberg.com",
        "time": 1749856881000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 5:06 Halliburton Co Photographer: Aaron M. Sprecher/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4174088033428614251",
        "title": "Oracle stock jumped 24% this week, its best performance since 2001, and is up 29% in 2025, vs. Nasdaq's 1%, after the company reported cloud momentum (Jordan Novet/CNBC)",
        "url": "http://www.techmeme.com/250613/p22#a250613p22",
        "site": "techmeme.com",
        "time": 1749852037000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Jordan Novet / CNBC: Oracle stock jumped 24% this week, its best performance since 2001, and is up 29% in 2025, vs. Nasdaq's 1%, after the company reported cloud momentum — Oracle shares enjoyed their best week since 2001 as Wall Street cheered a strong earnings report and bullish comments on the company's prospects in cloud computing.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "66279385644038088",
        "title": "Oracle appears to have named two new presidents",
        "url": "https://www.businessinsider.com/oracle-copresidents-larry-ellison-succession-plan-2025-6",
        "site": "businessinsider.com",
        "time": 1749847328000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Larry Ellison, the cofounder of Oracle.Justin Sullivan/Getty ImagesOracle appears to have appointed two new presidents.Internally, the people are considered part of a succession plan for Larry Ellison, one insider said.Oracle's share recently reached a record high, reflecting its renewed enterprise popularity.Oracle appears to have appointed two new presidents.The company filed two filings with the Securities and Exchange Commission listing cloud boss Clay Magouyrk and head of industries Michael Sicilia as \"president.\" The forms don't explicitly mention a promotion, but the executives haven't been previously listed as \"presidents,\" according to a person familiar with the matter.The executives, according to that person, are considered part of a succession plan for Larry Ellison. Ellison is Oracle's cofounder and former CEO who now serves as chief technology officer and executive chairman.Oracle CEO Safra Catz was previously a co-president along with the late Mark Hurd. They shared the title until both were promoted to co-CEOs in 2014 when Ellison stepped back. Hurd died in 2019, and while Ellison considered possible successors, he opted for Catz to remain the company's sole CEO.Magouyrk is a former Amazon software development engineer who joined Oracle as an individual contributor in 2014. He quickly impressed Ellison and Catz with his ability to deliver results quickly, leading to his rapid ascent through the ranks to preside over Oracle Cloud Infrastructure. His leadership style has at times been controversial.Sicilia is the executive vice president of Oracle Industries. He's the executive who has been leading Oracle's takeover of Cerner.The executives will help lead Oracle as it gains traction in the cloud-computing market. Oracle shares hit a record high this week after beating analyst estimates and raising its revenue forecast.Piper Sandler analysts wrote in a note after the earnings release that the company \"has entered an entirely new wave of enterprise popularity that it has not seen since the Internet era in the late '90s.\"Oracle declined to comment on this report. Have a tip? Contact this reporter via email at astewart@businessinsider.com or Signal at +1-425-344-8242. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider Larry Ellison, the cofounder of Oracle.Justin Sullivan/Getty ImagesOracle appears to have appointed two new presidents.Internally, the people are considered part of a succession plan for Larry Ellison, one insider said.Oracle's share recently reached a record high, reflecting its renewed enterprise popularity.Oracle appears to have appointed two new presidents.The company filed two filings with the Securities and Exchange Commission listing cloud boss Clay Magouyrk and head of industries Michael Sicilia as \"president.\" The forms don't explicitly mention a promotion, but the executives haven't been previously listed as \"presidents,\" according to a person familiar with the matter.The executives, according to that person, are considered part of a succession plan for Larry Ellison. Ellison is Oracle's cofounder and former CEO who now serves as chief technology officer and executive chairman.Oracle CEO Safra Catz was previously a co-president along with the late Mark Hurd. They shared the title until both were promoted to co-CEOs in 2014 when Ellison stepped back. Hurd died in 2019, and while Ellison considered possible successors, he opted for Catz to remain the company's sole CEO.Magouyrk is a former Amazon software development engineer who joined Oracle as an individual contributor in 2014. He quickly impressed Ellison and Catz with his ability to deliver results quickly, leading to his rapid ascent through the ranks to preside over Oracle Cloud Infrastructure. His leadership style has at times been controversial.Sicilia is the executive vice president of Oracle Industries. He's the executive who has been leading Oracle's takeover of Cerner.The executives will help lead Oracle as it gains traction in the cloud-computing market. Oracle shares hit a record high this week after beating analyst estimates and raising its revenue forecast.Piper Sandler analysts wrote in a note after the earnings release that the company \"has entered an entirely new wave of enterprise popularity that it has not seen since the Internet era in the late '90s.\"Oracle declined to comment on this report. Have a tip? Contact this reporter via email at astewart@businessinsider.com or Signal at +1-425-344-8242. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4019940526945775231",
        "title": "Oracle's stock on pace for best week since 2001 on cloud momentum",
        "url": "https://www.cnbc.com/2025/06/13/oracles-stock-on-pace-for-best-week-since-2001-on-cloud-momentum.html",
        "site": "cnbc.com",
        "time": 1749843375000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle investors haven't had a week this good since April 2001, after the stock had collapsed in the dot-com crash.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3877280297716378749",
        "title": "SA analyst upgrades/downgrades: AAPL, ORCL, OKE, LRLCF",
        "url": "https://seekingalpha.com/news/4458019-sa-analyst-upgradesdowngrades-aapl-orcl-oke-lrlcf",
        "site": "seekingalpha.com",
        "time": 1749839214000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-870930862341366490",
        "title": "Larry Ellison $40 Billion Richer — Surpassing Bezos And Zuckerberg — As Oracle Stock Mounts Big Rally",
        "url": "https://www.forbes.com/sites/dereksaul/2025/06/13/larry-ellison-40-billion-richer---surpassing-bezos-and-zuckerberg---as-oracle-stock-mounts-big-rally/",
        "site": "forbes.com",
        "time": 1749838844000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle stock's 20% post-earnings explosion minted its chairman a spot among the world's two richest people. Oracle stock's 20% post-earnings explosion minted its chairman a spot among the world's two richest people.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "9188200612863800081",
        "title": "Stock Movers: Lockheed Martin, Oracle, Visa (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-13/stock-movers-lockheed-martin-oracle-visa-podcast",
        "site": "bloomberg.com",
        "time": 1749828981000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 3:23 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8909178224466887663",
        "title": "Oracle Jet review: The best Breville espresso machine our coffee expert has ever tested",
        "url": "https://www.businessinsider.com/guides/kitchen/breville-oracle-jet-espresso-machine-review",
        "site": "businessinsider.com",
        "time": 1749825005000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The Breville Oracle Jet streamlines brewing and offers plenty of customizations, making espresso approachable for beginners — and fun for pros, too When you buy through our links, Business Insider may earn an affiliate commission. Learn more The Oracle Jet is Breville's most advanced espresso machine, and retails for almost $2,000.Abby Hersh/Business InsiderThere's nothing quite as satisfying as enjoying a homemade shot of espresso, but pulling a shot can be a daunting feat if you don't know where to start. It can take hours to research the best espresso machine and learn how to dial in your beans. If you just want to enjoy quality espresso at home without plunging down this rabbit hole, then the Breville Oracle Jet is a great option.With a built-in grinder and automatic dosing, tamping, and steaming, the Oracle Jet comes with everything you need to brew your favorite espresso-based drink at home. It also has a nifty digital user interface that walks you through the entire brewing process, from helping you tune the grinder settings for the perfect shot to steaming milk for your cappuccino or latte.As someone who's worked many busy café shifts behind the bar and has a manual espresso setup at home, I was a little skeptical about testing out a machine that automates so much of the process. But, I was pleasantly surprised by how easy and fun the Oracle was to use, and by the quality of espresso it produced. The Oracle Jet provides a great set of automatic features that make the brewing process approachable for absolute beginners, without taking away the hands-on aspect that makes brewing at home so satisfying.Getting startedSetting up the Breville Oracle is quick and simple, and there's a thorough walk-through mode that takes you through each step. Just install the water filter in the water tank and fill it up, run a quick initial rinse cycle, and place the bean hopper on top of the machine.The Oracle Jet is pretty much ready to go out of the box and comes with a dozen accessories to make the most of your machine.Abby Hersh/Business InsiderIt even comes with a testing strip so you can calibrate your water hardness. This is used to determine how often the machine prompts you to run a descale cycle and change the water filter, which is essential maintenance for your machine's longevity.Brewing espressoBrewing a shot of espresso with the Oracle is as easy as it gets without going fully automatic. You don't even need to worry about how much coffee to grind — the Oracle will dose it for you.The Oracle Jet automatically doses, grinds, and tamps the coffee beans for you.Abby Hersh/Business InsiderFirst, you insert the portafilter into the grinder. Once you lock it into place, it will grind the coffee and automatically tamp the grounds down. Then, all you have to do is unlock the portafilter from the grinder, lock it into the grouphead, and press a button to brew your shot. The brewing automatically stops once a set amount of water has passed. There are preset single- and double-shot options, but you can also adjust how much water you want in your shot if you prefer.Dialing inThe only real adjustment you can make on the Breville to dial in your brew is to adjust the grind size.Abby Hersh/Business InsiderAs mentioned above, brewing a shot on the Oracle is easy. But really, brewing a shot on any machine is easy, and the general workflow is pretty standard: you grind the coffee into the portafilter and pull the shot. The hard part is getting that shot of espresso to actually taste good. The process of adjusting your brewing parameters to achieve your ideal espresso shot is called \"dialing in,\" and this is probably the greatest learning curve when it comes to brewing espresso.You can picture water flowing through a jar of sand. It will pass quickly through coarse, rocky sand, and slowly through very fine sand. Similarly, if the water passes too quickly through the coffee grounds, then it won't have enough time to extract all the stuff that makes your espresso taste round and full-bodied, and it will end up tasting too sour. This is called under-extraction. Conversely, if the water passes through too slowly, then too much coffee will get extracted, resulting in a shot that is bitter. This is called over-extraction. Dialing in is the process of finding the elusive sweet spot between under- and over-extraction and the focus of many espresso aficionado's obsession (including mine).I was pleasantly surprised by how simple and straightforward the Oracle makes this process. It gives a digestible overview of the concepts of coffee extraction and helps you adjust your grind setting to get within the recommended brewing range. Compare that to dialing in on a manual setup, where you'd have to adjust the grind setting (how fine or coarse you go), coffee dose (how much ground coffee goes into your espresso puck), and the amount of water used to brew the shot. While the Oracle removes much control from the dialing-in process, it also greatly simplifies it, and it's certainly good enough to achieve a solid shot of espresso.ConsistencyTo see how consistent the Oracle is, I measured results across 10 double shots brewed on the same grind setting using medium-roasted espresso beans. Across my tests, the grinder dosed out about 20-22 grams of coffee, the shots took 24-29 seconds to brew, and they yielded 45-50 grams of coffee. All in all, I think this level of consistency is great considering that the dosing process is completely automatic. The difference between shots is pretty negligible, especially if you're adding milk to your espresso.Cold extractionThe Oracle Jet makes ready-to-drink cold brew — you need only add ice.Abby Hersh/Business InsiderThe Oracle Jet offers several different espresso brewing methods — regular espresso, \"cold espresso,\" and \"cold brew.\" The espresso pucks are prepared the same way, but the cold extraction methods use room-temperature water. The cold espresso takes about 1 minute and 10 seconds to brew, and yields about the same amount of water as a hot shot of espresso. The cold brew takes around 2.5 to 3 minutes and yields enough water for a ready-to-drink glass of cold brew — you only need to add ice.I didn't love how the cold espresso turned out. It was really acidic and didn't have much body to balance it out. However, Breville's website recommends this feature for darker roasted coffees, which have less acidity to begin with, and I used a medium roast, so this may explain my results.I was pleasantly surprised with the Oracle's cold brew though. It was crisp, bright, and much less bitter than a regular espresso. It didn't have nearly as much smoothness and body as traditional cold brew, which is brewed with coarsely ground coffee over 12 to 24 hours, but it still produced a refreshing drink that I'd happily enjoy in a pinch. Plus, I think it's an innovative way to make use of the dynamic heating capabilities of the thermojet heating system.AutoMilQ milk steamingThe Oracle Jet has several different settings for making steamed milk and adjusts accordingly depending on which dairy type you select.Abby Hersh/Business InsiderThe Oracle Jet comes with an automatic milk steaming function, achieving the ideal temperature and foam level based on your selected drink and dairy option. That's right — the milk steaming even accounts for dairy alternatives. You can choose from traditional dairy, oat milk, almond milk, or soy milk, and the steamer will adjust the end temperature accordingly.If you're going for latte art, you'll want to give your steamed milk a good couple of swirls in the pitcher just to help mix the foam in with the rest of your milk, which is essential for pouring art. You can also bypass the automatic milk steaming and pull the wand outward to steam manually. Having more control over the angle of the pitcher and steam wand will allow you to better aerate the milk, resulting in a more even microfoam.Overall experienceThe Oracle Jet makes it easy for anyone to quickly get started pulling quality espresso shots and making cafe-style drinks.Abby Hersh/Business InsiderOne thing that really struck me when using this machine is the well-thought-out design and ease of use. The digital interface is easy to navigate, with a slick touchscreen that intuitively breaks down the coffee brewing process. As someone who used to work as a front-end software developer, I have a soft spot for really well-designed user interfaces, and navigating the features of this machine was seamless and intuitive. The machine even has a dark mode — so slick!There are plenty of other small details that make it really easy to use, like a hatch to easily refill the water tank from the front of the machine and a wheel that helps rotate the machine so you can easily turn it around when you need to remove the water tank. I really enjoyed the Oracle's smooth combination of tech and coffee brewing.Cons to considerIf you're like me and you want full control over your dialing-in process, you'll definitely hit a wall with the automatic dosing feature. There's no way to dose a specific weight of coffee. Instead, the Breville's built-in grinder fills the portafilter basket until a sensor detects that the grounds have reached a set height. My test doses varied by 1-3 grams, which is pretty consistent, especially when adding milk. However, controlling the exact weight of coffee in the basket is important for a precise dialing-in process, and these small differences are more pronounced if you're brewing lighter roasted coffees (as I like to do). If this is important to you, it's best to go for a setup with a separate grinder so you can control how much coffee you're grinding. You can check out our Breville Bambino review if you're interested in a Breville stand-alone machine.Also, because the auto dosing is based on reading the height of ground coffee, and lighter roasted coffees have higher bean density, significantly more coffee ends up",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8085530547963692865",
        "title": "Micron Plans $200 Billion US Chip Spend, Chime IPO | Bloomberg Tech 6/12/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/bloomberg-tech-6-12-2025-video",
        "site": "bloomberg.com",
        "time": 1749821277000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Bloomberg’s Caroline Hyde and Ed Ludlow discuss Micron’s plans to spend $200 billion on U.S. chip manufacturing and R&D. Plus, Chime CEO Chris Britt discusses the company’s growth strategy as the company goes public. And Oracle’s earnings impress investors with its rising cloud sales. (Source: Bloomberg)",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1041565295607467100",
        "title": "Dividend Roundup: Oracle, Target, Microsoft, Southwest Airlines, and more",
        "url": "https://seekingalpha.com/news/4457919-dividend-roundup-oracle-target-microsoft-southwest-airlines-and-more",
        "site": "seekingalpha.com",
        "time": 1749816425000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1545229116317476009",
        "title": "Oracle stock surge bumps Larry Ellison to world's second richest person",
        "url": "https://seekingalpha.com/news/4457812-oracle-stock-surge-bumps-larry-ellison-to-worlds-second-richest-person",
        "site": "seekingalpha.com",
        "time": 1749768382000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8881187589865451668",
        "title": "Stock Movers: Oracle, Boeing, GameStop (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-12/stock-movers-oracle-boeing-gamestop-podcast",
        "site": "bloomberg.com",
        "time": 1749762996000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 2:50 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "990759737546718823",
        "title": "Oracle Earnings and Chip Demand",
        "url": "https://www.bloomberg.com/news/videos/2025-06-12/oracle-earnings-and-chip-demand-video",
        "site": "bloomberg.com",
        "time": 1749758715000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Chime CEO Chris Britt says the company has multiple ways to grow and is focused on the long term. Britt speaks with Caroline Hyde and Ed Ludlow ahead of he company's IPO on “Bloomberg Tech.” (Source: Bloomberg)",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-7460023545256668840",
        "title": "Stock Movers: GameStop, BioNTech, Oracle (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-12/stock-movers-gamestop-biontech-oracle-podcast",
        "site": "bloomberg.com",
        "time": 1749757992000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 5:31 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1428632759771212417",
        "title": "Oracle earnings lift ORCL stock price sky high as cloud infrastructure sales projected to grow by 70%",
        "url": "https://www.fastcompany.com/91351372/orcl-stock-price-oracle-earnings-q4-cloud-infrastructure-sales-revenue",
        "site": "fastcompany.com",
        "time": 1749754800000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-2079296896856869577",
            "1202896552284204828",
            "2647557577634175186"
        ],
        "description": "Oracle investors are on cloud nine today as the stock reached record heights. The company’s fourth quarter earnings results beat expectations yesterday and projected even more gains in cloud infrastructure. After rising nearly 8% in after-hours trading following the earnings release Wednesday evening, Oracle (ORCL) has continued to rise throughout the day on Thursday. The stock reached an all-time record of $202.04 at 12:30 p.m. Thursday, and has been steady since then. Oracle’s financial results for the fourth quarter showed $15.9 billion in total revenue, up 11% from the previous quarter. The ​​net income for the quarter was $3.4 billion, with earnings per share of $1.19. Growth in Oracle’s cloud infrastructure revenue was particularly strong, jumping 52%, and it shows no signs of slowing in fiscal year 2026. The company’s cloud infrastructure sales are projected to grow over 70% next fiscal year. Today, Oracle got the ball rolling by announcing a multi-year cloud infrastructure contract with Seekr, an artificial intelligence company. “FY25 was a very good year—but we believe FY26 will be even better as our revenue growth rates will be dramatically higher,” Oracle CEO Safra Catz said on the company’s Q4 earnings call. “Oracle is well on its way to being not only the world’s largest cloud application company—but also one of the world’s largest cloud infrastructure companies.” These powerful growth projections have also helped propel Oracle stock upward today, helping to boost the big tech sector and the S&P 500 along with it. Oracle has a market capitalization of $563 billion as of midday Thursday.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6781790673088810521",
        "title": "Oracle Delivers Bullish Outlook | Open Interest 6/12/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-06-12/open-interest-6-12-2025-video",
        "site": "bloomberg.com",
        "time": 1749750759000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Get a jump start on the US trading day with Matt Miller, Katie Greifeld and Sonali Basak on \"Bloomberg Open Interest.\" Oracle soars to a record high after the software maker projected a 70% gain in cloud infrastructure sales this fiscal year, giving a bullish outlook for the closely watched business. President Trump plans to set unilateral tariff rates within the next two weeks, ahead of an earlier deadline. And we get updates on Boeing's worst accident involving its most advanced twin-aisle aircraft. Plus, is the nuclear energy renaissance upon us? We'll get insight from the CEO of Nano Nuclear. (Source: Bloomberg)",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4521126637663942845",
        "title": "Oracle shares pop 15% to record high on earnings beat, cloud optimism",
        "url": "https://www.cnbc.com/2025/06/12/oracle-shares-pop-15percent-to-record-high-on-earnings-beat-cloud-optimism.html",
        "site": "cnbc.com",
        "time": 1749746595000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-8571946065586895601",
            "1188962356950894608"
        ],
        "description": "Oracle's outlook was better than expected, leading many analysts to lift their price targets on the stock.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6956913547099230692",
        "title": "Oracle’s stock is having its best day in more than 3 years. Why Wall Street is so upbeat.",
        "url": "https://www.marketwatch.com/story/oracles-stock-is-having-its-best-day-in-more-than-3-years-why-wall-street-is-so-upbeat-72296da6?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1749745260000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "6734297198923437865"
        ],
        "description": "Analysts say Oracle’s spending forecast and business commitments suggest more momentum ahead.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6575710041737491865",
        "title": "Stock Movers: Boeing, Oracle, Oxford (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-12/stock-movers-boeing-oracle-oxford-podcast",
        "site": "bloomberg.com",
        "time": 1749739173000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 4:03 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7818381534693248077",
        "title": "Oracle Stock Jumps. Earnings Were Strong but This Was ‘Stunning’, Says Analyst.",
        "url": "https://www.barrons.com/articles/oracle-stock-price-earnings-target-71523593?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749736020000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3526867057222071730",
        "title": "These Stocks Are Moving the Most Today: Boeing, GE, Oracle, GameStop, CureVac, Oklo, Oxford, and More",
        "url": "https://www.barrons.com/articles/stock-movers-e025dc18?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749735780000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2324050986825675688",
        "title": "Stock Movers: Boeing, GE, Oracle (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-12/stock-movers-boeing-ge-oracle-podcast",
        "site": "bloomberg.com",
        "time": 1749734971000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 3:50 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3853126660882172975",
        "title": "Analysts eye bright FY26 outlook for Oracle on cloud, RPO growth",
        "url": "https://seekingalpha.com/news/4457586-analysts-eye-bright-fy26-outlook-for-oracle-on-cloud-rpo-growth",
        "site": "seekingalpha.com",
        "time": 1749733959000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5015970708448478218",
        "title": "Oracle to Spend Billions Staking AI Claim. There’s 1 Key Risk.",
        "url": "https://www.barrons.com/articles/oracle-stock-earnings-ai-8df5cb1a?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749733860000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7587152526580702657",
        "title": "10 things to watch in the stock market Thursday including inflation data and Oracle",
        "url": "https://www.cnbc.com/2025/06/12/10-things-to-watch-in-the-stock-market-thursday-including-inflation-data-and-oracle.html",
        "site": "cnbc.com",
        "time": 1749733311000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Wall Street is on pace for a lower open Thursday.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-2233220466586747153",
        "title": "Stocks making the biggest premarket moves: Boeing, Oracle, GameStop, Voyager Technologies and more",
        "url": "https://www.cnbc.com/2025/06/12/stocks-making-the-biggest-premarket-moves-.html",
        "site": "cnbc.com",
        "time": 1749730160000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "These are some of the stocks posting the largest moves in premarket trading.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7894881185696279904",
        "title": "Biggest stock movers Thursday: ORCL, OKLO, and more",
        "url": "https://seekingalpha.com/news/4457498-biggest-stock-movers-thursday-orcl-oklo-and-more",
        "site": "seekingalpha.com",
        "time": 1749718843000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6050356038833721176",
        "title": "Is Oracle Stock A Buy At $190?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/12/is-oracle-stock-a-buy-at-190/",
        "site": "forbes.com",
        "time": 1749717255000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "While Oracle's Q4 results were undoubtedly strong, the critical question for investors is whether ORCL stock is a buy at its current price. While Oracle's Q4 results were undoubtedly strong, the critical question for investors is whether ORCL stock is a buy at its current price.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-2292265284998437616",
        "title": "Oracle in charts: Cloud services grow 27% Y/Y, while license support rev remain tepid in FQ4",
        "url": "https://seekingalpha.com/news/4457103-oracle-in-charts-cloud-services-grow-27-yy-while-license-support-rev-remain-tepid-in-fq4",
        "site": "seekingalpha.com",
        "time": 1749706922000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1202896552284204828",
        "title": "Oracle targets over $67B revenue and 70% cloud infrastructure growth in FY26 while expanding global data center footprint",
        "url": "https://seekingalpha.com/news/4457476-oracle-targets-over-67b-revenue-and-70-percent-cloud-infrastructure-growth-in-fy26-while",
        "site": "seekingalpha.com",
        "time": 1749705376000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8001059634497052498",
        "title": "Oracle Q4 Earnings: Ellison Criticizes Salesforce Over Product Integration",
        "url": "https://www.crn.com/news/ai/2025/oracle-q4-earnings-ellison-criticizes-salesforce-over-product-integration",
        "site": "crn.com",
        "time": 1749686100000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle CTO Larry Ellison appears to criticize Salesforce and CEO Marc Benioff over which AI company is better positioned to make insights out of enterprise data during Oracle’s Q4 2025 earnings call.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4646706208151512513",
        "title": "Trump Latest China Deal, Oracle Sees Higher Sales, More",
        "url": "https://www.bloomberg.com/news/audio/2025-06-11/trump-latest-china-deal-oracle-sees-higher-sales-more",
        "site": "bloomberg.com",
        "time": 1749683838000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 5:36 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-7475209089957831287",
        "title": "Trump Touts China \"Done Deal\", Oracle Sales Beat Estimates, More",
        "url": "https://www.bloomberg.com/news/audio/2025-06-11/trump-touts-china-done-deal-oracle-sales-beat-estimates-more",
        "site": "bloomberg.com",
        "time": 1749679434000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-4646706208151512513"
        ],
        "description": "Source: Bloomberg, 5:49 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1721125697715958015",
        "title": "Stock Movers: Oracle, Lockheed Martin, Starbucks (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-11/stock-movers-oracle-lockheed-martin-starbucks-podcast",
        "site": "bloomberg.com",
        "time": 1749677110000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-603164997653166994",
            "9188200612863800081",
            "8881187589865451668",
            "-7460023545256668840",
            "316234389615377663",
            "-6575710041737491865",
            "2324050986825675688",
            "-2233220466586747153"
        ],
        "description": "Source: Bloomberg, 5:14 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4566269789437673475",
        "title": "Oracle Q4: revenue up 11% YoY to $15.9B, vs. $15.59B est., cloud revenue up 27% YoY, signals strong cloud infrastructure revenue growth; ORCL up 6%+ after hours (Jordan Novet/CNBC)",
        "url": "http://www.techmeme.com/250611/p39#a250611p39",
        "site": "techmeme.com",
        "time": 1749674402000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Jordan Novet / CNBC: Oracle Q4: revenue up 11% YoY to $15.9B, vs. $15.59B est., cloud revenue up 27% YoY, signals strong cloud infrastructure revenue growth; ORCL up 6%+ after hours — Oracle shares rose about 8% in extended trading on Wednesday after the software maker reported results that exceeded Wall Street estimates …",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8732522705603374827",
        "title": "Oracle shares jump after upbeat forecast for cloud division",
        "url": "https://www.ft.com/content/dadc5cbe-67a5-44c9-9b7b-5c23bf4e77ee",
        "site": "ft.com",
        "time": 1749674327000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Chief says cloud infrastructure business was expected to grow more than 70% in the next fiscal year",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6357413225579959612",
        "title": "Oracle Projects Strong Annual Cloud Growth, Boosting Momentum",
        "url": "https://www.bloomberg.com/news/articles/2025-06-11/oracle-projects-strong-annual-cloud-growth-boosting-momentum",
        "site": "bloomberg.com",
        "time": 1749673878000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "4174088033428614251",
            "4019940526945775231",
            "-4566269789437673475"
        ],
        "description": "Oracle Corp. projected cloud infrastructure sales will jump more than 70% in the fiscal year that began this month, boosting investor enthusiasm for the closely watched business. The Oracle offices in Redwood City, California.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6916121923291297809",
        "title": "Oracle shares climb 8% as earnings, revenue top estimates",
        "url": "https://www.cnbc.com/2025/06/11/oracle-orcl-q4-earnings-report-2025.html",
        "site": "cnbc.com",
        "time": 1749673810000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-5681101337118200343"
        ],
        "description": "Oracle reported better-than-expected results for the latest quarter on Wednesday.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2647557577634175186",
        "title": "Earnings Snapshot: Oracle CEO sees cloud growth rate rising 40% in FY26",
        "url": "https://seekingalpha.com/news/4457422-earnings-snapshot-oracle-ceo-sees-cloud-growth-rate-rising-40-in-fy26",
        "site": "seekingalpha.com",
        "time": 1749673805000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2582760447144887355",
        "title": "Oracle pops as Q4 results top estimates, offers outlook for fiscal 2026",
        "url": "https://seekingalpha.com/news/4457309-oracle-pops-as-q4-results-top-estimates-offers-outlook-for-fiscal-2026",
        "site": "seekingalpha.com",
        "time": 1749672712000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-9024085464907239929"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6735650629305971956",
        "title": "Oracle Non-GAAP EPS of $1.70 beats by $0.06, revenue of $15.9B beats by $310M",
        "url": "https://seekingalpha.com/news/4457390-oracle-non-gaap-eps-of-1_70-beats-by-0_06-revenue-of-15_9b-beats-by-310m",
        "site": "seekingalpha.com",
        "time": 1749672368000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4095210497944949356",
        "title": "4 stocks to watch on Wednesday: ORCL, CHWY, SFIX and LMT",
        "url": "https://seekingalpha.com/news/4457233-4-stocks-to-watch-on-wednesday-orcl-chwy-sfix-and-lmt",
        "site": "seekingalpha.com",
        "time": 1749648187000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1398626800818229624",
        "title": "These Stocks Are Moving the Most Today: GitLab, Tesla, Nucor, GameStop, Chewy, SailPoint, Oracle, and More",
        "url": "https://www.barrons.com/articles/stock-movers-c1e7afab?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749643440000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "293430050044668710",
        "title": "Inflation Data, Bond Auctions, Oracle Earnings: Still to Come This Week",
        "url": "https://www.wsj.com/livecoverage/stock-market-cpi-inflation-tariffs-06-11-2025/card/inflation-data-bond-auctions-oracle-earnings-still-to-come-this-week-1O9xsiGpsoGKHiuAyqYW?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1749630666000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6049759062701732052",
        "title": "Oracle Q4 Preview: All eyes on cloud growth, AI push",
        "url": "https://seekingalpha.com/news/4456997-oracle-q4-preview-all-eyes-on-cloud-growth-ai-push",
        "site": "seekingalpha.com",
        "time": 1749585345000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8210559194338380188",
        "title": "Should You Sell Oracle Stock Ahead Of Its Upcoming Earnings?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/09/should-you-sell-oracle-stock-ahead-of-its-upcoming-earnings/",
        "site": "forbes.com",
        "time": 1749459652000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-5075229060434306053",
            "-5379217077561574207"
        ],
        "description": "In the last five years, the stock has declined in 60% of occurrences, with a median drop of 4.4% and a maximum one-day decrease of 13.5%. In the last five years, the stock has declined in 60% of occurrences, with a median drop of 4.4% and a maximum one-day decrease of 13.5%.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7278172901664285526",
        "title": "Apple WWDC; Inflation Data; GameStop Earnings, Oracle Stock, and More to Watch This Week",
        "url": "https://www.barrons.com/articles/apple-wwdc-inflation-data-gamestop-earnings-oracle-stock-1fa172ca?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749405600000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5721004978843165074",
        "title": "One of the first ‘liberation day’ losers reports earnings this week",
        "url": "https://www.marketwatch.com/story/one-of-the-first-liberation-day-losers-reports-earnings-this-week-db5d1566?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1749391200000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Earnings Watch: Results are due from RH, Victoria’s Secret, GameStop, Oracle and Adobe",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1772069674006189106",
        "title": "Earnings week ahead: ADBE, ORCL, GME, GTLB, CHWY, and more",
        "url": "https://seekingalpha.com/news/4456221-earnings-week-ahead-adbe-orcl-gme-gtlb-chwy-and-more",
        "site": "seekingalpha.com",
        "time": 1749384016000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2391090763316955538",
        "title": "Building More Scalable GenAI Applications for Startups and Developers",
        "url": "https://techcrunch.com/video/building-more-scalable-genai-applications-for-startups-and-developers/",
        "site": "techcrunch.com",
        "time": 1749234600000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "In this TechCrunch Sessions: AI event, Oracle shares a rundown of how MySQL HeatWave empowers you in building AI-based solutions in areas such as personal productivity, automating workflows for compliance, service, or support, and increasing efficiencies in healthcare, among others. By leveraging HeatWave’s built-in vector store, in-database LLMs, in-database machine learning capabilities, and massively parallel […]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7805715898237521096",
        "title": "Trump expected to extend TikTok ban....again | $BDNCE $ORCL $BX $DELL",
        "url": "https://seekingalpha.com/news/4456285-trump-expected-to-extend-tiktok-ban-again",
        "site": "seekingalpha.com",
        "time": 1749234301000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7443631721015294827",
        "title": "Nvidia, Oracle could see huge revenue boosts from Stargate data center in Texas: UBS",
        "url": "https://seekingalpha.com/news/4453905-nvidia-oracle-could-see-huge-revenue-boosts-from-stargate-data-center-in-texas-ubs",
        "site": "seekingalpha.com",
        "time": 1748692812000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6884669430213460272",
        "title": "ClickHouse, which offers an OLAP database management system, raised $350M led by Khosla, a source says at a $6.35B valuation; it is nearing an ARR of $100M (Bloomberg)",
        "url": "http://www.techmeme.com/250529/p29#a250529p29",
        "site": "techmeme.com",
        "time": 1748528401000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Bloomberg: ClickHouse, which offers an OLAP database management system, raised $350M led by Khosla, a source says at a $6.35B valuation; it is nearing an ARR of $100M — The would-be Snowflake competitor has raised $350 million from investors. … Khosla Ventures led the $350 million financing, ClickHouse plans to announce Thursday.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4008869514460849934",
        "title": "Oracle to spend $40bn on Nvidia chips for OpenAI Texas data center",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-to-spend-40bn-on-nvidia-chips-for-openai-texas-data-center/",
        "site": "datacenterdynamics.com",
        "time": 1748340903000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Will be housed in the Abilene, Texas, data center campus",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7467451284886789711",
        "title": "Oracle to Buy $40 Billion Worth of Nvidia Chips for First Stargate Data Center",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/oracle-to-buy-40-billion-worth-of-nvidia-chips-for-first-stargate-data-center/",
        "site": "pymnts.com",
        "time": 1748043861000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle will reportedly buy $40 billion worth of Nvidia’s chips to power the first Stargate project, a new data center in Abilene, Texas. The company will buy 400,000 of Nvidia’s latest “superchips” for training and running artificial intelligence (AI) systems, the GB200 chips, and lease the computing power they provide to OpenAI, the Financial Times (FT) reported Friday (May 23). The […] The post Oracle to Buy $40 Billion Worth of Nvidia Chips for First Stargate Data Center appeared first on PYMNTS.com. Oracle will reportedly buy $40 billion worth of Nvidia’s chips to power the first Stargate project, a new data center in Abilene, Texas. The company will buy 400,000 of Nvidia’s latest “superchips” for training and running artificial intelligence (AI) systems, the GB200 chips, and lease the computing power they provide to OpenAI, the Financial Times (FT) reported Friday (May 23). The data center is expected to be fully operational by the middle of 2026 and will be one of the largest data centers in the world, providing 1.2 gigawatts of power, according to the report. President Donald Trump announced Stargate in January, saying the up-to-$500 billion project aims to build big AI-focused data centers in the U.S., with the first 10 being in Texas. Oracle, OpenAI, SoftBank and MGX are equity partners in Stargate, while Oracle, Arm, Microsoft, Nvidia and OpenAI will be the project’s initial technology partners. It was reported Wednesday (May 21) that the Abilene data center had secured $11.6 billion in funding commitments and that the funding would expand the data center to eight buildings from two and bring the total amount secured for the project to $15 billion. AI data centers are needed because traditional data centers and power grids are struggling to accommodate the intense computational power, data storage and energy required by AI, PYMNTS reported in January. “AI data centers are fundamentally different because they require specialized hardware and infrastructure to handle the massive parallel processing needed for AI workloads,” Deborah Perry Piscione, co-founder of Work3 Institute, an AI and Web3 advisory firm, told PYMNTS in January. “Traditional data centers focus on storage and basic compute, while AI facilities need dense configurations of GPUs and AI accelerators, like Nvidia’s H100s, designed specifically for the complex matrix calculations that power AI models,” she added. In March, Elon Musk’s xAI and Nvidia joined the $30 billion AI Infrastructure Fund backed by BlackRock, Microsoft and MGX. The Fund’s ultimate goal is to raise up to $100 billion for AI development. Microsoft and BlackRock launched the fund last year, aiming to raise money to construct data centers and find sources of power for those facilities. The post Oracle to Buy $40 Billion Worth of Nvidia Chips for First Stargate Data Center appeared first on PYMNTS.com.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8237568453333323771",
        "title": "Oracle plans to spend $40B on Nvidia chips to power OpenAI data center: report",
        "url": "https://seekingalpha.com/news/4452129-oracle-plans-to-spend-40b-on-nvidia-chips-to-power-openai-data-center-report",
        "site": "seekingalpha.com",
        "time": 1748027291000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "915235676322689631",
        "title": "Sources: Oracle will buy ~400,000 Nvidia GB200 chips and lease them to OpenAI at its 1.2 gigawatts Texas data center, billed as the first US Stargate project (Financial Times)",
        "url": "http://www.techmeme.com/250523/p20#a250523p20",
        "site": "techmeme.com",
        "time": 1748024102000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Financial Times: Sources: Oracle will buy ~400,000 Nvidia GB200 chips and lease them to OpenAI at its 1.2 gigawatts Texas data center, billed as the first US Stargate project — The 1.2 gigawatts infrastructure project will be one of the largest in the world — Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1324963816237114084",
        "title": "Oracle to buy $40bn of Nvidia chips for OpenAI’s new US data centre",
        "url": "https://www.ft.com/content/a9cd130f-f6bf-4750-98cc-19d87394e657",
        "site": "ft.com",
        "time": 1748023289000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The 1.2 gigawatts infrastructure project will be one of the largest in the world",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2884803614172860499",
        "title": "OpenAI teams up with Cisco, Oracle to build UAE data center",
        "url": "https://techcrunch.com/2025/05/22/openai-teams-up-with-cisco-oracle-to-build-uae-data-center/",
        "site": "techcrunch.com",
        "time": 1747924851000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "As rumored, OpenAI is expanding its ambitious Stargate data center project to the Middle East. On Thursday, the company announced Stargate UAE, which will bring a 1GW data center cluster to Abu Dhabi. OpenAI expects 200MW will go live in 2026, developed with partners including G42, Oracle, Nvidia, Cisco, and SoftBank. In a blog post, […]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8417045816570388774",
        "title": "OpenAI, Oracle, NVIDIA, SoftBank Group and Cisco partner for Stargate UAE AI campus",
        "url": "https://www.cnbc.com/2025/05/22/stargate-uae-openai-nvidia-oracle.html",
        "site": "cnbc.com",
        "time": 1747922681000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Technology giants OpenAI, Oracle, Nvidia and Cisco are joining forces to help build a sweeping artificial intelligence campus in the United Arab Emirates.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4894511441037181313",
        "title": "Wix.com leads enterprise software stocks lower after earnings results | $WIX $MSFT $ORCL $CRM $ADBE",
        "url": "https://seekingalpha.com/news/4450993-wixcom-leads-enterprise-software-stocks-lower-after-earnings-results",
        "site": "seekingalpha.com",
        "time": 1747839321000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-7813527480188431338",
        "title": "Inside the first Stargate AI data center in Abilene, Texas: thousands working to build eight near-identical structures, startup Crusoe spending $12B, and more (Bloomberg)",
        "url": "http://www.techmeme.com/250520/p14#a250520p14",
        "site": "techmeme.com",
        "time": 1747744802000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Bloomberg: Inside the first Stargate AI data center in Abilene, Texas: thousands working to build eight near-identical structures, startup Crusoe spending $12B, and more — OpenAI, Oracle and SoftBank hope that the site in Texas is the first of many across the US. — Trucks carrying concrete …",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3966982478801080785",
        "title": "Inside the First Stargate AI Data Center",
        "url": "https://www.bloomberg.com/news/features/2025-05-20/inside-stargate-ai-data-center-from-openai-and-softbank",
        "site": "bloomberg.com",
        "time": 1747742428000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "OpenAI, Oracle and SoftBank hope that the site in Texas is the first of many across the US. The future home of the first Stargate site in Abilene, Texas.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1374156484610276454",
        "title": "Oracle, Cleveland Clinic And The UAE’s G42 Are Developing A Health AI Platform— Here’s What We Know",
        "url": "https://www.forbes.com/sites/saibala/2025/05/20/oracle-cleveland-clinic-and-the-uaes-g42-are-developing-a-health-ai-platform--heres-what-we-know/",
        "site": "forbes.com",
        "time": 1747742400000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Technology companies are rapidly investing in AI capabilities. Technology companies are rapidly investing in AI capabilities.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7479186021342614144",
        "title": "Oracle Cloud experiences outage in Europe, users say",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-cloud-experiences-outage-in-europe-users-say/",
        "site": "datacenterdynamics.com",
        "time": 1747737493000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "DownDetector suggests cloud issues lasted six hours",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6275229212667594098",
        "title": "Nvidia, Cisco, Oracle, and OpenAI join UAE-US AI Campus - report",
        "url": "https://www.datacenterdynamics.com/en/news/nvidia-cisco-oracle-and-openai-join-uae-us-ai-campus-report/",
        "site": "datacenterdynamics.com",
        "time": 1747668603000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "7443631721015294827",
            "204056095864389580",
            "4008869514460849934",
            "7467451284886789711",
            "8300384462118189269",
            "-8237568453333323771",
            "915235676322689631",
            "-1324963816237114084",
            "-2564592029142590610",
            "-3744939139222479336",
            "2884803614172860499",
            "-8417045816570388774"
        ],
        "description": "Looks to be home to an OpenAI Stargate deployment",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2094554751539271250",
        "title": "A Brexit Reset With Big Red Lines? Yes, Minister.",
        "url": "https://www.bloomberg.com/opinion/articles/2025-05-19/uk-eu-summit-brexit-reset-with-big-red-lines-yes-minister",
        "site": "bloomberg.com",
        "time": 1747623626000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The scars of the UK’s acrimonious EU split will take longer than one summit to heal. (From L) Poland's Prime Minister Donald Tusk, France's President Emmanuel Macron, Britain's Prime Minister Keir Starmer and Germany's Chancellor Friedrich Merz take part in a meeting during the European Political Community (EPC) summit, in Tirana on May 16, 2025. (Photo by Ludovic MARIN / AFP) (Photo by LUDOVIC MARIN/AFP via Getty Images)",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1465996394580768952",
        "title": "Hackers exploit VMware ESXi, Microsoft SharePoint zero-days at Pwn2Own",
        "url": "https://www.bleepingcomputer.com/news/security/hackers-exploit-vmware-esxi-microsoft-sharepoint-zero-days-at-pwn2own/",
        "site": "bleepingcomputer.com",
        "time": 1747409002000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "During the second day of Pwn2Own Berlin 2025, competitors earned $435,000 after exploiting zero-day bugs in multiple products, including Microsoft SharePoint, VMware ESXi, Oracle VirtualBox, Red Hat Enterprise Linux, and Mozilla Firefox. [...]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-999179504285559965",
        "title": "Oracle, Cleveland Clinic, and G42 ink pact to launch AI-based healthcare delivery platform",
        "url": "https://seekingalpha.com/news/4449524-oracle-cleveland-clinic-and-g42-ink-pact-to-launch-ai-based-healthcare-delivery-platform",
        "site": "seekingalpha.com",
        "time": 1747397010000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-511164807998382943",
        "title": "Windows 11 and Red Hat Linux hacked on first day of Pwn2Own",
        "url": "https://www.bleepingcomputer.com/news/security/windows-11-and-red-hat-linux-virtualbox-hacked-on-first-day-of-pwn2own/",
        "site": "bleepingcomputer.com",
        "time": 1747324124000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "On the first day of Pwn2Own Berlin 2025, security researchers were awarded $260,000 after successfully demonstrating zero-day exploits for Windows 11, Red Hat Linux, Docker Desktop, and Oracle VirtualBox. [...]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7688371292872146697",
        "title": "Oracle commits to invest $14bn in Saudi Arabia over next 10 years",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-commits-to-invest-14bn-in-saudi-arabia-over-next-10-years/",
        "site": "datacenterdynamics.com",
        "time": 1747218187000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Company has two cloud regions in the Kingdom",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1356976027837932098",
        "title": "Trump to Rewrite AI Chip Curbs Reviled by Nvidia and US Allies",
        "url": "https://www.bloomberg.com/news/articles/2025-05-13/trump-to-rewrite-ai-chip-curbs-reviled-by-nvidia-and-us-allies",
        "site": "bloomberg.com",
        "time": 1747161680000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The Trump administration plans to overhaul regulations on the export of semiconductors used in artificial intelligence, tossing out a Biden-era approach that had drawn strenuous objections from US allies and companies including Nvidia Corp. and Oracle Corp. Complete semiconductor chips.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4970653399085069748",
        "title": "SoftBank's $100B Stargate investment plans faces tariff hurdles - report | $SFTBY $ORCL",
        "url": "https://seekingalpha.com/news/4446615-softbanks-100b-stargate-investment-plans-faces-tariff-hurdles---report",
        "site": "seekingalpha.com",
        "time": 1747077652000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-5946528799667551106",
        "title": "Cloud Market Share Q1 2025: AWS Dips, Microsoft And Google Show Growth",
        "url": "https://www.crn.com/news/cloud/2025/cloud-market-share-q1-2025-aws-dips-microsoft-and-google-show-growth",
        "site": "crn.com",
        "time": 1746705600000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "AWS, Google, Oracle and Microsoft are the global cloud computing market share leaders for first quarter 2025 thanks to Azure, GCP and AWS Cloud.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4257127467076191007",
        "title": "Big Take: The ‘Oracle of Omaha’ Steps Aside (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-05/big-take-the-oracle-of-omaha-steps-aside-podcast",
        "site": "bloomberg.com",
        "time": 1746482252000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 16:19 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5600173610819390845",
        "title": "Buffett’s Successor Has an Oxy-Sized Hole to Dig Out Of",
        "url": "https://www.bloomberg.com/opinion/articles/2025-05-05/buffett-s-successor-has-an-oxy-sized-hole-to-dig-out-of",
        "site": "bloomberg.com",
        "time": 1746442827000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The Oracle’s faith in Occidental Petroleum hasn’t panned out. A shirt with images depicting Berkshire Hathaway CEO Warren Buffet for sale during a shareholders shopping day ahead of the Berkshire Hathaway annual shareholders meeting in Omaha, Nebraska, US, on Friday, May 2, 2025. Every year, thousands of Buffett enthusiasts descend on this Midwestern city to hear their idol share his views and investing philosophy.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-2925026104775264867",
        "title": "Nvidia, Oracle, Broadcom 'most at risk' if AI capex cycle slows down, Kolanovic warns",
        "url": "https://seekingalpha.com/news/4437690-nvidia-oracle-broadcom-most-at-risk-if-ai-capex-cycle-slows-down-kolanovic-warns",
        "site": "seekingalpha.com",
        "time": 1746014005000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7332335018263551665",
        "title": "Nvidia GB200 NVL72 now available via Oracle Cloud",
        "url": "https://www.datacenterdynamics.com/en/news/nvidia-gb200-nvl72-now-available-via-oracle-cloud/",
        "site": "datacenterdynamics.com",
        "time": 1745926203000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle deploys \"thousands\" of Blackwell GPUs",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6294612583986504703",
        "title": "Oracle engineers caused days-long software outage at U.S. hospitals",
        "url": "https://www.cnbc.com/2025/04/28/oracle-engineers-caused-days-long-software-outage-at-us-hospitals.html",
        "site": "cnbc.com",
        "time": 1745880770000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle engineers triggered a five-day outage at several Community Health Systems hospitals, causing the facilities to temporarily return to paper-based records.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-9219203735577559567",
        "title": "Sabre to Sell Hotel Reservations Platform for $1.1 Billion",
        "url": "https://skift.com/2025/04/28/sabre-to-sell-hotel-reservations-platform-for-1-1-billion/",
        "site": "skift.com",
        "time": 1745850150000,
        "favicon_url": "https://static.tickertick.com/website_icons/skift.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Sabre's sale of its hotel reservations tech should help the travel tech company focus on its core airline business. It's notable that a PE firm rather than a rival player, such as Oracle or Cendyn, chose to buy. -Sean O'Neill Skift Take: Sabre's sale of its hotel reservations tech should help the travel tech company focus on its core airline business. It's notable that a PE firm rather than a rival player, such as Oracle or Cendyn, chose to buy. -Sean O'NeillRead the Complete Story On Skift",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1922466686467372984",
        "title": "A look at Microsoft freezing ~1.5GW of data centers set for 2025 and 2026; Microsoft has walked away from significantly more than 2GW of non-binding contracts (SemiAnalysis)",
        "url": "http://www.techmeme.com/250428/p8#a250428p8",
        "site": "techmeme.com",
        "time": 1745841654000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "SemiAnalysis: A look at Microsoft freezing ~1.5GW of data centers set for 2025 and 2026; Microsoft has walked away from significantly more than 2GW of non-binding contracts — OpenAI Shift, Oracle & Stargate Acceleration, Hyperscale Capex Implications, Vertiv's Impact Misunderstood, Copilot Weak Adoption",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "235358898063428437",
        "title": "Oracle in focus as Piper Sandler downgrades amid margin, free cash flow worries",
        "url": "https://seekingalpha.com/news/4433944-oracle-in-focus-as-piper-sandler-downgrades-amid-margin-free-cash-flow-worries",
        "site": "seekingalpha.com",
        "time": 1745411081000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1281782694356195135",
        "title": "The Coolest Big Data System And Platform Companies Of The 2025 Big Data 100",
        "url": "https://www.crn.com/news/software/2025/the-coolest-big-data-system-and-platform-companies-of-the-2025-big-data-100",
        "site": "crn.com",
        "time": 1745330400000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The coolest big data system and cloud platform companies of the 2025 CRN Big Data 100 include Amazon Web Services, Databricks, Microsoft and Oracle.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4743946278226988812",
        "title": "Zuckerberg, Dimon Are Among Top Sellers Ahead of Tariff Stock Rout",
        "url": "https://www.bloomberg.com/news/articles/2025-04-20/zuckerberg-dimon-are-among-top-sellers-ahead-of-tariff-stock-rout",
        "site": "bloomberg.com",
        "time": 1745154032000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Billionaire Oracle CEO also unloaded shares in first quarter before markets tumbled. Mark Zuckerberg, chief executive officer of Meta Platforms Inc., during the Meta Connect event in Menlo Park, California, US, on Wednesday, Sept. 25, 2024. Meta Platforms Inc. debuted its first pair of augmented reality glasses, devices that show a combined view of the digital and physical worlds, a key step in Chief Executive Officer Mark Zuckerberg’s goal of one day offering a hands-free alternative to the smartphone.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8972831018557729478",
        "title": "OpenAI’s Stargate project sets its sights on international expansion",
        "url": "https://techcrunch.com/2025/04/17/openais-stargate-project-sets-its-sights-on-international-expansion/",
        "site": "techcrunch.com",
        "time": 1744902648000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Stargate, a $500 billion project headed up by OpenAI, Oracle, and SoftBank to build AI data centers and other AI infrastructure in the U.S., is considering investments in the U.K. and elsewhere overseas, according to a Financial Times report. While Stargate was initially launched as a way to boost U.S. AI infrastructure, the project is […]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6583717103468469623",
        "title": "CISA Issues Threat Warning After ‘Potential’ Oracle Cloud Breach",
        "url": "https://www.crn.com/news/security/2025/cisa-issues-threat-warning-after-potential-oracle-cloud-breach",
        "site": "crn.com",
        "time": 1744898160000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "While CISA said it has no specifics on a recently reported Oracle Cloud breach, the federal cybersecurity agency warned of a possibility of increased credential risks.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3246247527006185095",
        "title": "US Army expands use of Oracle Cloud Infrastructure with $222.53m task order",
        "url": "https://www.datacenterdynamics.com/en/news/us-army-expands-use-of-oracle-cloud-infrastructure-with-22253m-task-order/",
        "site": "datacenterdynamics.com",
        "time": 1744892391000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Department of Agriculture also selects Oracle for STRATUS contract",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7716691722733935129",
        "title": "Oracle and Google expand multicloud offering",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-and-google-expand-multicloud-offering/",
        "site": "datacenterdynamics.com",
        "time": 1744291803000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Add new regions, bring availability to company partners, and plan new service",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1271999581639838767",
        "title": "Oracle says \"obsolete servers\" hacked, denies cloud breach",
        "url": "https://www.bleepingcomputer.com/news/security/oracle-says-obsolete-servers-hacked-denies-cloud-breach/",
        "site": "bleepingcomputer.com",
        "time": 1744225971000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle finally confirmed in email notifications sent to customers that a hacker stole and leaked credentials that were stolen from what it described as \"two obsolete servers.\" [...]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1612493385908993189",
        "title": "A Trade War Is a Funny Way to ‘Help’ US AI Companies",
        "url": "https://www.bloomberg.com/opinion/articles/2025-04-09/trump-tariffs-will-hurt-us-ai-efforts",
        "site": "bloomberg.com",
        "time": 1744200002000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Trump’s new tariffs will affect everything from chips to data centers to online ads. No American tech player will be spared. US President Donald Trump, from left, Larry Ellison, co-founder and executive chairman of Oracle Corp., Masayoshi Son, chief executive officer of SoftBank Group Corp., and Sam Altman, chief executive officer of OpenAI Inc., in the Roosevelt Room of the White House in Washington, DC, US, on Tuesday, Jan. 21, 2025. Trump announced a joint venture to fund artificial intelligence infrastructure worth billions of dollars with the leaders of Softbank Group Corp., OpenAI LLC, and Oracle Corp., an effort aimed at speeding development of the emerging technology.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-2723108998475719150",
        "title": "They Look Real, Sound Smart, and Don’t Exist — AI Experts Are Fooling the News",
        "url": "https://www.digitalinformationworld.com/2025/04/they-look-real-sound-smart-and-dont.html",
        "site": "digitalinformationworld.com",
        "time": 1744177846000,
        "favicon_url": "https://static.tickertick.com/website_icons/digitalinformationworld.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "AI generated material has become a problem even for giant media companies. They have been found to be treating AI generated characters as experts on different subjects. Media companies, like the BBC, the Sun, the Guardian, Newsweek, Medium, Fortune etc., have promoted fake characters by quoting them as reliable sources in their newspapers. But these experts do not even exist and are just the product of AI.An investigation by the journalist Rob Waugh of the Press Gazette has revealed the infiltration of AI in mainstream media. He says that some famous newspapers published articles quoting AI generated characters as experts on various subjects. And they have been quoted again and again, indicating that the media outlets were totally unaware of their actual reality. This infiltration of AI has decreased the level of authenticity of even reliable media outlets and exposed the potential dangers of AI. Providing details on LinkedIn, Rob Waugh writes that one of such fake experts was an alleged psychologist Barbara Santini. Claimed to have a degree from Oxford, Santini was quoted hundreds of times in the British media as an expert psychologist, giving her opinion on different psychological problems. Rob found her to be fake when he tried to talk to her on phone and to confirm her qualifications, but she refused. She wanted to communicate only through WhatsApp: messages on WhatsApp would have allowed her to remain hidden as an AI generated character. He gives another example of Rebecca Leigh of Academized. She also presented herself as an expert commentator on various subjects and had been quoted in the famous newspapers like Fortune and Business. Her profile on the website described her as a biochemist and science educator with a 12-year experience. But when Waugh asked the expert to prove herself to be a human, she stopped communicating. It was revealed later that she was using a fake name, picture and profile. The company also accepted that the profile had fake details. But to save itself from blame, it argued that fake name and profile details are used to keep writers anonymous.Surprisingly, the similar photo was being used by another tech writer on another media service, LeadDev, under the profile name Sara Sparrow. Either AI is copying data of authentic writers, or it is using the same data at more than one place.AI might be infiltrating media outlets, but the role played by humans in it should not be ignored. Qwoted and ResponseSource, two networking services connecting journalists with expert sources, have been found using fake AI experts. Similarly, humans could be behind other such usage of AI in the media, including giant media outlets, to speed up the process. But it is not hard to detect AI in journalism. Qwoted does warn its users of a possibly AI generated content if the response of a query on the website is too fast to be from a human. Moreover, it also provides the option of Check for AI which can detect text generated by any AI system. So it is far better to establish the truth of a source than to start believing it just because data is coming from famous media outlets. This is no longer true because the authenticity of media has been compromised by AI. Image: DIW-AigenRead next:• The Industries Behind the Billionaire Boom: Top Sectors Creating Wealth in the Last Decade• From Juul to xAI: A Rollercoaster Ride of Billion-Dollar Tech Deals",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-7151167148831076257",
        "title": "Ex-Dividend Reminder: Verizon Communications, Oracle And AT&T",
        "url": "https://www.forbes.com/sites/dividendchannel/2025/04/08/ex-dividend-reminder-verizon-communications-oracle-and-att/",
        "site": "forbes.com",
        "time": 1744121257000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "On 4/10/25, Verizon Communications, Oracle, and AT&T will all trade ex-dividend for their respective upcoming dividends On 4/10/25, Verizon Communications, Oracle, and AT&T will all trade ex-dividend for their respective upcoming dividends",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5867588034637348244",
        "title": "Dan Wootton tricked colleague into sending intimate pictures, court told",
        "url": "https://www.bbc.com/news/articles/c3ev428eepvo",
        "site": "bbc.com",
        "time": 1744118930000,
        "favicon_url": "https://static.tickertick.com/website_icons/bbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The former Sun and GB News journalist is accused of posing as a woman online to \"catfish\" the man.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-7037061357215012724",
        "title": "Tariffs Trouble Oracle - Oracle is worried tariffs will impact its mega data center for ...",
        "url": "https://www.theinformation.com/articles/tariffs-trouble-oracle?rc=66mtsr&.tsrc=rss",
        "site": "theinformation.com",
        "time": 1744035306000,
        "favicon_url": "https://static.tickertick.com/website_icons/theinformation.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle is worried tariffs will impact its mega data center for OpenAI.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-3283301649708805150",
        "title": "China puts TikTok deal on hold over Trump's tariffs: report | $ORCL $BDNCE $AMZN $MSFT $BX",
        "url": "https://seekingalpha.com/news/4428920-china-puts-tiktok-deal-on-hold-over-trumps-tariffs-report",
        "site": "seekingalpha.com",
        "time": 1743861444000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "879930544182409589",
        "title": "Oracle cloud has some advantages over the big hyperscalers, Deutsche Bank says",
        "url": "https://seekingalpha.com/news/4428787-oracle-cloud-has-some-advantages-over-the-big-hyperscalers-deutsche-bank-says",
        "site": "seekingalpha.com",
        "time": 1743854456000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8621165227942935617",
        "title": "Stargate developer Crusoe could spend $3.5 billion on a Texas data center. Most of it will be tax-free.",
        "url": "https://www.businessinsider.com/crusoes-project-stargate-data-center-tax-break-in-abilene-texas-2025-4",
        "site": "businessinsider.com",
        "time": 1743843661000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle executive chairman and CTO Larry Ellison at the White House to announce Project Stargate with President Donald Trump.Elizabeth Frantz/REUTERSThe Abilene City Council approved a tax abatement for Crusoe's data center campus in Texas.Business Insider obtained a copy of the agreement via a public records request.Crusoe, the data center developer, could get an 85% property tax break.The developer of the first Stargate data center in Abilene, Texas, could get an 85% tax break on billions of dollars worth of property, according to a new tax abatement agreement obtained by Business Insider through a public records request.To qualify for the tax break, AI startup Crusoe will need to spend a minimum of $2.4 billion of a $3.5 billion \"targeted investment.\"President Donald Trump announced Stargate, a joint venture between OpenAI, Oracle, and SoftBank, at a White House press conference in January. That month, Business Insider reported that Oracle is the tenant of two data center buildings under construction on Crusoe's data center campus in Abilene, which is widely assumed to be Stargate's first site. The estimated cost for those buildings, $1.1 billion, will count toward the targeted investment.Since then, Crusoe has registered two more data center buildings with a state agency on the site. No tenant is listed for one of those buildings; Oracle is listed as the tenant for the other.Crusoe has agreed to build six new data centers, each with a minimum square footage of 100,000, on Lancium's land in Abilene. These will join the two it is already constructing for Oracle.Data centers create jobs—although some say it's not enoughA local news outlet first reported the abatement after the Abilene City Council approved it in February, naming the site's landowner Lancium as the tax break recipient.The abatement requires Crusoe and Lancium to create 357 new full-time jobs with minimum salaries of $57,600. The does not specify what kind of jobs need to be created, though the hiring timeframe indicates that construction jobs will likely count toward the quota.Critics of tax abatements for data centers have said that they don't create enough jobs to justify the tax breaks. Proponents like to point out that the sites can employ thousands of skilled laborers during the construction period.Property tax abatements are common financial incentives used by local governments to encourage companies to operate in their cities and towns. Specific property tax breaks for data centers vary widely depending on locality. Loudoun County, Virginia, home to the world's largest concentration of data centers, does not abate property taxes for data centers. In New Albany, Ohio, a fast-growing data center, data centers have been granted 100% property tax abatements.Stargate's expansion plansOracle executive chairman and CTO Larry Ellison has said the first Stargate data center is in Abilene, though scant details have emerged about the massive AI infrastructure initiative since Trump's announcement.In February, OpenAI CFO Sarah Friar wrote in a LinkedIn post that the company was evaluating additional locations in Texas, Pennsylvania, Oregon, and Wisconsin for Stargate.Crusoe announced it is developing a data center campus in Abilene, though it has not publicly confirmed that it is connected to Stargate. Public filings in Texas show that Oracle is Crusoe's tenant, Business Insider reported in January.To finance the Abilene development, Crusoe entered into a $3.4 billion joint venture with private credit company Blue Owl. JP Morgan has lent $2.3 billion in construction financing to the project.Lancium declined to comment. Crusoe, Oracle, and the Development Corporation of Abilene did not respond to requests for comment from BI.Contact Ellen Thomas at ethomas@insider.com or on Signal at 929-524-6964.Read the original article on Business Insider Oracle executive chairman and CTO Larry Ellison at the White House to announce Project Stargate with President Donald Trump.Elizabeth Frantz/REUTERSThe Abilene City Council approved a tax abatement for Crusoe's data center campus in Texas.Business Insider obtained a copy of the agreement via a public records request.Crusoe, the data center developer, could get an 85% property tax break.The developer of the first Stargate data center in Abilene, Texas, could get an 85% tax break on billions of dollars worth of property, according to a new tax abatement agreement obtained by Business Insider through a public records request.To qualify for the tax break, AI startup Crusoe will need to spend a minimum of $2.4 billion of a $3.5 billion \"targeted investment.\"President Donald Trump announced Stargate, a joint venture between OpenAI, Oracle, and SoftBank, at a White House press conference in January. That month, Business Insider reported that Oracle is the tenant of two data center buildings under construction on Crusoe's data center campus in Abilene, which is widely assumed to be Stargate's first site. The estimated cost for those buildings, $1.1 billion, will count toward the targeted investment.Since then, Crusoe has registered two more data center buildings with a state agency on the site. No tenant is listed for one of those buildings; Oracle is listed as the tenant for the other.Crusoe has agreed to build six new data centers, each with a minimum square footage of 100,000, on Lancium's land in Abilene. These will join the two it is already constructing for Oracle.Data centers create jobs—although some say it's not enoughA local news outlet first reported the abatement after the Abilene City Council approved it in February, naming the site's landowner Lancium as the tax break recipient.The abatement requires Crusoe and Lancium to create 357 new full-time jobs with minimum salaries of $57,600. The does not specify what kind of jobs need to be created, though the hiring timeframe indicates that construction jobs will likely count toward the quota.Critics of tax abatements for data centers have said that they don't create enough jobs to justify the tax breaks. Proponents like to point out that the sites can employ thousands of skilled laborers during the construction period.Property tax abatements are common financial incentives used by local governments to encourage companies to operate in their cities and towns. Specific property tax breaks for data centers vary widely depending on locality. Loudoun County, Virginia, home to the world's largest concentration of data centers, does not abate property taxes for data centers. In New Albany, Ohio, a fast-growing data center, data centers have been granted 100% property tax abatements.Stargate's expansion plansOracle executive chairman and CTO Larry Ellison has said the first Stargate data center is in Abilene, though scant details have emerged about the massive AI infrastructure initiative since Trump's announcement.In February, OpenAI CFO Sarah Friar wrote in a LinkedIn post that the company was evaluating additional locations in Texas, Pennsylvania, Oregon, and Wisconsin for Stargate.Crusoe announced it is developing a data center campus in Abilene, though it has not publicly confirmed that it is connected to Stargate. Public filings in Texas show that Oracle is Crusoe's tenant, Business Insider reported in January.To finance the Abilene development, Crusoe entered into a $3.4 billion joint venture with private credit company Blue Owl. JP Morgan has lent $2.3 billion in construction financing to the project.Lancium declined to comment. Crusoe, Oracle, and the Development Corporation of Abilene did not respond to requests for comment from BI.Contact Ellen Thomas at ethomas@insider.com or on Signal at 929-524-6964.Read the original article on Business Insider",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-7067016233942513775",
        "title": "Meet all the bidders for TikTok ahead of weekend deadline | $AMZN $MSFT $ORCL $BDNCE $RUM",
        "url": "https://seekingalpha.com/news/4428710-meet-all-the-bidders-for-tiktok-ahead-of-weekend-deadline",
        "site": "seekingalpha.com",
        "time": 1743765946000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1878981340161494626",
        "title": "OpenAI Raises $40 Billion, Runway AI Video $380 Million, Amazon, Oracle, TikTok Suitors Await Decision",
        "url": "https://www.forbes.com/sites/charliefink/2025/04/03/openai-raises-40-billion-runway-ai-video-380-million-amazon-oracle-tiktok-suitors-await-decision/",
        "site": "forbes.com",
        "time": 1743712337000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "OpenAI raises $40B, Trump weighs in on TikTok, Runway’s $380 M raise and its stunning Gen-4 AI model, Anthropic warns: AI may lie, plus vibe filmmaking with Deepmind. OpenAI raises $40B, Trump weighs in on TikTok, Runway’s $380 M raise and its stunning Gen-4 AI model, Anthropic warns: AI may lie, plus vibe filmmaking with Deepmind.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6373676749095181765",
        "title": "Oracle Disclosed Breach Of ‘Legacy’ Environment To Customers: Report",
        "url": "https://www.crn.com/news/security/2025/oracle-disclosed-breach-of-legacy-environment-to-customers-report",
        "site": "crn.com",
        "time": 1743706680000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "A breach of an Oracle ‘legacy’ environment led to the theft of log-in credentials and included a demand by the attacker for an extortion payment, according to a Bloomberg report.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8951816379351658972",
        "title": "Sources: Oracle told some clients this week that hackers stole old login credentials, the second breach that Oracle acknowledged to clients in the past month (Jake Bleiberg/Bloomberg)",
        "url": "http://www.techmeme.com/250403/p22#a250403p22",
        "site": "techmeme.com",
        "time": 1743696304000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Jake Bleiberg / Bloomberg: Sources: Oracle told some clients this week that hackers stole old login credentials, the second breach that Oracle acknowledged to clients in the past month — - FBI investigating the breach, software company told clients — Oracle informed health-care customers of separate March hack",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5763673106371391944",
        "title": "Oracle Cyberattack Highlights Importance of Securing Enterprise Cloud Environments",
        "url": "https://www.pymnts.com/cybersecurity/2025/oracle-cyberattack-highlights-importance-of-securing-enterprise-cloud-environments/",
        "site": "pymnts.com",
        "time": 1743695582000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Enterprise cores and business-line technology stacks have increasingly moved to the cloud. But as enterprises expand their digital footprints, the data they generate, store and transfer becomes increasingly vulnerable to interception, manipulation or outright theft. The threat environment today has progressed to the point where even the largest cloud providers can’t always guarantee safety. Last […] The post Oracle Cyberattack Highlights Importance of Securing Enterprise Cloud Environments appeared first on PYMNTS.com. Enterprise cores and business-line technology stacks have increasingly moved to the cloud. But as enterprises expand their digital footprints, the data they generate, store and transfer becomes increasingly vulnerable to interception, manipulation or outright theft. The threat environment today has progressed to the point where even the largest cloud providers can’t always guarantee safety. Last Friday (March 28), news broke that the Federal Bureau of Investigation (FBI) is probing a cyberattack at Oracle that led to the theft of an alleged 6 million records, taken from 140,000 Oracle cloud tenants. Separately, Google on Tuesday (April 1) announced an update enabling enterprise Gmail users to send end-to-end encrypted emails to any platform underscores that as enterprise cloud adoption reaches new heights, the conversation around data security is intensifying. In a blog post, Google wrote that “secure, confidential communication should be available for organizations of all sizes. However, end-to-end encrypted (E2EE) email was historically a privilege reserved for organizations with significant IT resources, due to the complexity of S/MIME and proprietary solutions.” In a landscape where breaches and cyberattacks are no longer theoretical threats but daily occurrences, the growing adoption of hybrid and multi-cloud architectures compounds the challenge of safeguarding data both at rest and in transit. Data frequently traverses diverse environments spanning private, public and on-premises ecosystems, heightening the potential attack surface. For enterprises to fully realize the cloud’s potential, robust data protection mechanisms are becoming non-negotiable. This is where encryption may be poised to take center stage. Read also: CFOs Embrace Data Clouds Amid Shift Away From Pure-Play Record-Keeping Securing the Perimeter of the Expanding Cloud Ecosystem Encryption helps to offer enterprises a way to confidently interact across cloud-native environments and communication platforms. In the cloud environment, encryption can manifest in various forms: data at rest, data in transit, and increasingly, data in use. Each type demands unique methodologies and considerations. Data-at-rest encryption safeguards inactive data stored on disks or databases, while data-in-transit encryption secures information as it moves between endpoints. Data-in-use encryption, still a nascent but rapidly maturing field, focuses on protecting information while it is being processed or manipulated. The adoption of end-to-end encryption (E2EE) across cloud platforms is becoming commonplace. By ensuring data remains encrypted from the moment it is created to when it is consumed, E2EE helps offer comprehensive protection that can address vulnerabilities in traditional encryption schemes. However, implementing E2EE in complex enterprise environments is no trivial task. Encrypting vast amounts of data across multiple cloud environments can create latency issues and impact processing power. Striking a balance between robust encryption and operational efficiency is an ongoing challenge for cloud architects and security professionals. Enterprises operating across multiple jurisdictions also find themselves facing another layer of complexity as they navigate a labyrinth of compliance requirements. For example, the European Union’s General Data Protection Regulation (GDPR) and the California Consumer Privacy Act (CCPA), among others, mandate stringent data protection practices that often necessitate encryption. Differing regulations across borders can create confusion and complicate implementation. Read also: You Can’t Teach an Old Tech Stack New Payments Tricks The Evolving Enterprise Back Office As enterprises grapple with these challenges, innovation continues to reshape the core technology stacks that power organizational back offices. That’s what makes securing the organizational perimeter so important. “People used to think the ERP (enterprise resource planning) was the center of the CFO’s office. But the reality is, many large companies that have gone on acquisition sprees have multiple ERP systems, making it difficult to centralize financial data,” Matt Carey, senior vice president, office of the CFO at FIS, told PYMNTS. Instead, treasury management systems (TMS) are emerging as the glue connecting disparate financial data, he said. “A full TMS integrates different ERP instances, connects to banking partners, and consolidates financial information,” Carey added. “This is crucial for liquidity management, FX strategy and improving credit ratings.” Ultimately, securing the organizational perimeter is not a one-time effort but a continuous process that must adapt to the ever-changing landscape of technological innovation. As enterprises grapple with these challenges, a proactive and adaptive approach to security will be key to ensuring long-term success. After all, the concept of the organizational perimeter has evolved. Where once it was primarily defined by physical networks and data centers, it is now characterized by a combination of cloud infrastructures, remote work environments and mobile devices. The post Oracle Cyberattack Highlights Importance of Securing Enterprise Cloud Environments appeared first on PYMNTS.com.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8938306993899338778",
        "title": "Oracle privately confirms Cloud breach to customers",
        "url": "https://www.bleepingcomputer.com/news/security/oracle-privately-confirms-cloud-breach-to-customers/",
        "site": "bleepingcomputer.com",
        "time": 1743694005000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle has finally acknowledged to some customers that attackers have stolen old client credentials after breaching a \"legacy environment\" last used in 2017. [...]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2995452431845923901",
        "title": "Oracle reportedly confirms Oracle Cloud breach to customers",
        "url": "https://www.bleepingcomputer.com/news/security/oracle-reportedly-confirms-oracle-cloud-breach-to-customers/",
        "site": "bleepingcomputer.com",
        "time": 1743694005000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle has finally acknowledged to some customers that attackers have stolen old client credentials after breaching a \"legacy environment\" last used in 2017. [...]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1368548921831185939",
        "title": "AI deployment network Parasail launches, claims to have more GPUs than Oracle",
        "url": "https://www.datacenterdynamics.com/en/news/ai-deployment-network-parasail-launches-claims-to-have-more-gpus-than-oracle/",
        "site": "datacenterdynamics.com",
        "time": 1743693777000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Parasail orchestration engine automatically matches workloads across global GPU network",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6658518600958028720",
        "title": "Report: Oracle Staff Tell Some Clients Hacker Stole Login Credentials",
        "url": "https://www.pymnts.com/cybersecurity/2025/report-oracle-staff-tell-some-clients-hacker-stole-login-credentials/",
        "site": "pymnts.com",
        "time": 1743640752000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle staff reportedly told some clients that a hacker stole some old client login credentials. The hacker accessed usernames, passkeys and encrypted passwords, Bloomberg reported Wednesday (April 2), citing unnamed sources. Oracle did not immediately reply to PYMNTS’ request for comment. This incident is separate from one reported by Bloomberg in March, in which Oracle […] The post Report: Oracle Staff Tell Some Clients Hacker Stole Login Credentials appeared first on PYMNTS.com. Oracle staff reportedly told some clients that a hacker stole some old client login credentials. The hacker accessed usernames, passkeys and encrypted passwords, Bloomberg reported Wednesday (April 2), citing unnamed sources. Oracle did not immediately reply to PYMNTS’ request for comment. This incident is separate from one reported by Bloomberg in March, in which Oracle notified some users of its patient records management software that hackers stole patient data, according to the report. In the newer incident, the hacker sought an extortion payment from Oracle for the login credentials, the report said. It was reported in March by Bleeping Computer that someone was trying to sell data online that they claimed to have stolen from Oracle’s cloud servers, per the report. Oracle told customers that there had been no breach of Oracle Cloud, according to the report. Later, Oracle staff told some clients that a hacker broke into a system that had not been in use for eight years and that any client credentials stolen in that incident would therefore pose little risk, the report said. However, one unnamed source told Bloomberg that the stolen data included credentials from as recently as 2024, per the report. The Bleeping Computer report from March said that the person trying to sell data they claimed was stolen from Oracle’s cloud servers said they had 6 million data records. Data breaches compromising millions of user records were among the cyberattacks that took place in 2024 and amounted to some of the most sophisticated and damaging attacks in history, PYMNTS reported in December. Among the most damaging breaches were the Change Healthcare ransomware attack that led to billions in losses, the breached defenses at background check firm National Public Data that led to the stolen information of 2.9 billion individuals, and the Snowflake data breach that snowballed to include over 160 of the world’s largest companies. The threat of a cyberattack plagues all companies, as the threats are everywhere and the old ways of protecting banks and enterprises no longer apply, according to the PYMNTS Intelligence report, “AWS and Mastercard Lead Call for Urgency in Protecting the Payments Perimeter.” The post Report: Oracle Staff Tell Some Clients Hacker Stole Login Credentials appeared first on PYMNTS.com.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6225667766824857179",
        "title": "A profile of Larry Ellison, now 80 years old with a $175B fortune, as Oracle bids for TikTok US and he puts up most of his son David's $8B bid to buy Paramount (New York Times)",
        "url": "http://www.techmeme.com/250402/p30#a250402p30",
        "site": "techmeme.com",
        "time": 1743609001000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "New York Times: A profile of Larry Ellison, now 80 years old with a $175B fortune, as Oracle bids for TikTok US and he puts up most of his son David's $8B bid to buy Paramount — For decades, Larry Ellison reveled in being the Silicon Valley executive who really knew how to have a good time.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2687913804863182032",
        "title": "How Trump Could Make Larry Ellison the Next Media Mogul",
        "url": "https://www.nytimes.com/2025/04/02/technology/trump-larry-ellison-tiktok-oracle.html",
        "site": "nytimes.com",
        "time": 1743605820000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The co-founder of Oracle and friend of President Trump, who was a flamboyant fixture in the 1990s, has returned to the spotlight through — of all things — TikTok.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-3864348401152024324",
        "title": "Parasail says its fleet of on-demand GPUs is larger than Oracle’s entire cloud",
        "url": "https://techcrunch.com/2025/04/02/parasail-says-its-fleet-of-on-demand-gpus-is-larger-than-oracles-entire-cloud/",
        "site": "techcrunch.com",
        "time": 1743602400000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Cloud infrastructure is dominated by several large industry players: AWS, Microsoft’s Azure, and Google Cloud. While to some it may look like AI is headed in a similar direction, the founders of Parasail think AI infrastructure will look very different — and are betting their company’s fate on it. Parasail works with dozens of providers to […]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5600372353777201659",
        "title": "Report: Andreessen Horowitz May Join Leading Bid to Take Over TikTok",
        "url": "https://www.pymnts.com/news/investment-tracker/2025/andreessen-horowitz-may-join-leading-bid-take-over-tiktok/",
        "site": "pymnts.com",
        "time": 1743545355000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Andreessen Horowitz is reportedly in talks to invest in TikTok as part of a bid by Oracle and other American investors that has emerged as the frontrunner among those aiming to acquire the social media app from its Chinese owner. The venture capital firm is working to add new outside investment for the buyout, the […] The post Report: Andreessen Horowitz May Join Leading Bid to Take Over TikTok appeared first on PYMNTS.com. Andreessen Horowitz is reportedly in talks to invest in TikTok as part of a bid by Oracle and other American investors that has emerged as the frontrunner among those aiming to acquire the social media app from its Chinese owner. The venture capital firm is working to add new outside investment for the buyout, the Financial Times reported Tuesday (April 1). Co-founder Marc Andreessen has invested in other social media platforms, including making an early investment in Facebook and contributing $400 million to Elon Musk’s purchase of Twitter, now X, according to the report. The talks are ongoing and could end without a deal, the report said. Saturday (April 5) is the deadline for the Chinese owners of TikTok to sell the U.S. arm to non-Chinese entities or see the app banned in the U.S., per the report. President Donald Trump said Sunday (March 30) that TikTok will have a new owner before the deadline and there are “a lot of potential buyers” for the social media platform. “There’s tremendous interest in TikTok,” Trump told reporters aboard Air Force One, per Reuters. “I’d like to see TikTok remain alive,” he added. An earlier Reuters report said private equity outfit Blackstone could be an investor in TikTok’s American operations, as the firm was considering joining the social media platform’s Chinese parent company ByteDance’s existing non-Chinese shareholders. Those shareholders are led by Susquehanna International Group and General Atlantic. In their plan, TikTok U.S. would be spun off into a separate entity, winnowing down Chinese ownership in the new business to under 20%, which is the threshold mandated by U.S. law. Artificial intelligence search engine firm Perplexity said March 21 that it should become TikTok’s new owner after weeks of reports that it was interested in merging with the social media platform. The company wrote in a blog post: “Perplexity is singularly positioned to rebuild the TikTok algorithm without creating a monopoly, combining world-class technical capabilities with Little Tech independence.” The post Report: Andreessen Horowitz May Join Leading Bid to Take Over TikTok appeared first on PYMNTS.com.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-7981796230886300061",
        "title": "Andreessen Horowitz is trying to nab a piece of TikTok with Oracle, report says",
        "url": "https://techcrunch.com/2025/04/01/andreessen-horowitz-is-trying-to-nab-a-piece-of-tiktok-with-oracle-report-says/",
        "site": "techcrunch.com",
        "time": 1743537600000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The venture capital firm is reportedly in talks to invest in TikTok as part of a bid led by Oracle and other American investors looking to buy out TikTok from ByteDance, according to the Financial Times. TikTok is once again slated to be banned in the US on April 5th unless its Chinese-based owner sells […]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7405509572474551530",
        "title": "Sources: a16z is in talks to join the Oracle-led frontrunner bid for TikTok's US arm, after being approached along with Blackstone Group and others (Financial Times)",
        "url": "http://www.techmeme.com/250401/p29#a250401p29",
        "site": "techmeme.com",
        "time": 1743531901000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Financial Times: Sources: a16z is in talks to join the Oracle-led frontrunner bid for TikTok's US arm, after being approached along with Blackstone Group and others — Venture capital group could join last-gasp bid by allies of Donald Trump to take control of video app owned by ByteDance",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-1648572713940138507",
        "title": "Oracle under fire for its handling of separate security incidents",
        "url": "https://techcrunch.com/2025/03/31/oracle-under-fire-for-its-handling-of-separate-security-incidents/",
        "site": "techcrunch.com",
        "time": 1743445148000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle has denied at least one breach, despite evidence to the contrary, as it begins notifying healthcare customers of a separate patient data breach.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "566293712766950539",
        "title": "Oracle is using very specific words to avoid responsibility for an Oracle Cloud breach, after a report on March 21 that a threat actor claimed responsibility (Kevin Beaumont/DoublePulsar)",
        "url": "http://www.techmeme.com/250331/p23#a250331p23",
        "site": "techmeme.com",
        "time": 1743429903000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Kevin Beaumont / DoublePulsar: Oracle is using very specific words to avoid responsibility for an Oracle Cloud breach, after a report on March 21 that a threat actor claimed responsibility — Being a provider of cloud SaaS (Software-as-a-service) solutions requires certain cybersecurity responsibilities — including being transparent and open.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4342222712522047823",
        "title": "Oracle Reportedly Warns of Healthcare Data Breach",
        "url": "https://www.datacenterknowledge.com/cybersecurity/oracle-reportedly-warns-of-healthcare-data-breach",
        "site": "datacenterknowledge.com",
        "time": 1743411600000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterknowledge.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The cloud company told customers that hackers had potentially accessed older Cerner servers, Bloomberg reports.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-2444319634372305433",
        "title": "DOD Cuts Loom, Investors Eye Jobs, Trade War, X, Oracle Breach",
        "url": "https://www.bloomberg.com/news/audio/2025-03-29/dod-cuts-loom-investors-eye-jobs-trade-war-x-oracle-breach",
        "site": "bloomberg.com",
        "time": 1743256626000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 5:60 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-3246752680055044172",
        "title": "Source: hackers broke into Oracle's Cerner servers sometime after January 22 and stole patient data to extort US medical providers; the FBI is investigating (Bloomberg)",
        "url": "http://www.techmeme.com/250328/p30#a250328p30",
        "site": "techmeme.com",
        "time": 1743204001000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Bloomberg: Source: hackers broke into Oracle's Cerner servers sometime after January 22 and stole patient data to extort US medical providers; the FBI is investigating — - The FBI is investigating the incident from earlier this year — Hacker used stolen logins to access old servers, Oracle said",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-7518984080579214908",
        "title": "Oracle Warns Health Customers of Patient Data Breach",
        "url": "https://www.bloomberg.com/news/articles/2025-03-28/oracle-warns-health-customers-of-patient-data-breach",
        "site": "bloomberg.com",
        "time": 1743200323000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Hackers broke into Oracle Corp.’s computer systems and stole patient data in an attempt to extort multiple medical providers in the US, according to a person familiar with the matter and a notification the software company sent to clients. The Oracle offices in Redwood City, California, US, on Wednesday, Sept. 4, 2024. Oracle Corp. is scheduled to release earnings figures on September 9.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8960673154632141335",
        "title": "Oracle has reportedly suffered 2 separate breaches exposing thousands of customers‘ PII",
        "url": "https://arstechnica.com/security/2025/03/oracle-is-mum-on-reports-it-has-experienced-2-separate-data-breaches/",
        "site": "arstechnica.com",
        "time": 1743190874000,
        "favicon_url": "https://static.tickertick.com/website_icons/arstechnica.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Alleged breaches affect Oracle Cloud and Oracle Health. Oracle isn’t commenting on recent reports that it has experienced two separate data breaches that have exposed sensitive personal information belonging to thousands of its customers. The most recent data breach report, published Friday by Bleeping Computer, said that Oracle Health—a health care software-as-a-service business the company acquired in 2022—had learned in February that a threat actor accessed one of its servers and made off with patient data from US hospitals. Bleeping Computer said Oracle Health customers have received breach notifications that were printed on plain paper rather than official Oracle letterhead and were signed by Seema Verma, the executive vice president & GM of Oracle Health. The other report of a data breach occurred eight days ago, when an anonymous person using the handle rose87168 published a sampling of what they said were 6 million records of authentication data belonging to Oracle Cloud customers. Rose87168 told Bleeping Computer that they had acquired the data a little more than a month earlier after exploiting a vulnerability that gave access to an Oracle Cloud server.Read full article Comments",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-897428490528119924",
        "title": "Oracle, Leidos Contract Targeted by US Pentagon Cost-Cutters",
        "url": "https://www.bloomberg.com/news/articles/2025-03-28/oracle-leidos-contract-targeted-by-us-pentagon-cost-cutters",
        "site": "bloomberg.com",
        "time": 1743163200000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The US Department of Defense said it will terminate a plan to use Oracle Corp. software to manage its civilian workforce as part of the Pentagon’s cost-cutting efforts. The Pentagon at dusk in Arlington, Virginia, U.S., on Wednesday, Nov. 11, 2020. A flurry of changes in the Pentagon's top ranks is underway as President Trump elevates long-time allies in moves that critics say sends a signal of turmoil in the leadership of the U.S. military just after a contentious election.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1904604493227958256",
        "title": "Oracle to build cluster of 30,000 AMD MI355X GPUs",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-to-build-cluster-of-30000-amd-mi355x-gpus/",
        "site": "datacenterdynamics.com",
        "time": 1743079503000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Announced agreement during earnings call earlier this month",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1787745194014870761",
        "title": "Oracle customers confirm the authenticity of data samples shared by a threat actor who allegedly breached Oracle Cloud servers, after Oracle denied the breach (Lawrence Abrams/BleepingComputer)",
        "url": "http://www.techmeme.com/250326/p40#a250326p40",
        "site": "techmeme.com",
        "time": 1743033902000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Lawrence Abrams / BleepingComputer: Oracle customers confirm the authenticity of data samples shared by a threat actor who allegedly breached Oracle Cloud servers, after Oracle denied the breach — Despite Oracle denying a breach of its Oracle Cloud federated SSO login servers and the theft of account data for 6 million people …",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-5339395928533891668",
        "title": "Oracle customers confirm data stolen in alleged cloud breach is valid",
        "url": "https://www.bleepingcomputer.com/news/security/oracle-customers-confirm-data-stolen-in-alleged-cloud-breach-is-valid/",
        "site": "bleepingcomputer.com",
        "time": 1743020457000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-6583717103468469623",
            "-4088437928981978892",
            "-6373676749095181765",
            "-8938306993899338778",
            "2995452431845923901",
            "2614194653967620867",
            "4342222712522047823",
            "-7518984080579214908"
        ],
        "description": "Despite Oracle denying a breach of its Oracle Cloud federated SSO login servers and the theft of account data for 6 million people, BleepingComputer has confirmed with multiple companies that associated data samples shared by the threat actor are valid. [...]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4669644175645206642",
        "title": "Trump Under Pressure to Change Curb on AI Chips",
        "url": "https://www.bloomberg.com/news/videos/2025-03-25/trump-under-pressure-to-change-curb-on-ai-chips-video",
        "site": "bloomberg.com",
        "time": 1742918496000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Senior foreign officials and major tech companies such as Nvidia and Oracle are pushing the Trump administration to change its rules for restricting exports of AI chips. Mandeep Singh of Bloomberg Intelligence explains. (Source: Bloomberg)",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5706409274469310600",
        "title": "Sources: companies like Nvidia and many governments are trying to persuade Trump's team to loosen incoming AI chip export rules, known as the AI diffusion rule (Bloomberg)",
        "url": "http://www.techmeme.com/250325/p11#a250325p11",
        "site": "techmeme.com",
        "time": 1742901001000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Bloomberg: Sources: companies like Nvidia and many governments are trying to persuade Trump's team to loosen incoming AI chip export rules, known as the AI diffusion rule — - Nvidia and Oracle pushing for full repeal of AI diffusion rule — Companies must start complying with global restrictions May 15",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-5613464741607402617",
        "title": "Berkshire Hathaway employee wins $1 million in Warren Buffett's March Madness bracket challenge",
        "url": "https://www.cnbc.com/2025/03/24/berkshire-employee-wins-1-million-in-warren-buffetts-march-madness-bracket-challenge.html",
        "site": "cnbc.com",
        "time": 1742847539000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The 94-year-old Oracle of Omaha was finally able to give out the big prize after relaxing the rules multiple times since the competition's inception in 2016.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-2508361981500626495",
        "title": "Emboldened by Trump, A.I. Companies Lobby for Fewer Rules",
        "url": "https://www.nytimes.com/2025/03/24/technology/trump-ai-regulation.html",
        "site": "nytimes.com",
        "time": 1742844610000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "After the president made A.I. dominance a top priority, tech companies changed course from a meeker approach under the Biden administration. President Trump at the White House in January with, from left, Oracle’s chairman, Larry Ellison; SoftBank’s chief executive, Masayoshi Son; and OpenAI’s chief executive, Sam Altman.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4923337419446206401",
        "title": "AWS Vs. Azure Vs. GCP Vs. Oracle Vs. IBM Customer Spending Face-Off: Report",
        "url": "https://www.crn.com/news/cloud/2025/aws-vs-azure-vs-gcp-vs-oracle-vs-ibm-customer-spending-face-off-report",
        "site": "crn.com",
        "time": 1742837400000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Here’s a breakdown of public cloud customer spending on AWS, Microsoft Azure, Google Cloud Platform, Oracle OCI and IBM workloads, according to Flexera’s 2025 cloud report.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4851146036215386994",
        "title": "Oracle expands Oracle Database@Azure offering, adds new regions",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-expands-oracle-databaseazure-offering-adds-new-regions/",
        "site": "datacenterdynamics.com",
        "time": 1742641203000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "7716691722733935129"
        ],
        "description": "Offering where Oracle hardware is deployed at Microsoft data centers now available in 14 regions",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3289278634578959758",
        "title": "Lloyds Banking Group deepens partnership with Oracle",
        "url": "https://www.datacenterdynamics.com/en/news/lloyds-banking-group-deepens-partnership-with-oracle/",
        "site": "datacenterdynamics.com",
        "time": 1742637603000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "UK bank to use Oracle Database@Azure and Oracle Exadata Cloud@Customer",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6378231467070538086",
        "title": "Oracle denies breach after hacker claims theft of 6 million data records",
        "url": "https://www.bleepingcomputer.com/news/security/oracle-denies-data-breach-after-hacker-claims-theft-of-6-million-data-records/",
        "site": "bleepingcomputer.com",
        "time": 1742589831000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "364417630750532901",
            "-1271999581639838767",
            "-1515995884624806769",
            "3673710129714556397",
            "-3619391034841581432"
        ],
        "description": "Oracle denies it was breached after a threat actor claimed to be selling 6 million data records allegedly stolen from the company's Oracle Cloud federated SSO login servers [...]",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-3024393577774218504",
        "title": "AWS, Salesforce Execs See a ‘Fully AI World’ With ‘Limitless Labor’",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/aws-salesforce-execs-see-a-fully-ai-world-with-limitless-labor/",
        "site": "pymnts.com",
        "time": 1742579942000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Executives from AWS, Salesforce and Oracle believe that artificial intelligence (AI) agents will upend the world of work in ways people today might not expect. Consider the following potential future scenarios: You can talk directly to a software program to get what you need instead of clicking through menus and settings. An AI agent will […] The post AWS, Salesforce Execs See a ‘Fully AI World’ With ‘Limitless Labor’ appeared first on PYMNTS.com. Executives from AWS, Salesforce and Oracle believe that artificial intelligence (AI) agents will upend the world of work in ways people today might not expect. Consider the following potential future scenarios: You can talk directly to a software program to get what you need instead of clicking through menus and settings. An AI agent will take care of a customer calling into a call center from start to finish. Software integration will not be needed anymore because the AI agent will just click through the other software like a human would. Two years after the ChatGPT moment, “we have entered an even more transformative phase with generative AI,” said Swami Sivasubramanian, vice president of agentic AI at AWS. “The emergence of agentic AI applications really represents a fundamental shift in its capability.” Unlike earlier generative AI capabilities, AI agents can reason, plan and complete tasks on behalf of humans or systems. They can research, pay bills, manage enterprise applications and even decompose high-level objectives into executable steps, Sivasubramanian said. Down the road, he envisions a “fully AI world” where AI agents make decisions, automate workflows and coordinate by themselves with less human oversight. “But this evolution is not a roadmap for the future. In fact, most of it is already happening today.” AI agents are helping biotech company Genentech automate drug research, saving nearly five years of work, according to Sivasubramanian. Credit ratings company Moody’s has used them to shorten its credit risk reporting process from a week to less than an hour. “This is exactly the kind of breakthrough in productivity and scale you’re going to be able to achieve with customers adopting agentic AI,” Sivasubramanian said at last week’s HumanX conference in Las Vegas. Read more: Deloitte Begins Rollout of AI Agents for Finance and Other Business Functions Salesforce’s Vision for ‘Limitless Labor’ Adam Evans, executive vices president and general manager of Salesforce AI, said the company’s AI agent platform, Agentforce, has seen “overwhelming demand” in the fourth quarter — its first full quarter of selling the service. More than 5,000 customers have signed up, which is “incredible early demand,” Evans said at a separate discussion at the HumanX conference. As more companies use AI agents, he said this becomes a “limitless labor” pool. Salesforce itself uses agents. For instance, an AI agent helps customers who have questions about the Salesforce platform, their accounts and similar queries. Evans said the AI agents resolved all but 3% of the cases, which are then escalated to human representatives. Evans sees the next level for customer service comprising of AI agents that can do more than just answer and refer queries. “Just like a brand ambassador, you’re going to have an AI agent that knows you as a customer, that can help sell, help understand your account, can escalate when necessary, and just kind of be a touchpoint the whole way,” he said. Evans cited three types of AI agents: External agent that interacts with the customers through chat, email and voice. Internal agent that interacts with employees through channels like Slack, helping them in their workflows and the like. Background agent that works behind the scenes to do things like look at sales leads in the CRM, do research and analyze client communication. Evans cited examples from early adopters like Wiley Publishing, which reported a 40% increase in customer satisfaction due to AI-driven customer service agents. Pfizer has started using AI agents to assist in life sciences as well. “We’re seeing customers in regulated industries as well” using agents, he said. Salesforce has structured its business model to accommodate this shift, introducing flexible pricing that allows customers to transition between traditional seat-based pricing and AI consumption-based models. Read more: OpenAI Launches New Tools for Building AI Agents AI Agents as a New Work Paradigm Miranda Nash, group vice president at Oracle AI, sees AI agents becoming the primary interaction layer between users and enterprise software, eliminating the need for complex interfaces. “Let’s stop adapting ourselves to computers and make them adapt to us,” Nash said. That means users might not have to click through the menus of Oracle software to navigate it. “In the future, we really believe you can just ask Oracle questions, and that leads to, behind the scenes, a rather complex, potentially multi-agent workflow,” Nash said during a presentation at the HumanX conference in Las Vegas. Today, Oracle embeds AI agents across HR, finance, supply chain, and operations, enabling departments to automate their own processes. For HR, it means AI-driven hiring processes; for finance, it’s AI optimizing accounts payable; for supply chains, it’s automated logistics management. Every role is being enhanced by AI, she said. Nash has the same view as Evans and Sivasubramanian that AI agents will fundamentally reshape employment. But all three downplayed fears of mass job cuts. “There’s definitely going to be some displacement and there’s going to be more opportunities,” Evans said. Evans highlighted Salesforce’s own experience: Employees previously tasked with repetitive customer support roles are now being moved into higher-value customer success and sales positions. Sivasubramanian said AI agents are enabling companies to streamline workflows, reduce training times and free employees from mundane tasks. He said AWS’s internal AI deployment saved Amazon itself 4,500 developer years’ worth of work and over $250 million in capital expenses. “I think that’s pretty incredible,” Sivasubramanian said. Said Nash: “The only option now is to get in the cloud, get to agents, and meet the future of this world of work.” For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. The post AWS, Salesforce Execs See a ‘Fully AI World’ With ‘Limitless Labor’ appeared first on PYMNTS.com.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7832424487997605979",
        "title": "Trump says he would be happy for US to become ‘associate’ Commonwealth member",
        "url": "https://www.ft.com/content/8b1f96f2-05f5-4c59-af53-d35d058902b4",
        "site": "ft.com",
        "time": 1742569081000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "US president posted Sun news story that referred to a supposed ‘secret offer’ King Charles is due to extend",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-2345425889625360471",
        "title": "Singapore's defense agency partners with Oracle for isolated cloud region",
        "url": "https://www.datacenterdynamics.com/en/news/singapores-defense-agency-partners-with-oracle-for-isolated-cloud-region/",
        "site": "datacenterdynamics.com",
        "time": 1742466936000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Will support Ministry of Defense and Singapore Armed Forces",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-671855776165245493",
        "title": "SoftBank to acquire semiconductor designer Ampere in $6.5B all-cash deal",
        "url": "https://techcrunch.com/2025/03/19/softbank-to-acquire-semiconductor-designer-ampere-in-6-5b-all-cash-deal/?.tsrc=rss",
        "site": "techcrunch.com",
        "time": 1742441327000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "SoftBank Group announced on Wednesday that it will acquire Ampere Computing, a chip designer founded by former Intel executive Renee James, through a $6.5 billion all-cash deal as a strategic move to broaden its investment in AI infrastructure. Ampere will be operating as a wholly-owned subsidiary of SoftBank after the deal, which is expected to close in the second half of 2025. Carlyle and Oracle, Ampere's lead investors, will sell their shares in the Santa Clara, California startup. According",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-300572214148172107",
        "title": "SoftBank agrees to acquire Ampere Computing for $6.5B in cash, with Oracle and Carlyle selling their stakes as part of the deal, expected to close in H2 2025 (Bloomberg)",
        "url": "http://www.techmeme.com/250319/p43#a250319p43",
        "site": "techmeme.com",
        "time": 1742429402000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Bloomberg: SoftBank agrees to acquire Ampere Computing for $6.5B in cash, with Oracle and Carlyle selling their stakes as part of the deal, expected to close in H2 2025 — SoftBank is buying Ampere in an all-cash transaction that values the Santa Clara, California-based firm at $6.5 billion, according to a statement reviewed by Bloomberg News.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8043054732229641081",
        "title": "SoftBank Seals $6.5 Billion Deal for Chip Designer Ampere",
        "url": "https://www.bloomberg.com/news/articles/2025-03-19/softbank-seals-6-5-billion-deal-for-chip-designer-ampere",
        "site": "bloomberg.com",
        "time": 1742426700000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "SoftBank Group Corp. has agreed to acquire semiconductor designer Ampere Computing LLC in a move that further broadens the Japanese investment firm’s push into artificial intelligence infrastructure. SoftBank Group CEO Masayoshi Son, standing between Oracle’s Larry Ellison and OpenAI CEO Sam Altman, at the White House in January as Donald Trump announced a joint venture to fund AI infrastructure.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8245427294138965497",
        "title": "Oracle, Atlassian, Onestream, Workiva in focus as Stephens initiates coverage",
        "url": "https://seekingalpha.com/news/4422136-oracle-atlassian-onestream-workiva-in-focus-as-stephens-initiates-coverage",
        "site": "seekingalpha.com",
        "time": 1742389673000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1801076829068967181",
        "title": "Oracle’s Role in TikTok’s Future Gets Capitol Hill Scrutiny",
        "url": "https://www.nytimes.com/2025/03/18/technology/oracle-tiktok.html",
        "site": "nytimes.com",
        "time": 1742345233000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Top congressional staffers met with Oracle on Tuesday to talk about TikTok, which faces a ban in the United States unless it is sold to a non-Chinese owner by early April. Larry Ellison, co-founder and chief technology officer of Oracle, in the Oval Office in February. Oracle is a technology partner of TikTok in the United States.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5665320416249110958",
        "title": "Why Oracle Could Be Key to a TikTok Deal",
        "url": "https://www.bloomberg.com/news/articles/2025-03-18/why-oracle-could-be-key-to-a-tiktok-deal",
        "site": "bloomberg.com",
        "time": 1742337434000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "TikTok parent company ByteDance Ltd. is once again racing toward a deadline to sell off its popular video app or face a ban in the US. Several interested buyers have publicly emerged, and the most discussed deal scenarios involve a key role for a longtime partner of the video platform: Oracle Corp. Oracle was part of an investor group that tried to buy TikTok’s US operations back in 2020, the first time that President Trump tried to force a sale of the video app.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6939914891287723557",
        "title": "Proposed TikTok Solution Would Have Oracle Provide Data Security",
        "url": "https://www.pymnts.com/news/social-commerce/2025/proposed-tiktok-solution-would-have-oracle-provide-data-security/",
        "site": "pymnts.com",
        "time": 1742326695000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "One of the deals being considered to keep TikTok operating in the U.S. reportedly involves Oracle taking a small stake in the company and working with U.S. buyers to ensure that no user data would be accessible to the Chinese government. That is one of the proposals being considered as the April 5 deadline for […] The post Proposed TikTok Solution Would Have Oracle Provide Data Security appeared first on PYMNTS.com. One of the deals being considered to keep TikTok operating in the U.S. reportedly involves Oracle taking a small stake in the company and working with U.S. buyers to ensure that no user data would be accessible to the Chinese government. That is one of the proposals being considered as the April 5 deadline for a deal approaches, Bloomberg reported Tuesday (March 18). The proposal would leave TikTok’s algorithms in Chinese hands while ensuring that a new U.S. version of the app would not have a back door that could be exploited by the Chinese government, according to the report. However, it would not address U.S. concerns that China could use the app to spread propaganda, the report said. The report also said it is not clear what would make the security precautions of this proposal different from an existing partnership called Project Texas in which Oracle works with TikTok to secure U.S. user data. The proposal is tentative, the details could change, and any deal would require approval from the White House, from TikTok parent company ByteDance and from the Chinese government, per the report. Politico reported Sunday (March 16) that Oracle was in “advanced” talks to run TikTok but that there were still concerns about the role the video sharing app’s Chinese founders would play in its future in the U.S. Three bidders for TikTok’s U.S. operations are publicly known, according to Tuesday’s Bloomberg report. They include a group led by billionaire Frank McCourt and Reddit co-founder Alexis Ohanian, a group that includes tech entrepreneur Jesse Tinsley and YouTube star MrBeast, and a merger offer by Perplexity AI. Other possible bidders have been rumored or suggested, per the report. Vice President JD Vance, who is overseeing the Trump administration’s discussions on the future of TikTok, told NBC News on March 14 that he expects a deal to be made that will keep the app operating in the U.S. while also protecting national security, according to the report. A U.S. law required TikTok to be sold or banned by Jan. 19 but President Donald Trump extended the deadline upon taking office on Jan. 20. The post Proposed TikTok Solution Would Have Oracle Provide Data Security appeared first on PYMNTS.com.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4343932657048242616",
        "title": "Oracle weighs small stake and security backstop for TikTok deal: report",
        "url": "https://seekingalpha.com/news/4421836-oracle-weighs-small-stake-and-security-backstop-for-tiktok-deal-report",
        "site": "seekingalpha.com",
        "time": 1742316284000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8309130401101752322",
        "title": "Sources: Oracle is weighing a TikTok proposal that would have it provide security assurances and take a small stake while leaving the algorithm in Chinese hands (Bloomberg)",
        "url": "http://www.techmeme.com/250318/p27#a250318p27",
        "site": "techmeme.com",
        "time": 1742315101000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Bloomberg: Sources: Oracle is weighing a TikTok proposal that would have it provide security assurances and take a small stake while leaving the algorithm in Chinese hands — - Plan emerges as deadline nears for deal to save TikTok in US — Oracle would offer security guarantee if China keeps algorithm",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7630545136592935386",
        "title": "Oracle Weighs Security Backstop, Small Stake to Land TikTok Deal",
        "url": "https://www.bloomberg.com/news/articles/2025-03-18/oracle-weighs-security-backstop-small-stake-to-land-tiktok-deal",
        "site": "bloomberg.com",
        "time": 1742313464000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "4343932657048242616"
        ],
        "description": "Oracle Corp. is weighing a proposal for a sale of TiKTok’s US operations that would have it provide security assurances and take a small stake in a new American entity while potentially leaving the app’s influential algorithm in Chinese hands, according to people familiar with the matter. President Donald Trump signed a series of executive orders on Jan. 20, his first day in office, including a measure granting TikTok additional time to find a buyer and avoid a US ban.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7171857873961417736",
        "title": "Oracle announces $5bn UK investment plan",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-announces-5bn-uk-investment-plan/",
        "site": "datacenterdynamics.com",
        "time": 1742225411000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Company says cash will expand OCI footprint in the UK",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7856187049266342319",
        "title": "Oracle in ‘Advanced’ Talks to Take Over TikTok",
        "url": "https://www.pymnts.com/acquisitions/2025/oracle-in-advanced-talks-to-take-over-tiktok/",
        "site": "pymnts.com",
        "time": 1742209430000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "2718789175419524945",
            "2881002586911596004"
        ],
        "description": "Software firm Oracle is reportedly in talks with the White House to run TikTok. That’s according to a report Sunday (March 16) by Politico, which notes that there’s still a roadblock to the deal: concerns about the role TikTok’s Chinese founders will play in the video sharing app’s future in the U.S. Sources told the […] The post Oracle in ‘Advanced’ Talks to Take Over TikTok appeared first on PYMNTS.com. Software firm Oracle is reportedly in talks with the White House to run TikTok. That’s according to a report Sunday (March 16) by Politico, which notes that there’s still a roadblock to the deal: concerns about the role TikTok’s Chinese founders will play in the video sharing app’s future in the U.S. Sources told the news outlet that Vice President JD Vance and national security adviser Mike Waltz are leading the negotiations on behalf of President Donald Trump, with one source describing these discussions as being in the advanced stages. According to Politico, one of the sources said the deal would require the government to rely on Oracle to oversee the data of American users and make sure the Chinese government doesn’t have a backdoor to it — a promise this source warned would be impossible to uphold. “If the Oracle deal moves forward, you still have this [algorithm] controlled by the Chinese. That means all you are doing is saying ‘trust Oracle’ to disseminate the data and guarantee there is no ‘back door’ to the data,” that person told Politico. For example, if TikTok’s algorithm isn’t entirely rebuilt by its American owner or if TikTok’s Beijing-based parent firm ByteDance maintains a role in its operations, the algorithm could still have vulnerabilities that could be exploited by the Chinese government, the report said. The proposed deal follows an effort from 2023 dubbed “Project Texas” in which TikTok gave Oracle access to its algorithm, source code and content moderation materials in a bid to ease national security concerns. But those concerns were never eased, leading Congress to pass legislation last year requiring ByteDance to find a new owner for TikTok or find a new owner for the popular app by Jan. 19. That deadline came and went with no deal, leading TikTok to briefly go dark. Then Trump took office and halted the ban, giving ByteDance until April 5 to find a new owner for TikTok. Oracle’s name had been floated as a possible owner soon after Trump extended the deadline. Last week, the president said TikTok had interest from four potential buyers. Writing about the ban earlier this year, PYMNTS noted the impact TikTok can have on driving revenue for businesses and entrepreneurs who use it to sell their wares. Research by PYMNTS Intelligence shows that nearly 80% of millennials and Gen Z consumers turn to social media for financial advice, while shoppers from Generation Z are 117% more likely to purchase products from influencers. The post Oracle in ‘Advanced’ Talks to Take Over TikTok appeared first on PYMNTS.com.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7313524551954542308",
        "title": "What We Know About Trump’s TikTok Deal—As Reports Suggest Oracle Could Take Lead Role",
        "url": "https://www.forbes.com/sites/alisondurkee/2025/03/16/what-we-know-about-trumps-tiktok-deal-as-reports-suggest-oracle-could-take-lead-role/",
        "site": "forbes.com",
        "time": 1742159203000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "1801076829068967181"
        ],
        "description": "Vice President JD Vance told reporters Friday there will “almost certainly” be some kind of agreement before Trump’s block on the TikTok ban expires April 5. Vice President JD Vance told reporters Friday there will “almost certainly” be some kind of agreement before Trump’s block on the TikTok ban expires April 5.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2881002586911596004",
        "title": "White House looking closely at Oracle deal to operate TikTok: report",
        "url": "https://seekingalpha.com/news/4421043-white-house-looking-closely-at-oracle-deal-to-operate-tiktok-report",
        "site": "seekingalpha.com",
        "time": 1742156566000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3571340774881293417",
        "title": "F1's Oracle Red Bull Racing expands use of Oracle cloud and AI services",
        "url": "https://www.datacenterdynamics.com/en/news/f1s-oracle-red-bull-racing-expands-use-of-oracle-cloud-and-ai-services/",
        "site": "datacenterdynamics.com",
        "time": 1742115603000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "2025 season sees racing team ramp up use of OCI",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "8444681434046270214",
        "title": "BI Weekend: Oracle, Kohl’s Earnings, CERAWeek (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-03-14/bi-weekend-oracle-kohl-s-earnings-ceraweek-podcast",
        "site": "bloomberg.com",
        "time": 1741975208000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 37:26 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-445007817091053032",
        "title": "Oracle considers Indonesian cloud region in Batam - report",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-considers-indonesian-cloud-region-in-batam-report/",
        "site": "datacenterdynamics.com",
        "time": 1741960999000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Company latest to look at Nongsa Digital Park",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3669944625647661950",
        "title": "Oracle targets Indonesia’s Batam Island for new cloud center - report",
        "url": "https://seekingalpha.com/news/4420571-oracle-targets-indonesias-batam-island-for-new-cloud-center---report",
        "site": "seekingalpha.com",
        "time": 1741936646000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "3753149710549708060",
        "title": "Oracle Said to Weigh Data Center on Indonesia’s Batam Island",
        "url": "https://www.bloomberg.com/news/articles/2025-03-14/oracle-said-to-weigh-data-center-on-indonesia-s-batam-island",
        "site": "bloomberg.com",
        "time": 1741925453000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle Corp. is in discussions with Indonesia’s government to establish a cloud services center in the country, people familiar with the matter said, as the US technology giant looks to expand its data center footprint in Southeast Asia. The Oracle offices in Redwood City, California, US, on Monday, May 15, 2023. Oracle Corp. is expected to release earnings figures on June 13. Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-5275137155312345104",
        "title": "Oracle is reportedly a top choice for helping run TikTok",
        "url": "https://techcrunch.com/2025/03/13/oracle-is-reportedly-a-top-choice-for-storing-u-s-tiktok-user-data/",
        "site": "techcrunch.com",
        "time": 1741895707000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "TikTok has until April to finalize a sale to a U.S.-based buyer, yet uncertainties about the future of the short-form video app remain. However, a new report has emerged, suggesting that Oracle is the leading candidate to serve as the cloud technology partner for managing TikTok in the U.S., according to The Information. Sources including […] © 2024 TechCrunch. All rights reserved. For personal use only.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6175576587462017094",
        "title": "Sources: Oracle is a leading contender to help run TikTok US; ByteDance management prefers Oracle but wants to retain a hands-on role with TikTok's operations (The Information)",
        "url": "http://www.techmeme.com/250313/p26#a250313p26",
        "site": "techmeme.com",
        "time": 1741876201000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "8611111144941009531",
            "-2924342779561437077"
        ],
        "description": "The Information: Sources: Oracle is a leading contender to help run TikTok US; ByteDance management prefers Oracle but wants to retain a hands-on role with TikTok's operations — Oracle has emerged as a leading contender to help run TikTok as part of a deal President Donald Trump is orchestrating to satisfy …",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4414735186685109449",
        "title": "Oracle yet to sign Stargate contract, Ellison says deal is coming \"fairly soon\"",
        "url": "https://www.datacenterdynamics.com/en/news/oracle-yet-to-sign-stargate-contract-ellison-says-deal-is-coming-fairly-soon/",
        "site": "datacenterdynamics.com",
        "time": 1741784537000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Company has $130bn contracted revenue in the pipeline without Stargate",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4331709424309166290",
        "title": "Can Oracle Stock Fall To $110?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/03/12/can-oracle-stock-fall-to-110/",
        "site": "forbes.com",
        "time": 1741782304000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "This represents a 6% year-over-year increase in sales and 4% growth in earnings. This represents a 6% year-over-year increase in sales and 4% growth in earnings.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6412230067832551149",
        "title": "Oracle won some big cloud contracts. Here’s why its stock is falling.",
        "url": "https://www.marketwatch.com/story/oracle-won-some-big-cloud-contracts-heres-why-its-stock-is-falling-ec29af53?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1741710900000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "427841530687440462"
        ],
        "description": "Oracle Corp. regaled Wall Street on Monday with talk about the future, enormous demand and some very large cloud-services contracts, but its stock continued a downward trend over concerns about growing costs associated with building out more data centers.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-5991082359889467643",
        "title": "Oracle’s AI Boom Is Coming, It’s Just Not Here Yet",
        "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-nasdaq-sp500-03-11-2025/card/oracle-s-ai-boom-is-coming-it-s-just-not-here-yet-KlrFoFZLXtyRz8jlTSSe?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1741707463000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "427841530687440462",
        "title": "Oracle Stock Drops After Earnings Miss. It Is Making Big Cloud Deals.",
        "url": "https://www.barrons.com/articles/oracle-earnings-stock-price-126d3e9a?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1741697040000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-213184432537463083",
        "title": "Oracle's bookings, cloud strength help Wall Street to look past choppy Q3",
        "url": "https://seekingalpha.com/news/4419277-oracles-bookings-cloud-strength-help-wall-street-to-look-past-choppy-q3",
        "site": "seekingalpha.com",
        "time": 1741693972000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5576293064832745569",
        "title": "Stocks to Watch Tuesday: Tesla, Oracle, Delta, Illumina",
        "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-nasdaq-sp500-03-11-2025/card/stocks-to-watch-tuesday-tesla-oracle-delta-nvidia-EVSvFpxUXyGjbSzs1XwD?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1741684713000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4710156458663686492",
        "title": "Oracle targets fiscal 2027 revenue growth of 20% driven by cloud and AI expansions",
        "url": "https://seekingalpha.com/news/4419146-oracle-targets-fiscal-2027-revenue-growth-of-20-percent-driven-by-cloud-and-ai-expansions",
        "site": "seekingalpha.com",
        "time": 1741650481000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "9043078406719108670",
        "title": "Oracle Q3 2025 Earnings: CEO Catz Calls AI A ‘Motivator’ For Cloud Adoption",
        "url": "https://www.crn.com/news/cloud/2025/oracle-q3-2025-earnings-ceo-catz-calls-ai-a-motivator-for-cloud-adoption",
        "site": "crn.com",
        "time": 1741649040000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle executives Larry Ellison and Safra Catz talked cloud, AI agents, databases and more on Q3 2025 earnings call.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-6637829989621541065",
        "title": "Oracle shares turn lower as quarterly revenue miss overshadows cloud deals",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=6e3c36a1-27de-471f-b1b5-cda9431c5a0a&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1741647605000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4327462300015368788",
        "title": "Markets Sink on Eco Fears, Oracle Beats Revenue Estimates, More",
        "url": "https://www.bloomberg.com/news/audio/2025-03-10/markets-sink-on-eco-fears-oracle-beats-revenue-estimates-more",
        "site": "bloomberg.com",
        "time": 1741643629000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 5:00 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2624525220006240680",
        "title": "Oracle misses on earnings but touts data center growth from AI",
        "url": "https://www.cnbc.com/2025/03/10/oracle-orcl-q3-earnings-report-2025.html",
        "site": "cnbc.com",
        "time": 1741640228000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle missed analysts' expectations for the third quarter.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6057964764333845980",
        "title": "Oracle shares gain as investors focus on cloud deals, overlooking quarterly revenue miss",
        "url": "https://www.marketwatch.com/story/oracle-shares-gain-as-investors-focus-on-cloud-deals-overlooking-quarterly-revenue-miss-0d88e168?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1741639800000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-6637829989621541065"
        ],
        "description": "Oracle Corp. shares were up in after-hours trading Monday, as investors appeared to initially overlook the software giant’s disappointing quarterly revenue, much of it from a cloud-services miss, and instead focused on the large number of big cloud-computing contracts in the future.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-3403426781994735144",
        "title": "Oracle reports Q3 revenue grew 6% YoY to $14.13B, vs. $14.39B est., and cloud revenue rose 23% YoY to $6.2B (Zaheer Kachwala/Reuters)",
        "url": "http://www.techmeme.com/250310/p21#a250310p21",
        "site": "techmeme.com",
        "time": 1741639203000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Zaheer Kachwala / Reuters: Oracle reports Q3 revenue grew 6% YoY to $14.13B, vs. $14.39B est., and cloud revenue rose 23% YoY to $6.2B — Oracle (ORCL.N) missed Wall Street expectations for third-quarter revenue on Monday, weighed down by softer enterprise spending on its cloud infrastructure services, and strong competition from larger players.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-5626994396362697002",
        "title": "Tech Meltdown Hits Stocks, Apple's Overhaul, Oracle Misses, More",
        "url": "https://www.bloomberg.com/news/audio/2025-03-10/tech-meltdown-hits-stocks-apple-s-overhaul-oracle-misses-more",
        "site": "bloomberg.com",
        "time": 1741638102000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Source: Bloomberg, 4:59 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-5859889903540258419",
        "title": "Oracle Gives Strong Outlook on Cloud, Fueling Stargate Optimism",
        "url": "https://www.bloomberg.com/news/articles/2025-03-10/oracle-gives-strong-outlook-on-cloud-fueling-stargate-optimism",
        "site": "bloomberg.com",
        "time": 1741638064000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Oracle Corp. reported a surge in bookings and gave a revenue forecast for the fiscal year beginning in June that topped estimates, fueling confidence that it is gaining large customers for its cloud infrastructure business. Oracle Corp. campus in Redwood City, California.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8836299778312759259",
        "title": "Oracle Non-GAAP EPS of $1.47 misses by $0.02, revenue of $14.13B misses by $260M",
        "url": "https://seekingalpha.com/news/4419067-oracle-non-gaap-eps-of-1_47-misses-by-0_02-revenue-of-14_13b-misses-by-260m",
        "site": "seekingalpha.com",
        "time": 1741637203000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "7192371143133978223",
        "title": "Oracle Earnings, Inflation, Consumer Sentiment: What to Watch This Week in Markets",
        "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-nasdaq-sp500-03-10-2025/card/oracle-earnings-inflation-and-consumer-sentiment-data-what-to-watch-this-week-in-markets-veGxp8VExGMPQPvjlXAU?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1741609573000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4442025572600197516",
        "title": "These Stocks Are Moving the Most Today: DoorDash, Nvidia, Tesla, MicroStrategy, Cognizant, Oracle, and More",
        "url": "https://www.barrons.com/articles/stock-market-movers-4853479f?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1741598160000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-4789363908401576297",
        "title": "Top India Drugmaker Sun to Buy US Oncology Firm for $355 Million",
        "url": "https://www.bloomberg.com/news/articles/2025-03-10/top-india-drugmaker-sun-to-buy-us-oncology-firm-for-355-million",
        "site": "bloomberg.com",
        "time": 1741578344000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Sun Pharmaceutical Industries Ltd. has agreed to buy US-based immunotherapy and oncology firm Checkpoint Therapeutics Inc. for an upfront payment of $355 million, as India’s largest drugmaker bolsters its specialty therapy portfolio.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "1407196831847445261",
        "title": "Inflation and tariffs might scare shoppers. Have they scared CEOs?",
        "url": "https://www.marketwatch.com/story/inflation-and-tariffs-might-scare-shoppers-have-they-scared-ceos-0e5c199f?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1741517940000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Executives are talking a lot about tariffs, but little about a recession. Adobe, Oracle and more retailers report during the week.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-8601321243129083140",
        "title": "Cramer's week ahead: New inflation data, earnings from Oracle and Adobe",
        "url": "https://www.cnbc.com/2025/03/07/cramers-week-ahead-new-inflation-data-earnings-from-oracle-and-adobe.html",
        "site": "cnbc.com",
        "time": 1741392453000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "CNBC's Jim Cramer told investors what to look for on Wall Street next week.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-2168256420824662869",
        "title": "Catalyst Watch: Oracle earnings, crypto swings, CPI print, and more tariff salvos",
        "url": "https://seekingalpha.com/news/4418587-catalyst-watch-oracle-earnings-crypto-swings-cpi-print-and-more-tariff-salvos",
        "site": "seekingalpha.com",
        "time": 1741377611000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2734314626779400264",
        "title": "Oracle Q3 Preview: Analysts see stable cloud infra growth, Stargate remains in focus",
        "url": "https://seekingalpha.com/news/4418641-oracle-q3-preview-analysts-see-stable-cloud-infra-growth-stargate-remains-in-focus",
        "site": "seekingalpha.com",
        "time": 1741373870000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "6834512673985423606",
        "title": "How ORCL Stock Might React To Upcoming Earnings?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/03/07/how-orcl-stock-might-react-to-upcoming-earnings/",
        "site": "forbes.com",
        "time": 1741358762000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "The company has $421 Bil in current market capitalization. The company has $421 Bil in current market capitalization.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "5822138240745834249",
        "title": "OpenAI and Oracle to deploy 64,000 GB200 GPUs at Stargate Abilene data center by 2026 – report",
        "url": "https://www.datacenterdynamics.com/en/news/openai-and-oracle-to-deploy-64000-gb200-gpus-at-stargate-abilene-data-center-by-2026-report/",
        "site": "datacenterdynamics.com",
        "time": 1741349046000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "Chips will be installed in phases, with 16,000 expected to be in place by end of summer 2024",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "4995007183653905131",
        "title": "Oracle's Federal Electronic Health Record experienced a nation-wide outage",
        "url": "https://www.cnbc.com/2025/03/06/oracles-federal-electronic-health-record-suffered-nation-wide-outage-.html",
        "site": "cnbc.com",
        "time": 1741300618000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "orcl"
        ],
        "similar_stories": [
            "-1108293369046845473"
        ],
        "description": "Oracle's federal electronic health record experienced a nation-wide outage on Tuesday, the U.S. Department of Veterans Affairs confirmed to CNBC.",
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "-3922470384193407830",
        "title": "Trump says would 'probably' extend TikTok deadline, China 'to play a role' in deal for app | $BDNCE $WMT $MSFT $ORCL $RBLX",
        "url": "https://seekingalpha.com/news/4418232-trump-says-would-probably-extend-tiktok-deadline-china-to-play-a-role-in-deal-for-app",
        "site": "seekingalpha.com",
        "time": 1741297037000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "orcl"
        ],
        "tickers": [
            "orcl"
        ]
    },
    {
        "id": "2442757154750475338",
        "title": "Software Stock Flashing Bull Signal Before Earnings",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/03/06/software-stock-flashing-bull-signal-before-earnings/",
        "site": "forbes.com",
        "time": 1741289533000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "orcl"
        ],
        "description": "ORCL has pulled back to its 200-day moving average, a historically bullish trendline on the charts. The company will report earnings next week. ORCL has pulled back to its 200-day moving average, a historically bullish trendline on the charts. The company will report earnings next week.",
        "tickers": [
            "orcl"
        ]
    }
]