[
    {
        "id": "1845020645909908221",
        "title": "Eaton makes a move outside of the data center — plus, what's new with Abbott Labs",
        "url": "https://www.cnbc.com/2025/06/16/eaton-makes-a-move-outside-of-the-data-center-plus-whats-new-with-abbott-labs.html",
        "site": "cnbc.com",
        "time": 1750101175000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "5632367811483800291",
        "title": "Abbott Laboratories declares $0.59 dividend | $ABT",
        "url": "https://seekingalpha.com/news/4458078-abbott-laboratories-declares-0_59-dividend",
        "site": "seekingalpha.com",
        "time": 1749829997000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "6380119354658481523",
        "title": "Tandem, Abbott in deal to combine insulin delivery with glucose-ketone sensor",
        "url": "https://seekingalpha.com/news/4456901-tandem-abbott-deal-combine-insulin-delivery-glucose-ketone-sensor",
        "site": "seekingalpha.com",
        "time": 1749562585000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "8424914145256450010",
        "title": "An Abbott competitor drops out — plus, a special circumstance for Nvidia earnings",
        "url": "https://www.cnbc.com/2025/05/28/abbott-competitor-drops-out-special-circumstance-for-nvidia-earnings.html",
        "site": "cnbc.com",
        "time": 1748457709000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "1906145465049844881",
        "title": "Texas signs into law online saftey bill reportedly opposed by Apple’s Tim Cook",
        "url": "https://techcrunch.com/2025/05/27/texas-signs-into-law-online-saftey-bill-reportedly-opposed-by-apples-tim-cook/",
        "site": "techcrunch.com",
        "time": 1748376686000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Gov. Abbott of Texas officially signed into law the online child safety bill that would require Apple and Google’s app stores to verify the age of their users and obtain approval from parents before minors download or make in-app purchases. The law will go into effect on January 1st. The bill made headlines last week […]",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-8786420567555430541",
        "title": "Abbott gets FDA nod for Tendyne valve for mitral valve disease",
        "url": "https://seekingalpha.com/news/4452567-abbott-gets-fda-nod-for-tendyne-valve-for-mitral-valve-disease",
        "site": "seekingalpha.com",
        "time": 1748356109000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "7922102655406830799",
        "title": "2025 Could Be The Year Texas Ends Taxpayer-Funded Lobbying",
        "url": "https://www.forbes.com/sites/patrickgleason/2025/05/20/2025-could-be-the-year-texas-ends-taxpayer-funded-lobbying/",
        "site": "forbes.com",
        "time": 1747788067000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "abt"
        ],
        "description": "School choice might not be the only major reform that finally gets to Governor Abbott’s desk this year, after being stymied in the House for the better part of a decade. School choice might not be the only major reform that finally gets to Governor Abbott’s desk this year, after being stymied in the House for the better part of a decade.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "7535674246210301516",
        "title": "Quinta Brunson isn't surprised by her success: 'I made every single move in my life so that this could happen to me'",
        "url": "https://www.cnbc.com/2025/05/17/quinta-brunson-isnt-surprised-by-her-success-i-was-very-determined.html",
        "site": "cnbc.com",
        "time": 1747494001000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "abt"
        ],
        "description": "The 'Abbott Elementary' creator has won multiple Emmys, a Golden Globe and even a Peabody Award.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "8225882176208786334",
        "title": "X Advertisers From Nestle to Shell Deny Musk’s Boycott Claims",
        "url": "https://www.bloomberg.com/news/articles/2025-05-15/x-advertisers-from-nestle-to-shell-deny-musk-s-boycott-claims",
        "site": "bloomberg.com",
        "time": 1747336381000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Nestle SA, Shell PLC, Abbott Laboratories and a handful of other companies say they didn’t coordinate an advertising boycott of Elon Musk’s X following the billionaire’s purchase of the social media platform, refuting claims made in a lawsuit. The X app in the Apple App Store on a smartphone arranged in Germantown, New York, US, on Thursday, April 24, 2025. Elon Musk's X Holdings Corp. is evolving from a social media platform powered by mainstream advertisers to one betting on dollars generated from artificial intelligence and subscriptions, a change that appears to have buoyed its revenue lately. Photographer: Gabby Jones/Bloomberg",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-1146821230825535361",
        "title": "MotoAmerica is Changing Concussion Safety",
        "url": "https://www.bloomberg.com/news/videos/2025-05-15/motoamerica-is-changing-concussion-safety-video",
        "site": "bloomberg.com",
        "time": 1747321182000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "abt"
        ],
        "description": "The world's fastest sport is making a major shift into safety. MotoAmerica is the first sports organization to use Abbott's rapid blood test for concussion evaluation. It will be on site for all MotoAmerica races this year. The test is able to identify mild traumatic brain injuries in 15 minutes. Richard Varner, MotoAmerica Chief Financial Officer and Carl Price, MD MotoAmerica's Chief Medical Officer joined Bloomberg Open Interest to talk about the innovation and how it could revolutionize the health of athletes. (Source: Bloomberg)",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-6783435182362241431",
        "title": "Texas Sweetens Pitch to CEOs, Boards With New State Protections",
        "url": "https://www.bloomberg.com/news/articles/2025-05-14/texas-sweetens-pitch-to-ceos-boards-with-new-state-protections",
        "site": "bloomberg.com",
        "time": 1747236290000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Texas is trying to entice more companies to ditch Delaware and incorporate in the state, just like Tesla Inc. and Space Exploration Technologies Corp. did last year at the behest of Elon Musk. Greg Abbott",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "1341176383438294806",
        "title": "SA analyst downgrades: QDEL, AMCX, PLYM, DAY | $QDEL $AMCX $PLYM $DAY $ABT",
        "url": "https://seekingalpha.com/news/4447290-sa-analyst-downgrades-qdel-amcx-plym-day",
        "site": "seekingalpha.com",
        "time": 1747150175000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-4609363553174900955",
        "title": "Trump administration to review nutrients in baby formula | $ABT $PRGO $NSRGY $RBGLY $RBGPF",
        "url": "https://seekingalpha.com/news/4447268-us-to-review-nutrients-baby-formula",
        "site": "seekingalpha.com",
        "time": 1747147806000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-6856630039630032405",
        "title": "Abbott gains after upcoming baby formula case thrown out | $ABT $RBGPF",
        "url": "https://seekingalpha.com/news/4440598-abbott-gains-after-upcoming-infant-baby-formula-case-thrown-out",
        "site": "seekingalpha.com",
        "time": 1746216870000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "6363088586698250812",
        "title": "Texas Maps $1 Billion Voucher Plan as Schools Face Budget Crunch",
        "url": "https://www.bloomberg.com/news/articles/2025-05-02/texas-maps-1-billion-voucher-plan-as-schools-face-budget-crunch",
        "site": "bloomberg.com",
        "time": 1746194423000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Abbott poised to sign school-choice bill after years-long quest Woodson school district, which serves around 160 students about 150 miles west of Dallas, relies on barebones staffing, with many employees handling multiple roles.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "1877824181127900754",
        "title": "Abbott signs agreement with Epic for CGM data integration",
        "url": "https://seekingalpha.com/news/4437044-abbott-signs-agreement-with-epic-for-cgm-data-integration",
        "site": "seekingalpha.com",
        "time": 1745943961000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-3176570669286470467",
        "title": "Health Care Sector In 2025: Buy Abbott Labs",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/28/health-care-sector-in-2025-buy-abbott-labs/",
        "site": "forbes.com",
        "time": 1745834400000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "abt"
        ],
        "description": "The health care sector has lagged but this picture is improving. One of the strongest stocks is Abbott Labs. Superior relative strength is the key factor. The health care sector has lagged but this picture is improving. One of the strongest stocks is Abbott Labs. Superior relative strength is the key factor.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "5401470949437290784",
        "title": "Medtronic seeks FDA nod for insulin pump developed with Abbott",
        "url": "https://seekingalpha.com/news/4435053-medtronic-seeks-fda-nod-insulin-pump",
        "site": "seekingalpha.com",
        "time": 1745510685000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "943926680584403720",
        "title": "The 13 best things to stream this weekend, from the season 1 finale of 'Daredevil: Born Again' to the horror-comedy 'Companion'",
        "url": "https://www.businessinsider.com/best-shows-movies-streaming-netflix-max-prime-april-18-2025",
        "site": "businessinsider.com",
        "time": 1744992481000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Warner Bros. Pictures; BI\"Daredevil: Born Again\" and \"Abbott Elementary\" released their season finales this week.Netflix's new show \"Ransom Canyon\" offers a Western-set story for fans of \"Yellowstone.\"\"Companion,\" starring Sophie Thatcher and Jack Quaid, is a love story with a horror twist.The latest seasons of \"Daredevil: Born Again\" and \"Abbott Elementary\" ended this week, but there are plenty of new additions to discover on streamers.If you're a fan of shows like \"Yellowstone\" and \"Virgin River,\" Netflix's new Western series \"Ransom Canyon\" might be your speed. For a different kind of love story, watch the 2025 sci-fi movie \"Companion,\" starring \"Yellowjackets\" actor Sophie Thatcher and \"The Boys\" favorite Jack Quaid.Here's a complete rundown of all the best movies, shows, and documentaries to stream this weekend, broken down by what kind of entertainment you're looking for.Season one of \"Daredevil: Born Again\" ended this week.Charlie Cox in \"Daredevil: Born Again.\"Giovanni Rufino/Marvel Studios/DisneySeven years after Netflix canceled the Marvel series \"Daredevil,\" lawyer-vigilante Matt Murdock (Charlie Cox) returned in the Disney+ series \"Daredevil: Born Again,\" much to the delight of fervent fans who rallied for the show to be saved.The nine-episode season concluded on Tuesday, but the titular character's feud with the mob boss turned mayor Wilson Fisk/Kingpin (Vincent D'Onofrio) is far from over and will continue when the show returns for season two.Streaming on: Disney+\"Abbott Elementary\" aired its season four finale.Lisa Ann Walter, Sheryl Lee Ralph, Quinta Brunson, Chris Perfetti, and Janelle James in season four of \"Abbott Elementary.\"Gilles Mingasson/DisneyLike past seasons, the season four finale of \"Abbott Elementary\" centers on the teachers taking the students on an end-of-year field trip. This time, they visit Philadelphia's Please Touch Museum, where Janine (Quinta Brunson) meets and bonds with someone close to Gregory (Tyler James Williams).Streaming on: HuluSeason three of the fantasy series \"The Wheel of Time\" also wrapped up this week.Josha Stradowski as Rand al'Thor in season three of \"The Wheel of Time.\"Prime VideoThe latest season of \"The Wheel of Time\" ended with an action-packed finale that featured some characters meeting untimely deaths, while Rand al'Thor (Josha Stradowski) finally chose between good and evil.Streaming on: Prime VideoFor a mind-bending series, watch Rami Malek in the psychological thriller \"Mr. Robot.\"Rami Malek in \"Mr. Robot.\"USABefore his Oscar-winning performance as Queen front man Freddie Mercury in \"Bohemian Rhapsody,\" Rami Malek earned critical acclaim for his role as cybersecurity engineer Elliot Alderson, who gets recruited by a hacktivist group to help take down corporate corruption. The four-season show ran on USA from 2014 to 2019 but you can stream it for free in its entirety on Tubi.Streaming on: TubiThe '60s-set comedy \"Government Cheese\" is equal parts grounded and absurd.David Oyelowo in \"Government Cheese.\"Apple TV+\"Selma\" star David Oyelowo plays Hampton Chambers, a man who's released from prison after two years. Eager to get a second chance and set his family on a path to success, he devises a self-sharpening drill that he hopes to sell to an aerospace company — but his plan is derailed by a debt he owes to a crime family.Streaming on: Apple TV+Ramy Youssef brings his comedic style to \"#1 Happy Family USA.\"Ramy Youssef as Rumi Hussein in the animated series \"#1 Happy Family USA.\"Prime VideoComedian and show cocreator Ramy Youssef tackles what it means to be a patriotic Muslim family in post-9/11 America in the early 2000s in this new eight-episode animated series packed with heart and humor.Streaming on: Prime VideoCrime-fighting duo Elliot Stabler and Olivia Benson reunite in season five of \"Law & Order: Organized Crime.\"Mariska Hargitay as Olivia Benson in season five of \"Law & Order: Organized Crime.\"Virginia Sherwood/PeacockChristopher Meloni and Mariska Hargitay reprised their roles as Elliot and Olivia in the two-episode premiere of season five of \"Law & Order: Organized Crime.\" New episodes are released weekly and tackle everything from domestic terrorism to cross-border smuggling.Streaming on: Peacock\"Vanderpump Rules\" spinoff \"The Valley\" is back this week.The cast of season two of \"The Valley\" in a promotional image for season two.BravoJax Taylor, Brittany Cartwright, and the rest of the show's reality TV stars are back for more suburban drama and memorable moments, like Kristen Doute and Luke Broderick's engagement and the aftermath of Taylor and Cartwright's separation after 10 years together.Expect appearances from \"Vanderpump Rules\" alums Lala Kent, Tom Schwartz, Scheana Shay, and Brock Davies, too.Streaming on: PeacockFor a romantic drama, watch the Western series \"Ransom Canyon.\"Minka Kelly in \"Ransom Canyon.\"Anna Kooris/NetflixNetflix continues expanding its collection of Westerns with \"Ransom Canyon,\" a new series based on author Jodi Thomas' book series of the same name.The Texas-set show stars Josh Duhamel as Staten Kirkland, a rancher fighting to protect his land, and Minka Kelly as Quinn O'Grady, a longtime friend of Staten's who returns home after living in New York. Expect plenty of romance and horseback riding in the 10-episode season.Streaming on: Netflix\"Companion\" offers a gorier love story.Sophie Thatcher as Iris and Jack Quaid as Josh in \"Companion.\"Warner Bros. PicturesHailed as \"a wily, well-oiled scary movie machine\" with a 94% critics score on Rotten Tomatoes, \"Companion\" centers on Josh (Jack Quaid) and Iris (Sophie Thatcher), his made-to-order, programmable AI companion who goes rogue on a weekend getaway to a remote cabin.Streaming on: Max\"Euphoria\" and \"Saltburn\" actor Jacob Elordi stars in the new drama series \"Narrow Road to the Deep North.\"Jacob Elordi in \"Narrow Road to the Deep North.\"Ingvar Kenne/Curio/Sony Pictures TelevisionThe five-part limited series based on Richard Flanagan's novel of the same name follows WWII hero Dorrigo Evans (Jacob Elordi) as he recalls being held captive in a Japanese prisoner of war camp, his passionate affair with a woman named Amy (Odessa Young), and his time spent as a surgeon.Streaming on: Prime Video\"The Carters: Hurts to Love You\" explores the tumultuous lives of late singer Aaron Carter, Backstreet Boys member Nick Carter, and their family dynamic.Angel Carter Conrad and Aaron Carter in \"The Carters.\"Carter Family Archive/CBS/Paramount+The two-part documentary chronicles Aaron and Nick Carter's ascents to stardom and how fame, money, addiction, and mental health issues affected the Carter family.\"The Carters: Hurts to Love You\" features never-before-seen home videos, family photos, and interviews with the two surviving siblings of the original five, Nick Carter and Angel Carter Conrad.Streaming on: Paramount+After almost three years, the docu-comedy series \"The Rehearsal\" is back for season two.Nathan Fielder in season two of \"The Rehearsal.\"John P. Johnson/HBOThe HBO show centers on actor and comedian Nathan Fielder, who helps regular people prepare for big life moments by putting them in eccentric \"rehearsal\" scenarios and simulations that he designed.In a premise that feels weirdly eerie given recent aviation-related disasters, the six-episode second season of \"The Rehearsal\" focuses on the underlying causes of plane crashes.Streaming on: MaxRead the original article on Business Insider Warner Bros. Pictures; BI\"Daredevil: Born Again\" and \"Abbott Elementary\" released their season finales this week.Netflix's new show \"Ransom Canyon\" offers a Western-set story for fans of \"Yellowstone.\"\"Companion,\" starring Sophie Thatcher and Jack Quaid, is a love story with a horror twist.The latest seasons of \"Daredevil: Born Again\" and \"Abbott Elementary\" ended this week, but there are plenty of new additions to discover on streamers.If you're a fan of shows like \"Yellowstone\" and \"Virgin River,\" Netflix's new Western series \"Ransom Canyon\" might be your speed. For a different kind of love story, watch the 2025 sci-fi movie \"Companion,\" starring \"Yellowjackets\" actor Sophie Thatcher and \"The Boys\" favorite Jack Quaid.Here's a complete rundown of all the best movies, shows, and documentaries to stream this weekend, broken down by what kind of entertainment you're looking for.Season one of \"Daredevil: Born Again\" ended this week.Charlie Cox in \"Daredevil: Born Again.\"Giovanni Rufino/Marvel Studios/DisneySeven years after Netflix canceled the Marvel series \"Daredevil,\" lawyer-vigilante Matt Murdock (Charlie Cox) returned in the Disney+ series \"Daredevil: Born Again,\" much to the delight of fervent fans who rallied for the show to be saved.The nine-episode season concluded on Tuesday, but the titular character's feud with the mob boss turned mayor Wilson Fisk/Kingpin (Vincent D'Onofrio) is far from over and will continue when the show returns for season two.Streaming on: Disney+\"Abbott Elementary\" aired its season four finale.Lisa Ann Walter, Sheryl Lee Ralph, Quinta Brunson, Chris Perfetti, and Janelle James in season four of \"Abbott Elementary.\"Gilles Mingasson/DisneyLike past seasons, the season four finale of \"Abbott Elementary\" centers on the teachers taking the students on an end-of-year field trip. This time, they visit Philadelphia's Please Touch Museum, where Janine (Quinta Brunson) meets and bonds with someone close to Gregory (Tyler James Williams).Streaming on: HuluSeason three of the fantasy series \"The Wheel of Time\" also wrapped up this week.Josha Stradowski as Rand al'Thor in season three of \"The Wheel of Time.\"Prime VideoThe latest season of \"The Wheel of Time\" ended with an action-packed finale that featured some characters meeting untimely deaths, while Rand al'Thor (Josha Stradowski) finally chose between good and evil.Streaming on: Prime VideoFor a mind-bending series, watch Rami Malek in the psychological thriller \"Mr. Robot.\"Rami Malek in \"Mr. Robot.\"USABe",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "6737440304730506828",
        "title": "Abbott Labs shares surge on earnings and a big sign of confidence in the business",
        "url": "https://www.cnbc.com/2025/04/16/abbott-labs-shares-surge-on-earnings-and-a-big-sign-of-confidence-in-the-business.html",
        "site": "cnbc.com",
        "time": 1744824605000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Abbott's strong stock performance continued Wednesday after a first-quarter earnings beat and a guidance reaffirmation.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-1776645437606329857",
        "title": "Abbott signals 2025 sales growth driven by medtech pipeline and margin expansion",
        "url": "https://seekingalpha.com/news/4431714-abbott-signals-2025-sales-growth-driven-by-medtech-pipeline-and-margin-expansion",
        "site": "seekingalpha.com",
        "time": 1744817089000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "8528634267308360495",
        "title": "Abbott spikes as management addresses tariff concerns",
        "url": "https://seekingalpha.com/news/4431705-abbott-stock-spikes-tariff-concerns-ease",
        "site": "seekingalpha.com",
        "time": 1744816279000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-3003486297304042771",
        "title": "Abbott Labs sees demand for diabetes products jump, and the stock surges",
        "url": "https://www.marketwatch.com/story/abbott-labs-stock-slips-on-q1-sales-miss-0d53e019?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1744812060000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Abbott extended its long streak of earnings beats, and the stock surged to lead the S&P 500 index’s gainers.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-5175239839530805082",
        "title": "4 stocks to watch on Wednesday: ABT, TRV, GOOGL/GOOG and HTZ | $GOOG $ABT $TRV $GOOGL $HTZ",
        "url": "https://seekingalpha.com/news/4431633-4-stocks-to-watch-on-wednesday-abt-trv-googlgoog-and-htz",
        "site": "seekingalpha.com",
        "time": 1744810185000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "7935484937763106860",
        "title": "Abbott Labs Profit Jumps on Gains in Nutrition, Medical Devices",
        "url": "https://www.wsj.com/business/earnings/abbott-labs-profit-jumps-on-gains-in-nutrition-medical-devices-76c2611e?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1744806180000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-3088207281100076208",
        "title": "Abbott slips after Q1 revenue miss; guidance reaffirmed | $ABT $JNJ",
        "url": "https://seekingalpha.com/news/4431585-abbott-stock-slips-q1-revenue-miss",
        "site": "seekingalpha.com",
        "time": 1744805741000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-949976692261661152",
        "title": "Abbott Labs stock slips on Q1 sales miss",
        "url": "https://www.marketwatch.com/story/abbott-labs-stock-slips-on-q1-sales-miss-0d53e019?mod=mw_rss_marketpulse",
        "site": "marketwatch.com",
        "time": 1744804680000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-523057547831128081",
        "title": "Earnings Snapshot: Abbott Laboratories Q1 earnings beat; revenue misses estimate; reaffirms FY outlook",
        "url": "https://seekingalpha.com/news/4431493-earnings-snapshot-abbott-laboratories-q1-earnings-beat-revenue-misses-estimate-reaffirms-fy-outlook",
        "site": "seekingalpha.com",
        "time": 1744803882000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "3518086584945863028",
        "title": "Abbott in charts: Medical Devices sales up 10% Y/Y in Q1, down 3% sequentially",
        "url": "https://seekingalpha.com/news/4431588-abbott-in-charts-medical-devices-sales-up-10-yy-in-q1-down-3-sequentially",
        "site": "seekingalpha.com",
        "time": 1744803625000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-3390718755429100264",
        "title": "Abbott to Expand US Manufacturing as Tariffs Loom",
        "url": "https://www.bloomberg.com/news/articles/2025-04-16/abbott-to-build-new-us-manufacturing-with-tariff-threat-looming",
        "site": "bloomberg.com",
        "time": 1744803286000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Abbott Laboratories said it will make new investments in US manufacturing plants with the impact of tariffs on medical devices and diagnostics looming over the industry. An Abbott Nutrition distribution center in Columbus, Ohio, US, on Sunday, July 28, 2024. Abbott Laboratories is considering pulling infant formula for premature babies off the market, Chief Executive Officer Robert Ford said, amid investor concerns about lawsuits over its safety.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "3867078363506595827",
        "title": "Abbott Laboratories Non-GAAP EPS of $1.09 beats by $0.02, revenue of $10.36B misses by $60M",
        "url": "https://seekingalpha.com/news/4431583-abbott-laboratories-non-gaap-eps-of-1_09-beats-by-0_02-revenue-of-10_36b-misses-by-60m",
        "site": "seekingalpha.com",
        "time": 1744803084000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "9038355493741329623",
        "title": "Abbott's Q1 earnings in focus as analysts see path to beat amid business strength",
        "url": "https://seekingalpha.com/news/4431272-abbotts-q1-earnings-in-focus-as-analysts-see-path-to-beat-amid-business-strength",
        "site": "seekingalpha.com",
        "time": 1744734434000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "3049171199799119551",
        "title": "‘WrestleMania 41,’ Plus 8 Things to Watch on TV this Week",
        "url": "https://www.nytimes.com/2025/04/14/arts/television/wrestlemania-41-plus-8-things-to-watch-on-tv-this-week.html",
        "site": "nytimes.com",
        "time": 1744606807000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "abt"
        ],
        "description": "John Cena continues his farewell tour, and ‘Abbott Elementary’ concludes its fourth season. John Cena at WrestleMania XXX in 2014.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-781405305787129736",
        "title": "Beyond Paradise is taking a 'grittier' turn",
        "url": "https://www.bbc.com/news/articles/c70zzpkeze8o",
        "site": "bbc.com",
        "time": 1744358552000,
        "favicon_url": "https://static.tickertick.com/website_icons/bbc.com.ico",
        "tags": [
            "abt"
        ],
        "description": "It seems the fictional Devon town of Shipton Abbott is becoming a more dangerous place to live.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-1056425511706074552",
        "title": "Stryker, Boston Scientific down as new tariffs impact medtech industry | $JNJ $ABT $BSX $MDT $SYK",
        "url": "https://seekingalpha.com/news/4428476-stryker-boston-scientific-down-new-tariffs-impact-medtech-industry",
        "site": "seekingalpha.com",
        "time": 1743698530000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-89128748326763721",
        "title": "Trump unlikely to specify any pharma tariffs in ‘Liberation Day’ announcement: Reuters | $JNJ $ABT $PFE $MRK $AMGN",
        "url": "https://seekingalpha.com/news/4427313-trump-unlikely-to-specify-any-pharma-tariffs-in-liberation-day-announcement-reuters",
        "site": "seekingalpha.com",
        "time": 1743506017000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-9089535745705238761",
        "title": "Abbott Delays Calling a Special House Election. Democrats Cry Foul.",
        "url": "https://www.nytimes.com/2025/03/31/us/texas-house-seat.html",
        "site": "nytimes.com",
        "time": 1743456353000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Representative Hakeem Jeffries, the House minority leader, accused Gov. Greg Abbott of Texas of slow-walking a special election to hold the Republicans’ slim majority steady. Representative Sylvester Turner died on March 5 after less than two months in office. His seat in the 18th Congressional District has not been filled.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "6726698636350613080",
        "title": "Abbott gets FDA approval to begin trial of intravascular lithotripsy device",
        "url": "https://seekingalpha.com/news/4424117-abbott-gets-fda-approval-to-begin-trial-of-intravascular-lithotripsy-device",
        "site": "seekingalpha.com",
        "time": 1742824707000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "7125620682683519873",
        "title": "J.B. Moore, Producer of Seminal Hip-Hop Records, Dies at 81",
        "url": "https://www.nytimes.com/2025/03/20/arts/music/jb-moore-dead.html",
        "site": "nytimes.com",
        "time": 1742495646000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "abt"
        ],
        "description": "He was a magazine ad salesman when he and a colleague, Robert Ford, teamed with Kurtis Blow and helped break rap music into the mainstream.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "5194830013617751569",
        "title": "HHS to review nutrients, test for heavy metals in infant formula | $ABT $RBGPF $RBGLY",
        "url": "https://seekingalpha.com/news/4421830-rfk-jr-meet-execs-infant-formula-makers-abbott-reckitt-benckiser",
        "site": "seekingalpha.com",
        "time": 1742315420000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-1133437145666592581",
        "title": "He sold Deliverr to Shopify for $2.1 billion. Now his new startup is betting big on an AI assistant named Augie.",
        "url": "https://www.businessinsider.com/augment-ai-logistics-startup-launches-25-million-seed-funding-2025-3",
        "site": "businessinsider.com",
        "time": 1742288402000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Harish Abbott is the CEO and cofounder of Augment.AugmentFormer Shopify VP Harish Abbott launched a new startup building an AI assistant for logistics.Abbott cofounded Deliverr and sold it to Shopify for $2.1 billion in 2022.Augment has raised $25 million in seed funding led by 8VC.Harish Abbott, Deliverr cofounder and former Shopify vice president, launched a new startup called Augment out of stealth on Tuesday.Augment is building an AI assistant for the logistics industry. It has raised $25 million in seed funding, led by 8VC.The AI assistant, called Augie, can respond to emails and Slack messages, make and receive phone calls, manage workflows, and perform other routine tasks.\"You can text them, you can email them, you can message them on Slack. You can assign work to them, and they go about doing their work,\" Abbott told Business Insider in an exclusive interview.Abbott said the idea for Augment came from a desire to use AI to make an impact on an industry he knows well. He cofounded Deliverr, a startup that built software to enable quick shipping, and sold it to Shopify for $2.1 billion in 2022. A year later, Shopify sold Deliverr (and the rest of its logistics business) to Flexport. Abbott spent just under a year at Flexport before starting to build Augment in the summer of 2024.Augment will start in trucking, targeting shippers, brokers, and trucking companies before expanding to the larger logistics industry. Abbott said that Augie has been used in businesses that collectively have $20 billion of freight under management. Its early customers include Austin-based brokerage Arrive Logistics and third-party logistics provider NFI.Trucking is a nearly trillion-dollar industry in the US, and trucking companies serve as the connective tissue for commerce, transporting shipments between warehouses, ports, and retail stores. The last three years have been difficult for this industry as it's endured one of the longest recessions in its history. This means transportation companies are looking for ways to alleviate pressure on their margins, Abbott said.It's also a very fragmented industry. There are hundreds of thousands of trucking companies in the US, and no one standard system they all use to conduct business, besides email. Abbott said that when shadowing people working in this space, he saw that employees receive as many as 500 to 600 emails a day.\"When a shipper has to book a truck, they email maybe four or five brokers,\" Abbott said. \"The broker responds, then they go back and forth and negotiate on a bid. Then the broker takes that and emails 10 or 15 trucking companies, then they respond.\"Augie can chat with employees in Slack and make phone calls on their behalf.Augment'Logistics is not solved'Abbott said his time at Shopify gave him an \"even stronger feel of the problems\" faced by the millions of merchants using the e-commerce platform. Getting their products to customers remains one of merchants' biggest challenges and costs.His time at Flexport, meanwhile, showed how \"messy\" global trade can be.\"It reinforced for me that one, logistics is not solved. Two, it's crucially important. And three, I think AI is the answer to these problems,\" he said.Augie runs on different large language models depending on the scenario, including Anthropic's Claude, OpenAI's GPT-4, Meta's Llama, and DeepSeek. It learns from employees' emails, phone calls, and documents about how workers typically do their jobs. Abbott said that while Augie learns quickly, it still needs the help of employees to make decisions as it can't understand the nuance of human relationships.\"That's why the model for Augie is: I'm gonna superpower you, my human boss. I'm gonna bring you the knowledge. I'm gonna work 24/7 to take all the tedious parts away,\" Abbott said. \"Now you can make a better judgment call than you would otherwise because you were so busy before.\"Augment's founding team also includes CTO Artur Rivilis, who ran engineering for Deliverr, served as vice president of engineering at Shopify, and then spent some time at Flexport after its acquisition of Shopify Logistics. Cofounder Justin Hall, who will lead growth for Augment, had stints as CEO of logistics company Primo and as chief customer officer at YRC Worldwide. Hall was also previously an executive in residence at 8VC.8VC, founded by Palantir cofounder Joe Lonsdale, was also the first investor in Deliverr.\"Augment's an even bigger idea — one that parallels Palantir's approach of understanding the workflow and knowledge ontology, to apply AI and solve critical problems,\" Lonsdale said. \"Harish is poised to build a generational company that brings productivity and intelligence to one of the largest industries in the world.\"Augment has a team of about 50 people, mostly working in engineering. It plans to build a customer success team in Chicago. It has offices in Chicago, San Francisco, and Toronto.Have a tip? Contact this reporter via email at mstone@businessinsider.com or Signal at mlstone.04. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider Harish Abbott is the CEO and cofounder of Augment.AugmentFormer Shopify VP Harish Abbott launched a new startup building an AI assistant for logistics.Abbott cofounded Deliverr and sold it to Shopify for $2.1 billion in 2022.Augment has raised $25 million in seed funding led by 8VC.Harish Abbott, Deliverr cofounder and former Shopify vice president, launched a new startup called Augment out of stealth on Tuesday.Augment is building an AI assistant for the logistics industry. It has raised $25 million in seed funding, led by 8VC.The AI assistant, called Augie, can respond to emails and Slack messages, make and receive phone calls, manage workflows, and perform other routine tasks.\"You can text them, you can email them, you can message them on Slack. You can assign work to them, and they go about doing their work,\" Abbott told Business Insider in an exclusive interview.Abbott said the idea for Augment came from a desire to use AI to make an impact on an industry he knows well. He cofounded Deliverr, a startup that built software to enable quick shipping, and sold it to Shopify for $2.1 billion in 2022. A year later, Shopify sold Deliverr (and the rest of its logistics business) to Flexport. Abbott spent just under a year at Flexport before starting to build Augment in the summer of 2024.Augment will start in trucking, targeting shippers, brokers, and trucking companies before expanding to the larger logistics industry. Abbott said that Augie has been used in businesses that collectively have $20 billion of freight under management. Its early customers include Austin-based brokerage Arrive Logistics and third-party logistics provider NFI.Trucking is a nearly trillion-dollar industry in the US, and trucking companies serve as the connective tissue for commerce, transporting shipments between warehouses, ports, and retail stores. The last three years have been difficult for this industry as it's endured one of the longest recessions in its history. This means transportation companies are looking for ways to alleviate pressure on their margins, Abbott said.It's also a very fragmented industry. There are hundreds of thousands of trucking companies in the US, and no one standard system they all use to conduct business, besides email. Abbott said that when shadowing people working in this space, he saw that employees receive as many as 500 to 600 emails a day.\"When a shipper has to book a truck, they email maybe four or five brokers,\" Abbott said. \"The broker responds, then they go back and forth and negotiate on a bid. Then the broker takes that and emails 10 or 15 trucking companies, then they respond.\"Augie can chat with employees in Slack and make phone calls on their behalf.Augment'Logistics is not solved'Abbott said his time at Shopify gave him an \"even stronger feel of the problems\" faced by the millions of merchants using the e-commerce platform. Getting their products to customers remains one of merchants' biggest challenges and costs.His time at Flexport, meanwhile, showed how \"messy\" global trade can be.\"It reinforced for me that one, logistics is not solved. Two, it's crucially important. And three, I think AI is the answer to these problems,\" he said.Augie runs on different large language models depending on the scenario, including Anthropic's Claude, OpenAI's GPT-4, Meta's Llama, and DeepSeek. It learns from employees' emails, phone calls, and documents about how workers typically do their jobs. Abbott said that while Augie learns quickly, it still needs the help of employees to make decisions as it can't understand the nuance of human relationships.\"That's why the model for Augie is: I'm gonna superpower you, my human boss. I'm gonna bring you the knowledge. I'm gonna work 24/7 to take all the tedious parts away,\" Abbott said. \"Now you can make a better judgment call than you would otherwise because you were so busy before.\"Augment's founding team also includes CTO Artur Rivilis, who ran engineering for Deliverr, served as vice president of engineering at Shopify, and then spent some time at Flexport after its acquisition of Shopify Logistics. Cofounder Justin Hall, who will lead growth for Augment, had stints as CEO of logistics company Primo and as chief customer officer at YRC Worldwide. Hall was also previously an executive in residence at 8VC.8VC, founded by Palantir cofounder Joe Lonsdale, was also the first investor in Deliverr.\"Augment's an even bigger idea — one that parallels Palantir's approach of understanding the workflow and knowledge ontology, to apply AI and solve critical problems,\" Lonsdale said. \"Harish is poised to build a generational company that brings productivity and intelligence to one of the largest industries in the world.\"Augment has a team of about 50 people, mostly working in engineering. It plans to",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "9125900252034490031",
        "title": "Nearly a third of FDA medical device adverse events reported late: study | $ABT $MDT $BDX $DXCM $XRAY",
        "url": "https://seekingalpha.com/news/4421018-nearly-third-of-device-adverse-events-filed-late",
        "site": "seekingalpha.com",
        "time": 1742066520000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-8142661874457434851",
        "title": "Judge orders retrial in Abbott, Reckitt infant formula case | $ABT $RBGPF $RBGLY",
        "url": "https://seekingalpha.com/news/4420735-judge-orders-retrial-abbott-reckitt-benckiser-infant-formula-case",
        "site": "seekingalpha.com",
        "time": 1741964606000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "abt"
        ],
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "-5315342618281631471",
        "title": "Abbott, Reckitt Fall as Judge Grants New Trial on Infant Formula",
        "url": "https://www.bloomberg.com/news/articles/2025-03-14/abbott-reckitt-fall-as-judge-grants-new-trial-on-infant-formula",
        "site": "bloomberg.com",
        "time": 1741964236000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "abt"
        ],
        "similar_stories": [
            "5194830013617751569",
            "-4150068863552484973",
            "-8142661874457434851"
        ],
        "description": "Abbott Laboratories and Reckitt Benckiser Group Plc shares fell as a judge ordered a new trial after rejecting a verdict that had cleared the companies of liability over claims they hid potential risks of their premature-infant formulas. An Abbott distribution center in Columbus, Ohio.",
        "tickers": [
            "abt"
        ]
    },
    {
        "id": "5309656281304246044",
        "title": "Abbott, Apple, Citi, Nexstar, Musk, OpenAI: Votes and Verdicts",
        "url": "https://www.bloomberg.com/news/audio/2025-03-05/abbott-apple-citi-nexstar-musk-openai-votes-and-verdicts",
        "site": "bloomberg.com",
        "time": 1741189361000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "abt"
        ],
        "description": "Updates from the CFPB and SEC in litigation challenging rules concerning credit-card late fees and climate disclosures are among key March catalysts that BI’s litigation and policy analysts are watching. The team also discusses Nexstar and broadcasters in court March 19 over FCC limits on TV- and radio-station ownership. We’re also watching a March 24 hearing to bar experts in suits alleging Abbott and Reckitt’s Mead Johnson infant formula caused necrotizing enterocolitis. Apple may face sanctio Apple Inc Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "abt"
        ]
    }
]