[
    {
        "id": "-7936504634880048659",
        "title": "The Aisle-Prowling Albertsons CEO Taking On Kroger",
        "url": "https://www.wsj.com/business/retail/the-aisle-prowling-albertsons-ceo-taking-on-kroger-ca731c1f?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1750158000000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "8700815628609193174",
        "title": "Fed Seeks to Preserve Labor Market Lessons in Rewriting Rates Strategy",
        "url": "https://www.bloomberg.com/news/articles/2025-06-12/in-new-interest-rate-strategy-fed-seeks-to-keep-pre-covid-lessons",
        "site": "bloomberg.com",
        "time": 1749722400000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "description": "The long period of low inflation before Covid taught the Federal Reserve not to fear low unemployment. But the shock of the pandemic reminded policymakers how painful high inflation could be. A shopper carries bags outside a Kroger grocery store in Dallas, Texas, US, on Wednesday, Feb. 21, 2024. The US Federal Trade Commission and a group of states are poised to sue as soon as next week to block the tie-up between supermarket giants Kroger Co. and Albertsons Cos., according to people familiar with the plans.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "7391731146822059330",
        "title": "Nationwide coordinated retail crime crackdown results in hundreds of arrests, authorities say",
        "url": "https://www.cnbc.com/2025/06/04/retail-crime-crackdown-hundreds-of-arrests.html",
        "site": "cnbc.com",
        "time": 1749044578000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "kr"
        ],
        "description": "The blitz involved more than 100 jurisdictions and over 30 retailers including Home Depot, Macy's, Target, Ulta Beauty, Walgreens, Kroger and Meijer.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "8336682026149319404",
        "title": "Consumer staples favorites Kroger and Coca-Cola fall as investors go on the offensive",
        "url": "https://seekingalpha.com/news/4455096-consumer-staples-favorites-kroger-and-coca-cola-fall-as-investors-go-on-the-offensive",
        "site": "seekingalpha.com",
        "time": 1748972365000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "336777854465153436",
        "title": "Walmart, Amazon, Costco, And Home Depot Tackle The Tariff Whiplash",
        "url": "https://www.forbes.com/sites/shelleykohan/2025/06/01/walmart-amazon-costco-and-home-depot-tackle-the-tariff-whiplash/",
        "site": "forbes.com",
        "time": 1748779200000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Walmart, Amazon, Costco, Home Depot and Kroger are working on mitigating the impact of tariffs on pricing and product availability for its consumers. Walmart, Amazon, Costco, Home Depot and Kroger are working on mitigating the impact of tariffs on pricing and product availability for its consumers.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-4646691454661999041",
        "title": "Court OKs Rite Aid Pharmacy Asset Sale To CVS, Walgreens And Grocers",
        "url": "https://www.forbes.com/sites/brucejapsen/2025/05/21/court-oks-rite-aid-pharmacy-asset-sale-to-cvs-walgreens-and-grocers/",
        "site": "forbes.com",
        "time": 1747863911000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "kr"
        ],
        "description": "A U.S. bankruptcy court approved the sale of pharmacy assets from more than 1,000 Rite Aid stores to CVS Health, Walgreens and grocers including Kroger and Albertsons. A U.S. bankruptcy court approved the sale of pharmacy assets from more than 1,000 Rite Aid stores to CVS Health, Walgreens and grocers including Kroger and Albertsons.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "4231880692494893842",
        "title": "Midea Group, ZTO Express to Join Hong Kong’s Hang Seng Index",
        "url": "https://www.bloomberg.com/news/articles/2025-05-16/midea-group-zto-express-to-join-hong-kong-s-hang-seng-index-maqn5zez",
        "site": "bloomberg.com",
        "time": 1747390463000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Hang Seng Indexes Co. added two more members to its Hong Kong stock benchmark by including Midea Group Co. and ZTO Express, the index compiler said following a quarterly review. The Midea Group Co. logo at the Casas Bahia megastore in Sao Paulo.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-7236966113273192964",
        "title": "Kroger hiring 15,000 new employees",
        "url": "https://seekingalpha.com/news/4448885-kroger-hiring-15000-new-employees",
        "site": "seekingalpha.com",
        "time": 1747321002000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-1324856991841118104",
        "title": "Bull Signal Flashing On Flailing Grocery Giant",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/05/14/bull-signal-flashing-on-flailing-grocery-giant/",
        "site": "forbes.com",
        "time": 1747246353000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Grocery chain Kroger (KR) is 1.6% lower to trade at $66.42, eyeing its fifth daily drop in six sessions. Grocery chain Kroger (KR) is 1.6% lower to trade at $66.42, eyeing its fifth daily drop in six sessions.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "9095141473815326325",
        "title": "Kroger quietly shuts down third-party marketplace and shipping service",
        "url": "https://www.modernretail.co/technology/kroger-quietly-shuts-down-third-party-marketplace-and-shipping-service/?utm_campaign=modernretaildis&utm_medium=rss&utm_source=general-rss",
        "site": "modernretail.co",
        "time": 1747108800000,
        "favicon_url": "https://static.tickertick.com/website_icons/modernretail.co.ico",
        "tags": [
            "kr"
        ],
        "description": "Kroger quietly discontinued its third-party marketplace and shipping service, Kroger Ship, earlier this year, Modern Retail has learned. Kroger quietly discontinued its third-party marketplace and shipping service, Kroger Ship, earlier this year, Modern Retail has learned. Kroger discontinued the service in March 2025, according to a frequently asked questions page on its website redirecting customers to its pickup and delivery services. The Kroger Ship webpage also now redirects to a page outlining Kroger’s grocery delivery services. The company did not share why it discontinued the platform, and a spokesperson did not immediately respond to a request for comment.Continue reading this article on modernretail.co. Sign up for Modern Retail newsletters to get the latest on the shifting dynamics between retail’s old and new guards.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-664600326823719656",
        "title": "How Underinvestment Is Starving Grocery Stores And Feeding Wall Street",
        "url": "https://www.forbes.com/sites/errolschweizer/2025/05/12/how-underinvestment-is-starving-grocery-stores-and-feeding-wall-street/",
        "site": "forbes.com",
        "time": 1747047600000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "kr"
        ],
        "description": "A new report on Kroger and Albertsons reveals how underinvestment and understaffing in stores is funding record profits. A new report on Kroger and Albertsons reveals how underinvestment and understaffing in stores is funding record profits.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-8050932019058092397",
        "title": "Kroger and Albertsons cut worker hours. A new report looks at the impact to workers",
        "url": "https://www.fastcompany.com/91330323/kroger-and-albertsons-cut-worker-hours-a-new-report-looks-at-the-impact-to-workers",
        "site": "fastcompany.com",
        "time": 1746786600000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "kr"
        ],
        "description": "After a two-year battle with regulators, a federal judge ruled in late December to block the merger of grocery behemoths Kroger and Albertsons. The deal fell apart after facing significant pushback—and a lawsuit—from the Federal Trade Commission under the Biden administration, in part over concerns that unionized grocery workers would have less leverage to negotiate wage increases and respond to layoffs following a merger. Those concerns were not unfounded: The overwhelming majority of grocery workers (92%) are frontline staff in nonsupervisory positions, according to data from the Bureau of Labor Statistics—and as industry leaders, Kroger and Albertsons employ 28% of grocery workers across the country. Hourly wages for all grocery workers have effectively stagnated for the past two decades, hovering just under $18 in 2024 when adjusted for inflation, and weekly earnings have actually dropped by 15%. A new report by the nonprofit organization Economic Roundtable—which draws heavily on surveys of Kroger and Albertsons workers in California, Colorado, and Washington conducted by the United Food and Commercial Workers union—suggests that understaffing at these grocery stores impacts many workers and exacerbates the industry-wide issue of depressed wages. For many grocery employees, chronic understaffing and being denied additional hours on the job without a meaningful increase in hourly pay makes it even more difficult to earn a living wage. The report’s authors argue that reduced staffing at grocery stores has affected the shopping experience for consumers, as workers struggle to keep shelves fully stocked and manage their workload. Three-quarters of workers surveyed by UFCW said they struggled to finish assigned tasks during shifts. Kroger itself reported 14.1% fewer labor hours per store in 2023 than in 2019. But the Economic Roundtable’s report estimates that Kroger decreased labor hours despite increased demand due to e-commerce sales, leading to a labor shortfall of 21% relative to 2019. At Albertsons, which the report found was already understaffed in 2019, the shortfall amounted to 13%. In a statement to Fast Company, a Kroger spokesperson said, “We are committed to improving associates’ wages and benefits while keeping prices affordable for customers. We intentionally staff our stores to keep them running smoothly and creating an outstanding customer experience. Our decisions are data-driven to balance workload, schedules and customer service. Unrealistic demands by UFCW that do not reflect today’s competitive retail landscape will jeopardize the long-term sustainability of unionized businesses and advance non-union competitors.” (Albertsons did not respond to a request for comment.) The rise of lower staffing levels alongside wage stagnation also measurably affects workers’ ability to manage their finances and cover basic expenses. In the UFCW surveys, many grocery workers report getting their hours cut or being denied additional hours by their employer—a trend that is also captured by BLS data, which indicates that average weekly hours logged by nonsupervisory workers have dropped 11% since 2003 to under 29 hours. Grocery workers are also more likely, on average, to be part-time employees relative to workers in other industries, with the share of workers being 58% greater. By and large, the workers surveyed believed their pay did not fairly compensate them for their workload and experience, and that they saw themselves as essential frontline workers but were not treated as such by their employers. Many of them reported struggling to afford monthly expenses like rent, with more than two-thirds of grocery workers claiming to not have secure housing. Only 16% of grocery workers said they made enough money to cover basic expenses. On average, annual pay for nonsupervisory grocery workers in the regions surveyed is just over $25,000—and many such workers are eligible for Medicaid and other federal programs that help support low-income families. Over the past few decades, wage stagnation—and the yawning gap between worker pay and executive compensation—has impacted rank-and-file employees across industries. Even so, many workers have actually seen a bump in pay: According to the Economic Roundtable report, weekly earnings have increased by 15% over the past 20 years for production and nonsupervisory workers in other industries. Grocery workers, however, have experienced the opposite, leading to a 50% gap in pay relative to workers in other industries—a shift that the report finds has also coincided with a notable decline in union membership across the grocery industry.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "601396075839817",
        "title": "Egg lovers can’t get a break. Vital Farms to raise prices because of tariffs.",
        "url": "https://www.marketwatch.com/story/egg-lovers-cant-get-a-break-vital-farms-to-raise-prices-because-of-tariffs-76f5ac42?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1746721380000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Citing effects of tariffs, Vital Farms tells retail partners like Kroger, Target and Whole Foods that it will raise egg prices at least 10% this month.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "974675572799050990",
        "title": "Alpha Modus and Kroger settle patent dispute with agreement reached",
        "url": "https://seekingalpha.com/news/4440927-alpha-modus-and-kroger-settle-patent-dispute-with-agreement-reached",
        "site": "seekingalpha.com",
        "time": 1746448604000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-9084972144216414165",
        "title": "Walmart Opens First New Supercenter in 4 Years",
        "url": "https://www.pymnts.com/news/retail/2025/walmart-opens-first-new-supercenter-in-4-years/",
        "site": "pymnts.com",
        "time": 1746037875000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Walmart has opened a new Texas Supercenter, the first of its kind in four years. The store, announced Wednesday (April 30) and located in the Houston-area community of Cypress, is also the retail giant’s first new-construction “Store of the Future” in the U.S., and part of Walmart’s plan to build or convert more than 150 stores in the […] The post Walmart Opens First New Supercenter in 4 Years appeared first on PYMNTS.com. Walmart has opened a new Texas Supercenter, the first of its kind in four years. The store, announced Wednesday (April 30) and located in the Houston-area community of Cypress, is also the retail giant’s first new-construction “Store of the Future” in the U.S., and part of Walmart’s plan to build or convert more than 150 stores in the next several years. “This isn’t just a ribbon cutting. It’s a commitment to the future, an investment in a community and new job opportunities,” John Furner, president and CEO of Walmart U.S., said in a news release. “I’m proud of our associates in Cypress who brought this to reality.” Later in the year, Walmart plans to open new Supercenters in Texas, Utah and California, and Neighborhood Market stores in Alabama and Florida. The company also plans to convert stores in California and New Jersey into Supercenters. Walmart announced in January of last year that it aims to construct or convert more than 150 stores and remodel 650 additional locations over the next five years. The new and remodeled stores are part of the company’s Store of the Future concept, which incorporates interactive technology that combines virtual and in-person shopping. Wednesday’s opening comes days after Walmart announced it was “re-imagining the in-store shopping experience” as it implements its plan to refurbish more than 650 stores this year. These updates include “big, bold signage,” new displays that better showcase products, expanded departments and new items. At the stores’ pharmacies, Walmart is adding wider aisles, a new private screening room and privacy checkout areas. Walmart is also expanding online pickup and delivery in the remodeled stores “to fulfill the growing number of online customer orders,” the company said in a news release. As PYMNTS wrote last week, these efforts are something Walmart and rival Amazon have in common: investing in “innovations designed to keep customers not just satisfied, but delighted.” That’s because the two retailers increasingly share the same customers, according to PYMNTS Intelligence research. Those findings show that the percentage of Americans holding both Amazon Prime and Walmart+ subscriptions has almost doubled since 2021. Millennials are at the forefront of this movement, optimizing their digital lives by using the perks, discounts and ultra-fast shipping provided by both memberships. “This shift toward ‘multi-subscriber’ behavior speaks volumes about today’s consumers: loyalty is increasingly transactional, driven by value, convenience and digital experience rather than long-standing brand allegiance,” PYMNTS wrote. The post Walmart Opens First New Supercenter in 4 Years appeared first on PYMNTS.com.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "8988061337086665229",
        "title": "Walmart is once again America's grocery king, but rival Costco is rapidly gaining ground",
        "url": "https://www.businessinsider.com/walmart-americas-grocery-king-costco-gaining-ground-2025-4",
        "site": "businessinsider.com",
        "time": 1745868097000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "kr"
        ],
        "description": "It would take the four largest pure-play grocery chains combined — Kroger, Albertsons, Publix, and Ahold Delhaize — to finally outsize Walmart's grocery sales.Frederic J. Brown/AFP via Getty ImagesMore than one in five US grocery dollars is being spent at Walmart, for the third year in a row.At the same time, Costco is snapping up a growing share of grocery spending.The increases come as US shoppers look for more ways to get the most out of their household budgets.Walmart's reign as America's grocery king is showing no sign of slowing down.For the third year running, more than one in five US grocery dollars is being spent at Walmart, according to consumer analytics firm Numerator.And that share (21.2% to be exact) represents spending only at the Walmart US banner. When taking the additional 4% from company's warehouse chain Sam's Club into account, a Walmart overall rakes in a whopping one in four dollars spent on groceries in the US.That makes Walmart US more than twice as large as nearest rival Kroger. In fact, it would take the four largest pure-play grocery chains combined — Kroger, Albertsons, Publix, and Ahold Delhaize — to finally outgun the behemoth of Bentonville.Big as Walmart is, it doesn't appear to be the brand that grocery chains appear to be losing sales to. It's Costco.The Issaquah, Washington-based wholesale club has been snapping up more grocery spending since at least 2019, and has managed to improve its market share by nearly a percentage point in the past two years, from 7.6% in 2023 to 8.5% now. That's no small feat in the extremely competitive and famously low-margin grocery industry.Costco's focus on a limited selection of bulk products means it probably won't ever take up all of a household's grocery spending, but it is positioned to take more of it.The share gains for Walmart and Costco alike in recent years come as US shoppers look for more ways to get the most out of their household budgets.Both companies have seen transactions and sales tick up in the face of economic uncertainty, while competitors are having a harder time hitting their numbers.Each retailer also does robust business selling a lot more than just food, and those general merchandise sales often bring higher profits than groceries do. That mix can help offset lower markups on the everyday essential foods and sundries that keep shoppers coming in each week.At any rate, the numbers from Numerator show consistent consumer shift toward these banners, which have an established reputation for value. Walmart, Sam's Club, and Costco now collectively account for more than a third, or 33.7%, of US grocery spending, compared with 30.1% five years ago, per Numerator.Read the original article on Business Insider It would take the four largest pure-play grocery chains combined — Kroger, Albertsons, Publix, and Ahold Delhaize — to finally outsize Walmart's grocery sales.Frederic J. Brown/AFP via Getty ImagesMore than one in five US grocery dollars is being spent at Walmart, for the third year in a row.At the same time, Costco is snapping up a growing share of grocery spending.The increases come as US shoppers look for more ways to get the most out of their household budgets.Walmart's reign as America's grocery king is showing no sign of slowing down.For the third year running, more than one in five US grocery dollars is being spent at Walmart, according to consumer analytics firm Numerator.And that share (21.2% to be exact) represents spending only at the Walmart US banner. When taking the additional 4% from company's warehouse chain Sam's Club into account, a Walmart overall rakes in a whopping one in four dollars spent on groceries in the US.That makes Walmart US more than twice as large as nearest rival Kroger. In fact, it would take the four largest pure-play grocery chains combined — Kroger, Albertsons, Publix, and Ahold Delhaize — to finally outgun the behemoth of Bentonville.Big as Walmart is, it doesn't appear to be the brand that grocery chains appear to be losing sales to. It's Costco.The Issaquah, Washington-based wholesale club has been snapping up more grocery spending since at least 2019, and has managed to improve its market share by nearly a percentage point in the past two years, from 7.6% in 2023 to 8.5% now. That's no small feat in the extremely competitive and famously low-margin grocery industry.Costco's focus on a limited selection of bulk products means it probably won't ever take up all of a household's grocery spending, but it is positioned to take more of it.The share gains for Walmart and Costco alike in recent years come as US shoppers look for more ways to get the most out of their household budgets.Both companies have seen transactions and sales tick up in the face of economic uncertainty, while competitors are having a harder time hitting their numbers.Each retailer also does robust business selling a lot more than just food, and those general merchandise sales often bring higher profits than groceries do. That mix can help offset lower markups on the everyday essential foods and sundries that keep shoppers coming in each week.At any rate, the numbers from Numerator show consistent consumer shift toward these banners, which have an established reputation for value. Walmart, Sam's Club, and Costco now collectively account for more than a third, or 33.7%, of US grocery spending, compared with 30.1% five years ago, per Numerator.Read the original article on Business Insider",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "4799285220108118944",
        "title": "Walmart leads Raleigh grocery market, but Publix gains fast",
        "url": "https://www.axios.com/local/raleigh/2025/04/24/popular-grocery-store-raleigh-publix-walmart-harris-teeter-food-lion#new_tab",
        "site": "axios.com",
        "time": 1745541667000,
        "favicon_url": "https://static.tickertick.com/website_icons/axios.com.ico",
        "tags": [
            "kr"
        ],
        "description": "(Axios Raleigh) Walmart holds the top grocery market share in Raleigh at 21.3%, with Food Lion and Harris Teeter tied at 14.6%. Publix has surged to 6.9% with 11 stores, surpassing Target and Costco. Despite the boom, parts of Southeast Raleigh remain food deserts with poor transit access.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "1989598593197215234",
        "title": "Albertsons warns of lower-than-expected profit ahead as it gears up to go it alone",
        "url": "https://www.marketwatch.com/story/albertsons-stock-slides-5-as-soft-guidance-overshadows-earnings-beat-a188d130?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1744719660000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Grocery chain is relying on digital and loyalty program to boost growth since its planned combination with Kroger fell apart",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-5602156852102101982",
        "title": "Insider trades: Nike, Kroger, GameStop among notable names this week",
        "url": "https://seekingalpha.com/news/4430605-insider-trades-nike-kroger-gamestop-among-notable-names-this-week",
        "site": "seekingalpha.com",
        "time": 1744470180000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "3930151914418654489",
        "title": "Paper Towel Maker Royal Paper Files for Bankruptcy",
        "url": "https://www.bloomberg.com/news/articles/2025-04-08/paper-towel-maker-royal-paper-files-for-bankruptcy",
        "site": "bloomberg.com",
        "time": 1744147301000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Royal Paper, a maker of private label bath tissues, paper towels and napkins sold at Whole Foods, Trader Joe’s and Kroger, filed for bankruptcy and has agreed a deal to sell its business. A roll of Kimberly-Clark Corp. Scott brand paper towels is arranged for a photograph in Tiskilwa, Illinois, U.S., on Friday, Oct. 16, 2015. Kimberly-Clark is scheduled to report earnings figures on October 21. Photographer: Daniel Acker",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-6572313154556964797",
        "title": "Playing defense: Kroger, General Mills, and PepsiCo are notable gainers amid the tariff turmoil",
        "url": "https://seekingalpha.com/news/4428524-playing-defense-kroger-general-mills-and-pepsico-are-notable-gainers-amid-the-tariff-turmoil",
        "site": "seekingalpha.com",
        "time": 1743702913000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "2304998553381382765",
        "title": "How Albertsons Media Collective is positioning itself to brands after failed Kroger merger",
        "url": "https://www.modernretail.co/marketing/how-albertsons-media-collective-is-positioning-itself-to-brands-after-failed-kroger-merger/?utm_campaign=modernretaildis&utm_medium=rss&utm_source=general-rss",
        "site": "modernretail.co",
        "time": 1743480000000,
        "favicon_url": "https://static.tickertick.com/website_icons/modernretail.co.ico",
        "tags": [
            "kr"
        ],
        "description": "In a post-Kroger world, Albertsons' ad business is a big priority for the company's growth. In an interview with Modern Retail, its media and measurement executive talked about how the company is positioning itself with brands trying to better understand their customers. By creating a company of around 5,000 stores, the failed Kroger-Albertsons deal would have created a behemoth in retail media that experts argued would have been able to challenge Walmart with a greater breadth of data. But with the potential deal now behind them, both companies will now need to chart their own paths as competitors. For Albertsons, like many grocers and retailers, its advertising business will be crucial to future growth, tapping into its e-commerce business that, as of last year, made up more than 7% of its grocery revenue. “While we are disappointed that the merger was terminated, we never stopped investing in our business,” Albertsons CEO Vivek Sankaran said on the company’s last earnings call on Jan. 8. He added that the company has continued to invest in growth in its digital platforms — e-commerce, loyalty, pharmacy/health and its mobile app — to generate digital space and data for the Albertsons Media Collective retail media network as well as to increase sales and more deeply engage with customers.Continue reading this article on modernretail.co. Sign up for Modern Retail newsletters to get the latest on the shifting dynamics between retail’s old and new guards.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-8135801604092826842",
        "title": "Lessons from a big M&A blow-up",
        "url": "https://www.ft.com/content/958902fb-6a72-48d5-b454-afb6e03c2a69",
        "site": "ft.com",
        "time": 1743448539000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "kr"
        ],
        "description": "The collapse of the merger of US grocers Kroger and Albertsons shows the risks when deals go wrong",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-8055260319133391802",
        "title": "The Vampire Diaries author LJ Smith dies at 66",
        "url": "https://www.bbc.com/news/articles/cj67675djk0o",
        "site": "bbc.com",
        "time": 1743164509000,
        "favicon_url": "https://static.tickertick.com/website_icons/bbc.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Smith's book series was adapted for a hit teen TV show, which ran for eight years until 2017.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-2160175420962665786",
        "title": "Kroger Fights Suit by Albertsons Over Failed $24.6 Billion Deal",
        "url": "https://www.bloomberg.com/news/articles/2025-03-25/kroger-fights-suit-by-albertsons-over-failed-24-6-billion-deal",
        "site": "bloomberg.com",
        "time": 1742917541000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Kroger Co. is fighting back against a lawsuit brought by Albertsons Cos. over its failed $24.6 billion takeover of the rival grocery chain, escalating a dispute that began after US antitrust enforcers succeeded in blocking the deal last year. A Kroger grocery store in Houston, Texas, US, on Tuesday, July 9, 2024. Houston is baking under dangerous heat as more than 2 million homes and businesses in the area remain without power after Hurricane Beryl and signs of fuel shortages begin to emerge.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-6417278581020187389",
        "title": "Kroger Accuses Albertsons of Undermining Their $20 Billion Merger",
        "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-nasdaq-sp500-03-25-2025/card/kroger-accuses-albertsons-of-undermining-their-20-billion-merger-mFBX1N6KEk67OC5svCJf?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1742917135000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-1242984333474800976",
        "title": "Grocery store wars: Kroger is fighting Albertsons over a $600M merger termination fee",
        "url": "https://seekingalpha.com/news/4424820-grocery-store-wars-kroger-is-fighting-albertsons-over-a-600m-merger-termination-fee",
        "site": "seekingalpha.com",
        "time": 1742914687000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "928789095777737101",
        "title": "Kroger increases its focus on e-commerce with the creation of a new business unit",
        "url": "https://seekingalpha.com/news/4419415-kroger-increases-its-focus-on-e-commerce-with-the-creation-of-a-new-business-unit",
        "site": "seekingalpha.com",
        "time": 1741706536000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-2527450162788234159",
        "title": "Kroger Interim Chief to Staff: ‘Move Forward’ After CEO Exit",
        "url": "https://www.bloomberg.com/news/articles/2025-03-06/kroger-interim-chief-to-staff-move-forward-after-ceo-exit",
        "site": "bloomberg.com",
        "time": 1741298738000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Kroger Co.’s interim leader urged employees to forge ahead following an abrupt exit of his predecessor, according to a recording of an internal meeting viewed by Bloomberg News. A Kroger grocery store in Covington, Kentucky, US, on Sunday, June 2, 2024. Kroger Co. is expected to release earnings figures on June 20. Photographer: Jeffrey Dean/Bloomberg",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-9156022539121653972",
        "title": "Kroger Reports 11% Growth in Digital Sales in Q4",
        "url": "https://www.pymnts.com/earnings/2025/kroger-reports-11percent-growth-in-digital-sales-in-q4/",
        "site": "pymnts.com",
        "time": 1741292971000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Kroger saw growth in digital sales, employees’ use of artificial intelligence (AI) tools and the benefits of personalization during its fourth quarter, which ended Feb. 1, executives said Thursday (March 6) during the grocery giant’s quarterly earnings call. The company saw 11% growth in digital sales during the fourth quarter, outpacing its 2.4% growth in […] The post Kroger Reports 11% Growth in Digital Sales in Q4 appeared first on PYMNTS.com. Kroger saw growth in digital sales, employees’ use of artificial intelligence (AI) tools and the benefits of personalization during its fourth quarter, which ended Feb. 1, executives said Thursday (March 6) during the grocery giant’s quarterly earnings call. The company saw 11% growth in digital sales during the fourth quarter, outpacing its 2.4% growth in overall identical sales, according to a Thursday earnings release. For the full year of its fiscal 2024, digital sales accounted for $13 billion of Kroger’s total company sales of $147.1 billion, per the release. “We are encouraged by our fourth quarter results, which delivered the best digital profit improvement quarter we’ve seen yet,” Kroger Interim Chief Financial Officer Todd Foley said Thursday during the company’s quarterly earnings call. Foley added that digital is an “important growth accelerator” for Kroger because the company has found that digital households are more loyal and spend nearly three times as much as non-digitally engaged households. AI tools are an important part of Kroger’s productivity initiatives, and the company added two such tools in 2024, Foley said during the call. One is an AI-powered tool that uses real-time sales and shipment data to help associates manage inventory, while the other is an AI-powered virtual assistant for associates that provides personalized service for things like onboarding, training and human resources (HR) interactions. “Today, almost 70,000 associates engage with this tool for more than 70 use cases,” Foley said during the call. Kroger also made gains in its personalization efforts in 2024. The company delivered a 10% increase in digital coupon savings for its customers and enhanced its Boost membership benefits by adding Disney streaming options, according to an earnings presentation released Thursday. “Offering fresh, high-quality products with personalized offers through a unique, seamless shopping experience led to strong customer engagement trends, including growth in both households and loyalty,” Foley said during the call. Looking ahead, Kroger expects to see identical sales without fuel grow 2% to 3% in 2025, according to the earnings release. “We delivered solid results in 2024, and our performance improved throughout the year,” Chairman and CEO Ron Sargent said during the call. “Looking to 2025, we have aggressive plans to build more stores and improve our share results, attract new households, and increase loyalty, which will accelerate growth and create shareholder value.” Sargent delivered these remarks three days after being appointed to serve as chairman and interim CEO after the Monday (March 3) resignation of previous chairman and CEO Rodney McMullen. Prior to that, Sargent was the company’s lead director. During the call, Sargent said the board has formed a search committee and begun the search process for a new CEO. “But I think most importantly, we’re focused on identifying the right leader to drive Kroger’s growth and enhance shareholder value,” Sargent said. The post Kroger Reports 11% Growth in Digital Sales in Q4 appeared first on PYMNTS.com.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "2343439137906706209",
        "title": "Kroger outlines 2025 guidance with projected EPS of $4.60-$4.80",
        "url": "https://seekingalpha.com/news/4418207-kroger-outlines-2025-guidance-with-projected-eps-of-4_60-4_80",
        "site": "seekingalpha.com",
        "time": 1741287773000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-6806652822651152068",
        "title": "Kroger Seeks to Shuffle Supply Chain, Sidestep Tariffs",
        "url": "https://www.wsj.com/business/earnings/kroger-kr-q4-earnings-report-2024-1519912e?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1741279860000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "6212126416356667979",
        "title": "Kroger Posts a Mixed Quarter and Soft Guidance. The Stock Rises Anyway.",
        "url": "https://www.barrons.com/articles/kroger-earnings-ceo-merger-albertsons-7ec47b1c?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1741273380000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-2778292003635494935",
        "title": "Kroger Profit Outlook Disappoints Following CEO Exit",
        "url": "https://www.wsj.com/business/retail/kroger-profit-outlook-disappoints-following-ceo-exit-1519912e?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1741269780000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "8448795842406826733",
        "title": "Earnings Snapshot: Kroger reports mixed Q4 results; initiates FY25 outlook",
        "url": "https://seekingalpha.com/news/4417847-earnings-snapshot-kroger-reports-mixed-q4-results-initiates-fy25-outlook",
        "site": "seekingalpha.com",
        "time": 1741269247000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "3872713641533744474",
        "title": "Stocks to Watch Thursday: Alibaba, Broadcom, Macy's, Kroger",
        "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-live-03-06-2025/card/stocks-to-watch-thursday-alibaba-marvell-volkswagen-kroger-AUyiFZDtILvoQB6WhVwI?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1741268335000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-5118524438579784039",
        "title": "Kroger in charts: Identical sales without fuel increased 2.4% in Q4",
        "url": "https://seekingalpha.com/news/4417848-kroger-in-charts-identical-sales-without-fuel-increased-2_4-in-q4",
        "site": "seekingalpha.com",
        "time": 1741267406000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-8511960372375817361",
        "title": "Supermarket giant Kroger’s downbeat profit view reflects factors ‘outside our control’",
        "url": "https://www.marketwatch.com/story/supermarket-giant-krogers-downbeat-profit-view-reflects-factors-outside-our-control-4f3982a3?mod=mw_rss_marketpulse",
        "site": "marketwatch.com",
        "time": 1741267080000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "7268900837011583076",
        "title": "Kroger tops identical-store sales expectations as it points to 2025 momentum",
        "url": "https://seekingalpha.com/news/4417943-kroger-tops-identical-store-sales-expectations-as-it-points-to-2025-momentum",
        "site": "seekingalpha.com",
        "time": 1741267027000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "4216955417286080793",
        "title": "Kroger Gives Upbeat Outlook Amid Questions About CEO Exit",
        "url": "https://www.bloomberg.com/news/articles/2025-03-06/kroger-gives-upbeat-outlook-amid-questions-about-ceo-exit",
        "site": "bloomberg.com",
        "time": 1741266510000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "similar_stories": [
            "-2778292003635494935"
        ],
        "description": "Kroger Co. forecast higher-than-expected guidance for the full year, seeking to pacify concerns as questions linger about its chief executive officer’s abrupt exit. A shopper carries Kroger bags outside a grocery store in Dallas. Photographer: Shelby Tauber/Bloomberg",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "7706898969348091052",
        "title": "Kroger Non-GAAP EPS of $1.14 beats by $0.03, revenue of $34.3B misses by $460M",
        "url": "https://seekingalpha.com/news/4417986-kroger-non-gaap-eps-of-1_14-beats-by-0_03-revenue-of-34_3b-misses-by-460m",
        "site": "seekingalpha.com",
        "time": 1741266184000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-2954930367907078747",
        "title": "Outgoing Kroger CEO Rodney McMullen lost $11 million in bonus and stock payments when he resigned from the grocery chain",
        "url": "https://www.businessinsider.com/kroger-ceo-lost-11-million-in-bonus-stock-payments-resignation-2025-3",
        "site": "businessinsider.com",
        "time": 1741197635000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Former Kroger CEO Rodney McMullenThomson ReutersKroger's ex-CEO forfeited more than $11 million in bonus and stock payments when he resigned.Rodney McMullen still had hundreds of millions in Kroger stock, according to the filings.Kroger cited McMullen's \"personal conduct\" in announcing his resignation on Monday.The former CEO of Kroger forfeited more than $11 million when he resigned from the grocery chain this week.McMullen left behind $11.2 million in a potential bonus as well as stock and options when he left the company, Kroger's SEC filings show.Without that compensation, McMullen still owned 6.6 million shares of Kroger, worth roughly $417 million at Tuesday's closing price.McMullen also had total compensation as CEO of $15.7 million in 2023, according to an SEC filing. In 2022, his compensation totaled $19.2 million.Kroger said on Monday that McMullen had resigned after an investigation into his \"personal conduct.\"The company didn't provide more information on what McMullen did but said that some of his actions were \"inconsistent with Kroger's Policy on Business Ethics.\" Kroger said that McMullen's actions weren't connected to other Kroger associates or the company's financial performance.McMullen was appointed Kroger's CEO in 2014. For two years, he oversaw the chain's proposed $24.6 billion merger with Albertsons, which fell apart in December.Do you work at Kroger and have a tip? Contact this reporter via email at abitter@businessinsider.com or Signal at 808-854-4501. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider Former Kroger CEO Rodney McMullenThomson ReutersKroger's ex-CEO forfeited more than $11 million in bonus and stock payments when he resigned.Rodney McMullen still had hundreds of millions in Kroger stock, according to the filings.Kroger cited McMullen's \"personal conduct\" in announcing his resignation on Monday.The former CEO of Kroger forfeited more than $11 million when he resigned from the grocery chain this week.McMullen left behind $11.2 million in a potential bonus as well as stock and options when he left the company, Kroger's SEC filings show.Without that compensation, McMullen still owned 6.6 million shares of Kroger, worth roughly $417 million at Tuesday's closing price.McMullen also had total compensation as CEO of $15.7 million in 2023, according to an SEC filing. In 2022, his compensation totaled $19.2 million.Kroger said on Monday that McMullen had resigned after an investigation into his \"personal conduct.\"The company didn't provide more information on what McMullen did but said that some of his actions were \"inconsistent with Kroger's Policy on Business Ethics.\" Kroger said that McMullen's actions weren't connected to other Kroger associates or the company's financial performance.McMullen was appointed Kroger's CEO in 2014. For two years, he oversaw the chain's proposed $24.6 billion merger with Albertsons, which fell apart in December.Do you work at Kroger and have a tip? Contact this reporter via email at abitter@businessinsider.com or Signal at 808-854-4501. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "5312107302462305413",
        "title": "Kroger Q4 2025 Earnings Preview",
        "url": "https://seekingalpha.com/news/4417529-kroger-q4-2025-earnings-preview",
        "site": "seekingalpha.com",
        "time": 1741190611000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "368057753075194386",
        "title": "Kroger CEO Resigns Over 'Personal Conduct'",
        "url": "https://www.bloomberg.com/news/videos/2025-03-03/kroger-ceo-resigns-over-personal-conduct-video-m7tkdhtn",
        "site": "bloomberg.com",
        "time": 1741036826000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Kroger Co. replaced CEO Rodney McMullen following an investigation into his personal conduct, which was deemed \"inconsistent\" with the company's policy on business ethics. Jaewon Kang reports. (Source: Bloomberg)",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "559311624340836816",
        "title": "Albertsons Names New CEO Following Failed Deal With Kroger",
        "url": "https://www.bloomberg.com/news/articles/2025-03-03/albertsons-names-new-ceo-following-failed-deal-with-kroger",
        "site": "bloomberg.com",
        "time": 1741036794000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Albertsons Cos. appointed a new chief executive officer as the second-largest US grocery operator seeks to start a new chapter after its failed deal with Kroger Co. An Albertsons grocery store in Grand Prairie, Texas, US, on Wednesday, Feb. 21, 2024. The US Federal Trade Commission and a group of states are poised to sue as soon as next week to block the tie-up between supermarket giants Kroger Co. and Albertsons Cos., according to people familiar with the plans. Photographer: Shelby Tauber/Bloomberg",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-8762175673598276473",
        "title": "Kroger CEO Rodney McMullen resigns after probe into personal conduct",
        "url": "https://www.fastcompany.com/91289395/kroger-ceo-rodney-mcmullen-resigns-probe-personal-conduct?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1741033800000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "kr"
        ],
        "description": "U.S. grocer Kroger said on Monday CEO Rodney McMullen has resigned after a board investigation found that his personal conduct was “inconsistent” with certain company policies. The conduct is not related to financial performance, operations or reporting, and it did not involve any Kroger associates, the company said. The surprise ouster of the 64-year-old executive comes after the company in December terminated a two-year effort to buy rival Albertsons in a $25 billion deal, an attempt McMullen had staunchly defended as a way to fight higher prices and better compete with Walmart and Costco. Meanwhile, Albertsons has sued Kroger for an alleged breach of contract that led to the demise of the deal. Kroger, when contacted, declined to provide more details on the exit of McMullen — who was its CEO for more than a decade and has been at the company since 1978 — and the nature of the conduct that led to his ouster. McMullen did not respond to a request via LinkedIn for comment. “McMullen stepping down certainly puts Kroger in a vulnerable position. The company is already dealing with the aftermath of its abandoned Albertsons merger, and a leadership change at this stage can complicate things,” said Riley Beam, managing attorney at Douglas R. Beam, a personal injury law firm based in Melbourne, Florida. “For investors, the risk is obvious — uncertainty.” The Cincinnati, Ohio-based company’s shares were down about 1.4% in early trading on Monday. The stock has more than tripled in value since McMullen took the helm in 2014. Following the failed merger plan in December, some United Food and Commercial Workers local unions urged Kroger’s board to replace McMullen after the company announced a $7.5 billion stock buyback plan. McMullen was trying to “distract attention from his multiple failures as CEO by announcing a massive one-time giveaway to shareholders,” the group had said. Kroger said on Monday the board was made aware of certain personal conduct by McMullen on February 21 and immediately retained an outside independent counsel to conduct an investigation, which was overseen by a special board committee. The board has appointed lead director Ronald Sargent as interim CEO. A long-time director at Kroger, Sargent was previously the CEO at office supplies chain Staples for more than a decade. He also serves on the board of Wells Fargo, where he is the chair of the human resources committee. Kroger said the board has formed a search committee and appointed a firm to conduct a search for its next CEO. The company said McMullen would not be eligible to receive a bonus for 2024. He received a total compensation of $15.71 million for fiscal year 2023, according to the company’s proxy statement. Kroger, scheduled to report its fourth-quarter results on Thursday, expects full-year adjusted earnings per share to be slightly above the high end of its forecast range. Several prominent CEOs have also been ousted for violating company policy, including McDonald’s CEO Steve Easterbrook in 2019 and Hewlett-Packard’s Co-CEO Mark Hurd in 2010. “If past is any guidance, there is usually no impact (on a company’s performance),” said Xu Jiang, associate professor at Duke University’s Fuqua School of Business. “The interim CEO will likely follow the previous CEO’s strategies so there is minimal disruption of Kroger’s business.” —Savyata Mishra and Aishwarya Venugopal, Reuters",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-1581824817636637515",
        "title": "Kroger Says CEO Rodney McMullen Resigns Due to ‘Personal Conduct’",
        "url": "https://www.pymnts.com/personnel/2025/kroger-says-ceo-rodney-mcmullen-resigns-due-to-personal-conduct/",
        "site": "pymnts.com",
        "time": 1741019614000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Grocery giant Kroger said Monday (March 3) that Chairman and CEO Rodney McMullen resigned from the company after a board investigation of his personal conduct. The company did not specify the personal conduct but said in a press release that it “while unrelated to the business, was inconsistent with Kroger’s Policy on Business Ethics.” Kroger added that McMullen’s conduct is […] The post Kroger Says CEO Rodney McMullen Resigns Due to ‘Personal Conduct’ appeared first on PYMNTS.com. Grocery giant Kroger said Monday (March 3) that Chairman and CEO Rodney McMullen resigned from the company after a board investigation of his personal conduct. The company did not specify the personal conduct but said in a press release that it “while unrelated to the business, was inconsistent with Kroger’s Policy on Business Ethics.” Kroger added that McMullen’s conduct is not related to the company’s financial performance, operations or reporting and did not involve any company employees. The company appointed lead director Ronald Sargent to serve as chairman of the board of directors and interim CEO, effective immediately, and he will serve in that role until Kroger appoints a new CEO after conducting a search with the help of a nationally recognized firm, according to the release. In addition, Mark Sutton will serve as the company’s lead independent director, the release said. “Over the years, Ron has played an integral role in the development and approval of Kroger’s strategy, which has led us to the position of strength where we are today,” Sutton said in the release. Sargent has 35 years of experience as a retail operator and leader, according to the release. He has been a director at Kroger since 2006 and served as lead director since 2017, the release said. Sargent joined Staples in 1989 and served as that company’s chairman and CEO from 2002 to 2016, per the release. “As interim CEO, I am committed to working alongside our proven and experienced management team and dedicated associates to ensure Kroger continues providing exceptional value for our customers,” Sargent said in the release. Ahead of the company’s fourth-quarter earnings report scheduled for Thursday (March 6), Kroger said in the release that it expects its full-year identical sales without fuel to be at the high end of its guidance range and its full-year adjusted earnings per share to be slightly above the high end of its guidance range. Kroger said in a December earnings report that it expected to see identical sales growth of 1.2% to 1.5% in the fourth quarter, with a continued focus on digital engagement and customer loyalty. The post Kroger Says CEO Rodney McMullen Resigns Due to ‘Personal Conduct’ appeared first on PYMNTS.com.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-4826785420085571918",
        "title": "Kroger C.E.O. Resigns After Board’s Personal Conduct Investigation",
        "url": "https://www.nytimes.com/2025/03/03/business/kroger-ceo-resigns-rodney-mcmullen.html",
        "site": "nytimes.com",
        "time": 1741015191000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "kr"
        ],
        "description": "The grocery chain said it had investigated its chief executive, Rodney McMullen, and found that his actions were “inconsistent” with its business ethics policy.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "2889446076029547498",
        "title": "Kroger's CEO Rodney McMullen abruptly resigned after an investigation into his 'personal conduct'",
        "url": "https://www.businessinsider.com/kroger-ceo-rodney-mcmullen-leaves-after-personal-conduct-concerns-2025-3",
        "site": "businessinsider.com",
        "time": 1741013003000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "kr"
        ],
        "description": "Rodney McMullenJohn Minchillo/AP ImagesKroger has abruptly replaced its CEO, the grocery chain said on Monday.Rodney McMullen resigned and will be replaced by Ronald Sargent.The chain said it learned about conduct \"inconsistent with Kroger's Policy on Business Ethics.\"Grocery chain Kroger will replace its CEO after an investigation into his personal conduct.Kroger said on Monday that it learned about the conduct by Rodney McMullen, which was \"inconsistent with Kroger's Policy on Business Ethics,\" according to a statement.\"On February 21, the Board was made aware of certain personal conduct by Mr. McMullen and immediately retained outside independent counsel to conduct an investigation, which was overseen by a special Board committee,\" Kroger said in a statement.No Kroger associates were involved in McMullen's conduct, Kroger said. The behavior is also not related to the company's financial performance.McMullen has resigned from the CEO role, Kroger said. He has been Kroger's CEO since 2014 and became chairman of the company's board of directors the following year.The company appointed Ronald Sargent, a member of its board of directors and a former CEO of Staples, as interim CEO and board chair while it searches for a permanent replacement.Mark Sutton will take over as the company's lead independent director, Kroger said.Kroger is the largest supermarket chain in the US by sales. The company operates grocery stores under multiple names, including Harris Teeter and Fry's.The company is expected to report fourth-quarter earnings on Thursday.Have a tip? Contact this reporter via email at abitter@businessinsider.com or encrypted messaging app Signal at 808-854-4501. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider Rodney McMullenJohn Minchillo/AP ImagesKroger has abruptly replaced its CEO, the grocery chain said on Monday.Rodney McMullen resigned and will be replaced by Ronald Sargent.The chain said it learned about conduct \"inconsistent with Kroger's Policy on Business Ethics.\"Grocery chain Kroger will replace its CEO after an investigation into his personal conduct.Kroger said on Monday that it learned about the conduct by Rodney McMullen, which was \"inconsistent with Kroger's Policy on Business Ethics,\" according to a statement.\"On February 21, the Board was made aware of certain personal conduct by Mr. McMullen and immediately retained outside independent counsel to conduct an investigation, which was overseen by a special Board committee,\" Kroger said in a statement.No Kroger associates were involved in McMullen's conduct, Kroger said. The behavior is also not related to the company's financial performance.McMullen has resigned from the CEO role, Kroger said. He has been Kroger's CEO since 2014 and became chairman of the company's board of directors the following year.The company appointed Ronald Sargent, a member of its board of directors and a former CEO of Staples, as interim CEO and board chair while it searches for a permanent replacement.Mark Sutton will take over as the company's lead independent director, Kroger said.Kroger is the largest supermarket chain in the US by sales. The company operates grocery stores under multiple names, including Harris Teeter and Fry's.The company is expected to report fourth-quarter earnings on Thursday.Have a tip? Contact this reporter via email at abitter@businessinsider.com or encrypted messaging app Signal at 808-854-4501. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-4389823460907638192",
        "title": "Kroger CEO Rodney McMullen resigns following probe of personal conduct",
        "url": "https://www.marketwatch.com/story/krogers-stock-slumps-after-ceo-rodney-mcmullen-ousted-following-probe-of-personal-conduct-3768f907?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1741006140000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "kr"
        ],
        "description": "“Mr. McMullen’s conduct is not related to the company’s financial performance, operations or reporting, and it did not involve any Kroger associates,” the company said.",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "7865323244388552340",
        "title": "Kroger says chief Rodney McMullen has quit over personal conduct",
        "url": "https://www.ft.com/content/abfc0163-bdfe-4351-bd8a-4e5229781971",
        "site": "ft.com",
        "time": 1741004975000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "kr"
        ],
        "description": "US supermarket chain appoints Ronald Sargent as chair and interim CEO",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-1101316153754140287",
        "title": "Kroger's CEO steps down after a board investigation into his personal conduct",
        "url": "https://seekingalpha.com/news/4416030-krogers-ceo-steps-down-after-a-board-investigation-into-his-personal-conduct",
        "site": "seekingalpha.com",
        "time": 1741004077000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-1028793097544453348",
        "title": "Kroger ousts CEO after board investigation into personal conduct",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=f0bb52c9-956e-476d-90b7-abd085e12937&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1741003886000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-2023386166177416242",
        "title": "Kroger CEO Resigns Over ‘Personal Conduct,’ Board Investigating",
        "url": "https://www.bloomberg.com/news/articles/2025-03-03/kroger-replaces-ceo-over-personal-conduct-board-investigating",
        "site": "bloomberg.com",
        "time": 1741003694000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "kr"
        ],
        "similar_stories": [
            "-2954930367907078747",
            "-7354580945144310284",
            "368057753075194386",
            "-8762175673598276473",
            "-1581824817636637515",
            "-4826785420085571918",
            "761015600912247783",
            "2889446076029547498",
            "-4389823460907638192",
            "7865323244388552340",
            "-1101316153754140287",
            "-1028793097544453348",
            "-6351428226586341236"
        ],
        "description": "Kroger Co. replaced Chief Executive Officer Rodney McMullen amid an investigation into his personal conduct. Rodney McMullen Photographer: Jeenah Moon/Bloomberg",
        "tickers": [
            "kr"
        ]
    },
    {
        "id": "-6351428226586341236",
        "title": "Kroger’s stock slumps after CEO Rodney McMullen ousted following probe of personal conduct",
        "url": "https://www.marketwatch.com/story/krogers-stock-slumps-after-ceo-rodney-mcmullen-ousted-following-probe-of-personal-conduct-3768f907?mod=mw_rss_marketpulse",
        "site": "marketwatch.com",
        "time": 1741003680000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "kr"
        ],
        "tickers": [
            "kr"
        ]
    }
]