[
    {
        "id": "-8900012812284540472",
        "title": "Richard Beattie, Who Helped Pioneer Private Equity Takeovers, Dies at 86",
        "url": "https://www.nytimes.com/2025/06/11/business/dealbook/richard-beattie-dead.html",
        "site": "nytimes.com",
        "time": 1749658028000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "A top Wall Street lawyer, he worked on some of the biggest corporate mergers in history, including KKR’s takeover of Nabisco in 1989. He also served in the Carter administration and in city government.",
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "5436477845471059001",
        "title": "Jacobs wins contract to deliver services for expansion of Boeing's St. Louis facility",
        "url": "https://seekingalpha.com/news/4455836-jacobs-wins-contract-to-deliver-services-for-expansion-of-boeings-st-louis-facility",
        "site": "seekingalpha.com",
        "time": 1749129317000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "mdlz"
        ],
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "8390249723242894429",
        "title": "My father's death showed me how hard it is for men to open up. I started a men's walking group to help us connect.",
        "url": "https://www.businessinsider.com/i-started-men-walking-group-friends-male-loneliness-2025-6",
        "site": "businessinsider.com",
        "time": 1748968178000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "Jonathan Jacobs started a men's walking group in 2025. He said it's his way to fight the male loneliness epidemic. Jonathan Jacobs with his men's group, Men Walking, Men Talking, in Los Angeles.Courtesy of Jonathan JacobsJonathan Jacobs, 35, moved to Los Angeles from New York during the pandemic.He wanted more local friends in the sprawling city.He started a men's walking group to build his community and help other men meet each other.This as-told-to story is based on a conversation with Jonathan Jacobs, a marketer, writer, and community organizer who founded the LA chapter of Men Walking, Men Talking. The following has been edited for length and clarity.I moved from New York City to Los Angeles in the middle of the pandemic — not exactly the best time to make friends.It took me a year to make lasting connections with people, and four years to slowly build my social circle through my running club, professional industry, and friends of friends.Still, I wanted a greater sense of local community, especially with other men. In the summer of 2020, right before I moved to LA, my father passed away. On his deathbed, I learned he was an alcoholic — a secret he'd kept from me for 31 years.Because he was in a coma for two weeks before he died, I was never able to confront him about it. The experience made me realize how few, if any, intimate relationships he must have had. It also made me passionate about creating spaces where men could be more open with each other.Through my work, I met Mark Greene, who founded Men Walking, Men Talking, an NYC-based men's walking group. He suggested I lead my own.So, in 2025, I started the LA chapter.Jacobs with Men Walking, Men Talking.Jonathan JacobsCraving connectionIn January, I posted a short description on an LA-based Reddit page describing how I envisioned the group. The rules were simple: what was said in the group would be private, and we wouldn't talk about politics or religion so as not to isolate anyone. I added my email.About 60 men said they were interested. Seven of us showed up that first time.It was a bit awkward at first. I grappled with the idea of icebreakers to get through that initial silence.But I wanted men to explore why it was hard to be the first one to speak up. Slowly, we started to chat, letting our craving for connection lead the way.Men Walking, Men Talking attendance generally varies from a few men to nearly 20.Jonathan JacobsAs we've done more of our bi-monthly Sunday walks, the group has grown. Over 100 men have reached out to me, with up to 17 showing up at one time. Due to the demand, we've also started experimenting with \"pop-up walks\" in the middle of the week.We're a mix of married and divorced men, single fathers and childfree husbands, in our 20s through our 60s. Half of the group is made up of men who keep coming back.Men need low-stakes ways to hang outResearch shows that men prefer activities where they're side-by-side rather than facing each other.At the same time, some activities can make it harder to have meaningful conversations because the focus is on playing a game or watching a movie.Walking invited men to talk to each other, while also making the gathering as low-stakes and accessible as possible. This is especially crucial in LA: you can spend the night sitting in traffic and searching for parking, all for a hangout they're not sure will be fun. For men who are already on the fence about showing up, a long commute pretty much guarantees they won't come.Men who come to the walks repeatedly tell me that the low barrier to entry — no need to sign up or pay a fee to join — makes it easier for them to commit.Jacobs said the group continues to grow, with interest in more frequent meetups.Jonathan JacobsFor men who have trouble putting themselves out there to begin with, it gives them peace of mind that they don't have to stay the whole time or show up every week to feel like part of the group.One man recently showed up and was walking by himself. I came over to him and started breaking him open — he had some bad friendship experiences in the past and was trepidatious about making new connections. I'm glad he could come to the walk, even if it may have made him nervous at first.Leaning on each other in small, important waysThroughout my dad's life, really negative manifestations of masculinity, like not asking for help, affected our relationship.What's nice about the group is how quickly such a simple activity can morph into a meaningful bond, especially amid so many stories of male loneliness in the US.I still remember our second walk ever, right after my girlfriend had a health scare. Opening up to other men wasn't just cathartic; I also learned some had gone through similar situations.Jacobs grabbing a beer with some Men Walking, Men Talking members.Jonathan JacobsI've seen men break off after our hour-long walk to continue walking or to grab a beer somewhere. Sometimes, if only one other man shows up that day, he and I will just walk together, two strangers opening up to each other.I still talk to men who are interested but wary about attending their first walk; they're not sure if they'd fit in.More than anything, I wish every man who feels that way would know he's not alone. There's a group who'd love to talk to him. He just has to show up.Read the original article on Business Insider",
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "6863907177678534477",
        "title": "Jacobs secures $4.0B U.S. Air Force contract",
        "url": "https://seekingalpha.com/news/4454844-jacobs-secures-4_0b-u-s-air-force-contract",
        "site": "seekingalpha.com",
        "time": 1748952398000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "mdlz"
        ],
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "-4899969055071050611",
        "title": "Snack Maker Sues Aldi Grocery Chain Over Look-Alike Product Packaging",
        "url": "https://www.nytimes.com/2025/06/01/business/mondelez-aldi-packaging-lawsuit.html",
        "site": "nytimes.com",
        "time": 1748804921000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "Mondelez International, a corporate giant behind the name-brand versions of many snacks, contends that Aldi is mimicking its packaging to dupe customers. Products from Mondelez International, in the top row, and similar products from the Aldi supermarket chain, below. Mondelez contends in a federal lawsuit that Aldi is mimicking its packaging in a way that confuses customers.",
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "6385741485148700982",
        "title": "Mondelez targets 5% revenue growth for 2025 driven by chocolate pricing strategy",
        "url": "https://seekingalpha.com/news/4437516-mondelez-targets-5-percent-revenue-growth-for-2025-driven-by-chocolate-pricing-strategy",
        "site": "seekingalpha.com",
        "time": 1745971375000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "mdlz"
        ],
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "-3872408478813198448",
        "title": "Mondelez manages to eke out a bottom-line beat even as COGS surged",
        "url": "https://seekingalpha.com/news/4437475-mondelez-manages-to-eke-out-a-bottom-line-beat-even-as-cogs-surged",
        "site": "seekingalpha.com",
        "time": 1745967600000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "mdlz"
        ],
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "2314938534211251503",
        "title": "Mondelez Sales Hit by Pullback in Spending on Snacks, Crackers",
        "url": "https://www.bloomberg.com/news/articles/2025-04-29/mondelez-sales-hit-by-pullback-in-spending-on-snacks-crackers",
        "site": "bloomberg.com",
        "time": 1745958313000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "Mondelez International Inc. posted slower-than-expected sales growth as increasingly budget-conscious consumers buy fewer of its cookies, crackers and confections. Mondelez International Inc. brand candy including Sour Patch Kids, Oreos, and Cadbury chocolate.",
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "449933425421676468",
        "title": "Comparing Cadbury in the US and UK",
        "url": "https://www.businessinsider.com/comparing-cadbury-chocolate-between-us-and-uk-2025-4",
        "site": "businessinsider.com",
        "time": 1745868100000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "From exclusive items to portion sizes, we wanted to find all the differences between Cadbury products in the US and the UK. This is \"Food Wars.\"Read the original article on Business Insider From exclusive items to portion sizes, we wanted to find all the differences between Cadbury products in the US and the UK. This is \"Food Wars.\"Read the original article on Business Insider",
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "-4435542059950678938",
        "title": "Jacobs awarded $137M contract to rebuild U.S. Virgin Islands",
        "url": "https://seekingalpha.com/news/4431138-jacobs-awarded-137m-contract-to-rebuild-us-virgin-islands",
        "site": "seekingalpha.com",
        "time": 1744718192000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "mdlz"
        ],
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "-3716520617228762910",
        "title": "Investors Reweighting the Tech Sector and Mag7",
        "url": "https://www.bloomberg.com/news/videos/2025-04-08/investors-reweighting-the-tech-sector-and-mag7-video",
        "site": "bloomberg.com",
        "time": 1744134821000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "Jay Jacobs, US head of thematic and active ETFs at BlackRock, says they are leaning away from big tech companies with lots of international exposure and towards companies with a domestic focus. Jacobs joins Caroline Hyde and Ed Ludlow on “Bloomberg Technology.\" (Source: Bloomberg) BlackRock Inc Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "1226328466521457697",
        "title": "Cadbury unveils 'world's largest' Creme Egg",
        "url": "https://www.bbc.com/news/articles/c39jvll7yewo",
        "site": "bbc.com",
        "time": 1744034502000,
        "favicon_url": "https://static.tickertick.com/website_icons/bbc.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "Cadbury Chocolatiers spend two days crafting the giant Easter treat - just don't drop it on your foot.",
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "-8415415462532111496",
        "title": "Mondelez International and Vital Farms are top picks at Morgan Stanley in the food sector",
        "url": "https://seekingalpha.com/news/4424088-mondelez-international-and-vital-farms-are-top-picks-at-morgan-stanley-in-the-food-sector",
        "site": "seekingalpha.com",
        "time": 1742824929000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "mdlz"
        ],
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "-9141709351992536007",
        "title": "BlackRock's Jacobs on Thematic Trends Driving the Market",
        "url": "https://www.bloomberg.com/news/videos/2025-03-19/blackrock-s-jacobs-on-thematic-trends-driving-the-market-video",
        "site": "bloomberg.com",
        "time": 1742415863000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "Jay Jacobs, head of thematic and active ETFs at BlackRock, says investors are still betting on AI stocks and that there is value opportunity in high quality data. He spoke with Caroline Hyde on “Bloomberg Technology.\" (Source: Bloomberg)",
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "6537955856037872125",
        "title": "Jacobs gets chosen to support Idaho airport expansion",
        "url": "https://seekingalpha.com/news/4419294-jacobs-gets-chosen-to-support-idaho-airport-expansion",
        "site": "seekingalpha.com",
        "time": 1741693937000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "mdlz"
        ],
        "tickers": [
            "mdlz"
        ]
    },
    {
        "id": "-3348223648010777680",
        "title": "Oreo-Maker Mondelez Turns to New SEC Guidance to Quiet Call for Russia Transparency",
        "url": "https://www.bloomberg.com/news/articles/2025-03-07/mondelez-is-looking-to-discard-a-shareholder-resolution-on-its-russia-business",
        "site": "bloomberg.com",
        "time": 1741376994000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "mdlz"
        ],
        "description": "Mondelez International Inc. is asking regulators for permission to ignore a shareholder proposal that calls for greater transparency on the Oreo maker’s Russian operations.",
        "tickers": [
            "mdlz"
        ]
    }
]