[
    {
        "id": "-6569549770305215657",
        "title": "Procter & Gamble to cut 7,000 jobs as part of broader restructuring",
        "url": "https://www.cnbc.com/2025/06/05/procter-gamble-job-cuts-restructuring.html",
        "site": "cnbc.com",
        "time": 1749138591000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "pg"
        ],
        "description": "CFO Andre Schulten said more details about the job cuts will be shared on the company's fiscal fourth-quarter earnings call in July.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-5058364952834129384",
        "title": "Procter & Gamble mass layoffs loom as consumer goods giant plans 7,000 job cuts. Here’s what to know",
        "url": "https://www.fastcompany.com/91346770/procter-and-gamble-layoffs-pg-stock-steady-amid-mass-job-cuts",
        "site": "fastcompany.com",
        "time": 1749126480000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "pg"
        ],
        "description": "U.S. consumer goods giant Procter & Gamble has announced that it will lay off 7,000 workers over the company’s next two fiscal years. The staff reductions come at a time when the geopolitical environment is “unpredictable,” the company said, while consumers are facing “greater uncertainty.” Here’s what you need to know about P&G’s job cuts. 7,000 P&G jobs to be lost On June 5, as two of Procter & Gamble’s executives—chief operating officer Shailesh Jejurikar and chief financial officer Andre Schulten—were speaking at the Deutsche Bank dbAccess Global Consumer Conference in Paris, the company announced a new growth strategy. That growth strategy consists of three elements: a revamping of its portfolio of goods, its supply chains, and its organizational design. Unfortunately for a great number of Procter & Gamble’s employees, the “organizational design” part of its revamp is just another term for layoffs. P&G executives said that as part of that organizational design revamp, the company would be cutting 7,000 jobs over its next two fiscal years. Procter & Gamble is currently in its fourth quarter of fiscal 2025, which means the layoffs should be complete by the end of its fourth quarter of fiscal 2027. StockAnalysis.com reported that as of June 2024, Procter & Gamble had 108,000 employees worldwide, which means the reduction would equate to about 6% of its workforce. In a press release, Procter & Gamble said the job cuts would come from non-manufacturing roles, and that they would equate to about a 15% reduction in the company’s non-manufacturing workforce. P&G says the job cuts are being done to enable “an even more agile, empowered and accountable organization design” and that they will make “roles broader, teams smaller, work more fulfilling and more efficient.” Portfolio and supply-chain changes coming, too In addition to the job cuts, Procter & Gamble said it would be making “interventions” regarding its supply chain. These interventions include both “right-sizing and right-locating production.” The company also said it will be reviewing its portfolio choices and will divest of some of its brands entirely, while exiting “some categories, brands and product forms in individual markets.” P&G did not announce which brands will be divested of, but the company currently owns many of the biggest household name consumer goods brands in the world, including Always, Bounty, Charmin, Dawn, Downy, Febreze, Gillette, Head & Shoulders, Olay, Oral-B, Pampers, Pantene, Tide, and Vicks. What is driving the job and brand cuts? What’s interesting about Procter & Gamble’s announcements are some of the word choices they used. While the company did not directly reference President Donald Trump’s ongoing tariff war as the reason for its three-pronged revamp, it’s hard not to feel that the current tariff uncertainty wasn’t at the front of P&G executives’ minds when making these decisions. In the press release announcing the changes, the company acknowledged that “consumers face greater uncertainty” in the future and that the “geopolitical environment” was “unpredictable.” A particularly telling piece of language is when P&G spoke of its upcoming supply-chain changes, noting that it was “right-locating production” of some of its supply-chain components. Like many U.S. companies, P&G manufactures many of its products overseas in countries that are being hit hard by Trump’s tariffs. Those tariffs will raise the total cost of making those goods, leading to reduced margins. If a country can shift its production from a high-tariffed country to a lower-tariffed one, that move can help mitigate some of the increased tariff-related costs. Companies also fear that a tariff-fueled recession is increasingly likely in America, if not the entire world. If that happens, consumers will cut back on spending, which will lead to lower sales. One of the fastest ways that a company can compensate for lower sales is by reducing its workforce. However, as the Wall Street Journal notes, Procter & Gamble has stated that the layoffs aren’t being made for cost-cutting measures and instead are being done to create a better workplace structure. How did PG stock react to the news? Following the announcement at the Paris conference today, Procter & Gamble’s stock, which trades under the ticker “PG” on the New York Stock Exchange (NYSE), has remained relatively flat in premarket trading. Procter & Gamble reported its most recent financial results for Q3 2025 in April. The company reported net sales of $19.8 billion for the third quarter, representing a 2% decrease compared to the same period a year earlier. Its gross profit was also down 3% for the quarter versus the same quarter a year earlier. PG shares have fluctuated widely since the beginning of the year. They nearly reached $180 per share in early March, while falling as low as below $157 in April.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "8471161897710897648",
        "title": "P&G becomes the latest consumer giant to cut jobs, with 7,000 employees set to be fired",
        "url": "https://www.marketwatch.com/story/p-g-becomes-the-latest-consumer-giant-to-cut-jobs-with-7-000-employees-set-to-be-fired-1355f160?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1749125580000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Brand divestments also a feature of what Procter & Gamble CFO Andre Schulten described as a restructuring program.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-6599045705665400618",
        "title": "Procter & Gamble to Cut 7,000 Jobs Amid Tariff Uncertainty",
        "url": "https://www.nytimes.com/2025/06/05/business/procter-gamble-cut-jobs.html",
        "site": "nytimes.com",
        "time": 1749124104000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "pg"
        ],
        "description": "The reductions will come over two years as the consumer products giant seeks to reorganize. Procter & Gamble makes products like Tide laundry detergent and Pampers diapers. It’s facing challenges from higher tariffs and other geopolitical headwinds.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "6780330832126231738",
        "title": "Procter & Gamble to cut up to 7,000 office jobs amid 'fierce' competition",
        "url": "https://www.businessinsider.com/procter-gamble-cut-thousands-jobs-fierce-competition-consumer-growth-brands-2025-6",
        "site": "businessinsider.com",
        "time": 1749120311000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Procter & Gamble's brands include Tide laundry detergent.ASSOCIATED PRESSProcter & Gamble plans to cut up to 7,000 office jobs, or 15%, of its non-manufacturing workforce.The cuts will be implemented over the next two years, the company said in a presentation.P&G says it plans to exit some categories, brands, and product forms in certain markets.The maker of Tide and Pampers plans to cut as many as 7,000 office jobs, or 15% of its non-manufacturing workforce, over the next two years.Procter & Gamble revealed the job cuts in a presentation from the Deutsche Bank Global Consumer Conference that was published on its website on Thursday.CFO Andre Schulten and COO Shailesh Jejurikar gave the presentation, which outlined a two-year drive starting in the 2026 financial year to boost growth and value creation.P&G said consumers faced greater uncertainty, competition was fierce, the geopolitical environment was unpredictable, and technology was rapidly transforming many aspects of our lives.\"We can unlock significant growth by better meeting the needs of currently unserved and under-served consumers, expanding into new segments, and growing markets to best-in-class levels,\" per the presentation.The changes were an \"intentional acceleration of the current strategy to widen P&G's margin of advantage in superiority, fueled by productivity, to win in the increasingly challenging environment in which we compete.\"P&G plans to exit some categories, brands, and product forms in certain markets, saying it would reveal more details in the coming months.The changes mean it expects to cut up to 7,000 non-manufacturing roles, or about 15% of that workforce, over the next two years. No further information about regions or sites was given in the presentation.\"Our top priority remains delivering balanced growth and value creation to delight consumers, customers, employees, society and shareowners alike,\" it added.P&G's proposed cuts are the latest in a swathe of corporate job reductions in recent months, as companies battle with economic uncertainty linked to Trump's tariffs and the potential impacts of AI.P&G did not immediately respond to a request for further comment.This is a developing story, please check back for further updates.Read the original article on Business Insider Procter & Gamble's brands include Tide laundry detergent.ASSOCIATED PRESSProcter & Gamble plans to cut up to 7,000 office jobs, or 15%, of its non-manufacturing workforce.The cuts will be implemented over the next two years, the company said in a presentation.P&G says it plans to exit some categories, brands, and product forms in certain markets.The maker of Tide and Pampers plans to cut as many as 7,000 office jobs, or 15% of its non-manufacturing workforce, over the next two years.Procter & Gamble revealed the job cuts in a presentation from the Deutsche Bank Global Consumer Conference that was published on its website on Thursday.CFO Andre Schulten and COO Shailesh Jejurikar gave the presentation, which outlined a two-year drive starting in the 2026 financial year to boost growth and value creation.P&G said consumers faced greater uncertainty, competition was fierce, the geopolitical environment was unpredictable, and technology was rapidly transforming many aspects of our lives.\"We can unlock significant growth by better meeting the needs of currently unserved and under-served consumers, expanding into new segments, and growing markets to best-in-class levels,\" per the presentation.The changes were an \"intentional acceleration of the current strategy to widen P&G's margin of advantage in superiority, fueled by productivity, to win in the increasingly challenging environment in which we compete.\"P&G plans to exit some categories, brands, and product forms in certain markets, saying it would reveal more details in the coming months.The changes mean it expects to cut up to 7,000 non-manufacturing roles, or about 15% of that workforce, over the next two years. No further information about regions or sites was given in the presentation.\"Our top priority remains delivering balanced growth and value creation to delight consumers, customers, employees, society and shareowners alike,\" it added.P&G's proposed cuts are the latest in a swathe of corporate job reductions in recent months, as companies battle with economic uncertainty linked to Trump's tariffs and the potential impacts of AI.P&G did not immediately respond to a request for further comment.This is a developing story, please check back for further updates.Read the original article on Business Insider",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "5947189393468139024",
        "title": "Procter & Gamble to cut 7,000 non-manufacturing jobs over next two years amid tariff uncertainty",
        "url": "https://seekingalpha.com/news/4455732-procter-gamble-to-cut-7000-non-manufacturing-jobs-over-next-two-years-amid-tariff-uncertainty",
        "site": "seekingalpha.com",
        "time": 1749115832000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-3138670412716733770",
        "title": "P&G Plans to Cut 15% of Office Jobs Over Next Two Years",
        "url": "https://www.bloomberg.com/news/articles/2025-06-05/p-g-plans-to-cut-15-of-office-jobs-over-next-two-years",
        "site": "bloomberg.com",
        "time": 1749114511000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Procter & Gamble Co. plans to cut as many as 7,000 non-manufacturing jobs over the next two years as part of an effort to improve productivity. Procter & Gamble Co. signage on the floor of the New York Stock Exchange (NYSE) in New York, US, on Tuesday, Dec. 31, 2024. US stocks dropped during the last trading session of an otherwise stellar year as investors ponder the monetary policy outlook for 2025. Photographer: Michael Nagle/Bloomberg",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "3199682509797214252",
        "title": "Procter & Gamble to slash 7,000 jobs in cost-cutting drive",
        "url": "https://www.ft.com/content/a1bf888d-f5f4-4790-87a6-4afdbd906cb5",
        "site": "ft.com",
        "time": 1749112111000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "pg"
        ],
        "similar_stories": [
            "-6569549770305215657",
            "-6599045705665400618",
            "5947189393468139024"
        ],
        "description": "Household goods group to axe 15% of non-manufacturing roles over next two years amid tariff uncertainty",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "2611849008905446508",
        "title": "Costco's Kirkland brand generates more revenue than Lowe's and Procter & Gamble",
        "url": "https://seekingalpha.com/news/4449907-costcos-kirkland-brand-generates-more-revenue-than-lowes-and-procter-gamble",
        "site": "seekingalpha.com",
        "time": 1747650656000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "8015019075550647460",
        "title": "Quotes from the quarter: What CEOs and CFOs are saying about the state of ad spend",
        "url": "https://www.modernretail.co/marketing/quotes-from-the-quarter-what-ceos-and-cfos-are-saying-about-the-state-of-ad-spend/?utm_campaign=modernretaildis&utm_medium=rss&utm_source=general-rss",
        "site": "modernretail.co",
        "time": 1746676800000,
        "favicon_url": "https://static.tickertick.com/website_icons/modernretail.co.ico",
        "tags": [
            "pg"
        ],
        "description": "Nothing makes a CMO freeze faster than not knowing what’s possibly around the corner. Here's what executives from Publicis Groupe, Procter & Gamble, Coca-Cola and more had to say about the state of ad spend during recent earnings calls. This story was originally published on Modern Retail’s sister publication, Digiday. The longer this earnings season drags on, the clearer it becomes: the ad slowdown might be steeper than anyone first thought. It’s not the tariffs themselves spooking advertisers – its the fog of uncertainty they create. And nothing makes a CMO freeze faster than not knowing what’s possibly around the corner. Publicis Groupe CEO Arthur Sadoun nailed it early in the cycle, telling analysts: “Until there is more clarity, this is not going to get better.”Continue reading this article on modernretail.co. Sign up for Modern Retail newsletters to get the latest on the shifting dynamics between retail’s old and new guards.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "1082821929026674592",
        "title": "Insider trades: Tesla, Citigroup, Morgan Stanley among notable names this week | $PG $AXP $C $BMY $LUV",
        "url": "https://seekingalpha.com/news/4440638-insider-trades-tesla-citigroup-morgan-stanley-among-notable-names-this-week",
        "site": "seekingalpha.com",
        "time": 1746284580000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-1543948696109912449",
        "title": "Tide Expands Availability of Credit Product to All UK Small Business Members",
        "url": "https://www.pymnts.com/smbs/2025/tide-expands-availability-credit-product-all-united-kingdom-small-business-members/",
        "site": "pymnts.com",
        "time": 1746117449000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Business financial platform Tide now offers its credit product, Credit Flex, to all its members in the United Kingdom. Tide expanded the availability of Credit Flex after seeing the success of a pilot launched in 2023, in which it made the credit product available to 5,000 small- to medium-sized business (SMB) members, and after receiving […] The post Tide Expands Availability of Credit Product to All UK Small Business Members appeared first on PYMNTS.com. Business financial platform Tide now offers its credit product, Credit Flex, to all its members in the United Kingdom. Tide expanded the availability of Credit Flex after seeing the success of a pilot launched in 2023, in which it made the credit product available to 5,000 small- to medium-sized business (SMB) members, and after receiving a 100 million pound (about $133 million) securitization debt facility from London-based investment manager Fasanara Capital, the company said in a Thursday (May 1) press release. Credit Flex is a short-term loan facility that is integrated into the Tide app and allows eligible Tide members to immediately access up to 5,000 pounds in credit, according to the release. The loans have a four-month term and a 3.3% per month interest rate. “We know flexible, short-term working capital is critical to the success of small businesses where managing cash flow is a constant challenge,” Tide CEO Oliver Prill said in the release. “With the new Fasanara facility, we are able to extend the Credit Flex mechanism in a way that we believe will benefit more of our members, improving the efficiency and responsiveness of our service provision.” Fasanara said in a Thursday press release that the debt facility it provided to Tide is expected to enable the business financial platform to provide over 300 million pounds in working capital loans to potentially hundreds of thousands of U.K. SMB borrowers. “Our partnership with Tide represents a perfect alignment of vision — leveraging FinTech innovation to provide efficient, tailored credit solutions at scale,” Fasanara founder and CEO Francesco Filia said in the release. Tide has 650,000 SMB members in the U.K., according to its Thursday press release. The company also has 650,000 SMBs in India and launched in Germany in May 2024. When Tide announced in March 2024 that it planned to expand its business financial platform to Germany, it said a growing portion of the country’s nearly 3 million small businesses are using digital solutions to manage their finances. “Looking at what is on offer for [SMBs] in Germany, we believe there is a huge opportunity for Tide,” Prill said at the time in a press release. Tide offers business accounts, related banking services, and administrative services like invoicing and accounting, per the Thursday press release. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Tide Expands Availability of Credit Product to All UK Small Business Members appeared first on PYMNTS.com.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-6278084849282556262",
        "title": "Gillette and EA Sports FC partner on in-game ads and soccer Ultimate Team packs",
        "url": "https://venturebeat.com/games/gillette-and-ea-sports-fc-partner-on-in-game-ads-and-soccer-ultimate-team-packs/",
        "site": "venturebeat.com",
        "time": 1746100800000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Gillette and EA Sports FC have partnered in a global brand deal aimed at elevating how fans experience the game of soccer on and off the pitch. Gillette and EA Sports FC have partnered in a global brand deal aimed at elevating how fans experience the game of soccer on and off the pitch.Read More",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-4296083564346921209",
        "title": "Marketing Briefing: Major marketers like Colgate-Palmolive, P&G note ‘pensive and anxious’ consumers during earnings",
        "url": "https://digiday.com/marketing/marketing-briefing-major-marketers-like-colgate-palmolive-pg-note-pensive-and-anxious-consumers-during-earnings/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
        "site": "digiday.com",
        "time": 1745899260000,
        "favicon_url": "https://static.tickertick.com/website_icons/digiday.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Major brand marketers had C-Suite executives note their own worries about consumers during earnings calls. Earnings season can be windows into what major marketers’ are thinking — especially amid the ongoing economic uncertainty caused by President Trump’s tariffs. In recent weeks, marketers have experienced decision paralysis; been expecting chaos (and regularly using the replanning muscle they formed early on in the pandemic); pushed for more flexibility in deals; and focused on operational challenges ahead of marketing cuts. They’ve also zeroed in on lackluster consumer sentiment. Major marketers like PepsiCo, Chipotle, Colgate-Palmolive, American Airlines and Procter & Gamble, had C-Suite executives note their own worries about consumers’ worries during their respective earnings calls. This is a member-exclusive article from Digiday. Continue reading it on digiday.com and subscribe to continue reading content like this.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "4160327020069999296",
        "title": "SA analyst downgrades: TSLA, AAPL, T, PG, HPE, GILD, LRCX, ARCC | $AAPL $T $PG $GILD $LRCX",
        "url": "https://seekingalpha.com/news/4436428-sa-analyst-downgrades-tsla-aapl-t-pg-hpe-gild-lrcx-arcc",
        "site": "seekingalpha.com",
        "time": 1745864792000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "52683062185493473",
        "title": "CPG Companies Seek Efficiencies and Diversification to Mitigate Tariff Challenges",
        "url": "https://www.pymnts.com/news/retail/2025/cpg-companies-seek-efficiencies-and-diversification-to-mitigate-tariff-challenges/",
        "site": "pymnts.com",
        "time": 1745548000000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Consumer packaged goods (CPG) companies are working to add efficiencies and diversify their sourcing as they deal with the effects of current and potential future tariffs. Procter & Gamble (P&G) executives said during a Thursday (April 24) earnings call that the biggest impacts the company is experiencing so far are on its imports of raw […] The post CPG Companies Seek Efficiencies and Diversification to Mitigate Tariff Challenges appeared first on PYMNTS.com. Consumer packaged goods (CPG) companies are working to add efficiencies and diversify their sourcing as they deal with the effects of current and potential future tariffs. Procter & Gamble (P&G) executives said during a Thursday (April 24) earnings call that the biggest impacts the company is experiencing so far are on its imports of raw and packaging materials and some finished products from China and its exports of finished products from the U.S. to Canada, due to that country’s responsive tariffs. On the demand side, P&G has seen consumers “pause” in response to not only tariffs but also uncertainty in the markets and the job market, leading to lower consumption levels, P&G Chief Financial Officer Andre Schulten said Thursday during the company’s quarterly earnings call. “We will be looking for every opportunity to mitigate the impact, including sourcing flexibility and productivity improvements,” Schulten said. “We also need to consider some level of consumer pricing in affected categories and markets.” PepsiCo said Thursday during its earnings report that it expects to see elevated levels of volatility and uncertainty in the macroeconomic environment, pockets of geopolitical tension, and incremental supply chain costs related to tariffs through the end of 2025. In prepared management remarks attributed to both Chairman and CEO Ramon Laguarta and Executive Vice President and Chief Financial Officer Jamie Caulfield, PepsiCo said it expects these pressures to keep consumers “choiceful and value conscious.” “We are actively working on mitigation strategies to reduce these incremental costs over time, including driving greater cost savings, adjusting sourcing of key inputs, and sharpening our revenue management tactics,” the executives said in the remarks. PepsiCo will also continue to invest in digital capabilities that will enhance its consumer insights, trade promotion management, demand forecast and supply planning, per the remarks. Bloomberg reported Thursday that both Unilever and Nestle have already raised prices in response to higher commodity costs and will continue to do so if tariffs drive those costs even higher. Nestle CEO Laurent Freixe told journalists, per the report, “We are trying to take as much price as we can to cover our costs while being mindful of the consumer response in a competitive environment.” The post CPG Companies Seek Efficiencies and Diversification to Mitigate Tariff Challenges appeared first on PYMNTS.com.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-945280788945013812",
        "title": "Consumer companies are bracing for lower profits as tariffs force shoppers to rethink spending",
        "url": "https://www.cnbc.com/2025/04/24/trump-tariffs-pepsi-chipotle-pg-cut-earnings-forecasts.html",
        "site": "cnbc.com",
        "time": 1745514862000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "pg"
        ],
        "description": "PepsiCo, Chipotle and Procter & Gamble are among the companies that lowered their forecasts.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "163712610345447124",
        "title": "Procter & Gamble sees consumers hit ‘pause’ amid tariffs, job-market uncertainty",
        "url": "https://www.marketwatch.com/story/procter-gamble-shares-slip-on-q3-revenue-miss-lowered-guidance-3da6da00?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1745514780000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Worries about higher prices from tariffs, a slowing economy and falling stock prices have taken a toll on consumers.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-2844381737479751893",
        "title": "Pepsico Cuts Growth Forecast Amid Tariffs and Slowed Consumer Spending",
        "url": "https://www.nytimes.com/2025/04/24/business/pepsico-earnings-economy-tariffs.html",
        "site": "nytimes.com",
        "time": 1745514679000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "pg"
        ],
        "description": "PepsiCo’s earnings call pointed to anxious consumers as to why sales had slowed, echoing comments made by Chipotle and Procter & Gamble. Pepsico cut its growth forecast, pointing to tariff volatility and a pullback in consumer spending.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "1974516053156242769",
        "title": "Procter & gamble outlines 2% organic sales growth target for fiscal 2025 amid innovation investments",
        "url": "https://seekingalpha.com/news/4435108-procter-and-gamble-outlines-2-percent-organic-sales-growth-target-for-fiscal-2025-amid",
        "site": "seekingalpha.com",
        "time": 1745513421000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "2700230868713754160",
        "title": "Stock Movers: American Airlines, P&G, Newmont (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-24/stock-movers-american-airlines-p-g-newmont-podcast",
        "site": "bloomberg.com",
        "time": 1745509596000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Source: Bloomberg, 4:12 Procter & Gamble Co/The Photographer: Tom Uhlman/Bloomberg",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "3153934390602931672",
        "title": "5 stocks to watch on Thursday: GOOGL, INTC, PG, MRK and CMG | $GOOG $PG $INTC $MRK $CMG",
        "url": "https://seekingalpha.com/news/4434864-5-stocks-to-watch-on-thursday-googl-intc-pg-mrk-and-cmg",
        "site": "seekingalpha.com",
        "time": 1745500925000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "7404460992231183277",
        "title": "Procter & Gamble shares slip on Q3 revenue miss, lowered guidance",
        "url": "https://www.marketwatch.com/story/procter-gamble-shares-slip-on-q3-revenue-miss-lowered-guidance-3da6da00?mod=mw_rss_marketpulse",
        "site": "marketwatch.com",
        "time": 1745494860000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "4998049567483082720",
        "title": "Procter & Gamble slashes profit guidance as trade war hits consumer demand",
        "url": "https://seekingalpha.com/news/4434652-procter-gamble-slashes-profit-guidance-as-trade-war-hits-consumer-demand",
        "site": "seekingalpha.com",
        "time": 1745493787000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "8721279749158344406",
        "title": "Earnings Snapshot: Procter & Gamble reports mixed FQ3, cuts FY2025 outlook",
        "url": "https://seekingalpha.com/news/4434749-earnings-snapshot-procter-gamble-reports-mixed-fq3-cuts-fy2025-outlook",
        "site": "seekingalpha.com",
        "time": 1745493487000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-5661113737686732145",
        "title": "P&G Lowers Sales Guidance on ‘Volatile’ Market Conditions",
        "url": "https://www.bloomberg.com/news/articles/2025-04-24/p-g-lowers-sales-guidance-citing-volatile-market-conditions",
        "site": "bloomberg.com",
        "time": 1745492400000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Procter & Gamble Co. cut its annual sales and profit outlook, citing tariffs and volatility in consumer demand. Procter & Gamble Co. signage on the floor of the New York Stock Exchange. Photographer: Michael Nagle/Bloomberg",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "1845159276488587149",
        "title": "Procter & Gamble FQ3 preview: Growth targets in focus amid slowdown in retail spending",
        "url": "https://seekingalpha.com/news/4434063-procter-gamble-fq3-preview-growth-targets-in-focus-amid-slowdown-in-retail-spending",
        "site": "seekingalpha.com",
        "time": 1745418173000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-2710041721596229198",
        "title": "NWN Wins Blockbuster Five-Year Deal With The Kraft Group To Drive AI Era Tech Blitz",
        "url": "https://www.crn.com/news/networking/2025/nwn-wins-blockbuster-five-year-deal-with-the-kraft-group-to-drive-ai-era-tech-blitz",
        "site": "crn.com",
        "time": 1744804800000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Fast-growing solution provider NWN has inked a five-year strategic partnership to transform the IT infrastructure for The Kraft Group and all its businesses, including The New England Patriots and Gillette Stadium.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "8668480141868766488",
        "title": "The Kraft Group CIO Michael Israel On The ‘Enormous’ NWN Deal And How AI Is Changing Decision-Making",
        "url": "https://www.crn.com/news/networking/2025/the-kraft-group-cio-michael-israel-on-the-enormous-nwn-deal-and-how-ai-is-changing-decision-making",
        "site": "crn.com",
        "time": 1744804800000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "pg"
        ],
        "description": "The Kraft Group CIO Michael Israel said the “enormous” five-year strategic partnership with NWN is going to leverage the power of AI to make The New England Patriots and Gillette Stadium more efficient.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-2862860348448546931",
        "title": "P&G Targeted by EU Antitrust Watchdog Alongside Coca-Cola Raids",
        "url": "https://www.bloomberg.com/news/articles/2025-04-10/p-g-targeted-by-eu-antitrust-watchdog-alongside-coca-cola-raids",
        "site": "bloomberg.com",
        "time": 1744279244000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Procter & Gamble Co., the maker of Pampers diapers and Oral-B toothbrushes, was the unidentified target of an informal antitrust probe by European Union watchdogs, according to people familiar with the case. The Proctor & Gamble Co. logo.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-3780311617774011968",
        "title": "Procter & Gamble raises quarterly dividend by 5% to $1.0568/share",
        "url": "https://seekingalpha.com/news/4429560-procter-gamble-raises-quarterly-dividend-by-5-to-10568share",
        "site": "seekingalpha.com",
        "time": 1744143588000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "2798881017915250686",
        "title": "Investors take shelter from tariff shock in consumer staple favorites like Procter & Gamble and Coca-Cola",
        "url": "https://seekingalpha.com/news/4428355-investors-take-shelter-from-tariff-shock-in-consumer-staple-favorites-like-procter-gamble-and-coca-cola",
        "site": "seekingalpha.com",
        "time": 1743679074000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-1632729633275231962",
        "title": "How Generative AI Affects Teamwork at Companies",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/how-generative-ai-affects-teamwork-at-companies/",
        "site": "pymnts.com",
        "time": 1743540416000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "pg"
        ],
        "description": "Can AI effectively replace a human teammate? Researchers from Harvard, Wharton, Procter & Gamble and other institutions did an experiment to find out. They asked 776 professionals from P&G to come up with new product ideas and measured their performance. Half used artificial intelligence (AI) and the other half didn’t. The results? “AI significantly enhances […] The post How Generative AI Affects Teamwork at Companies appeared first on PYMNTS.com. Can AI effectively replace a human teammate? Researchers from Harvard, Wharton, Procter & Gamble and other institutions did an experiment to find out. They asked 776 professionals from P&G to come up with new product ideas and measured their performance. Half used artificial intelligence (AI) and the other half didn’t. The results? “AI significantly enhances performance: Individuals with AI matched the performance of teams without AI, demonstrating that AI can effectively replicate certain benefits of human collaboration,” the researchers said in a March 2025 research paper. “Moreover, AI breaks down functional silos.” When it comes to effectiveness, employees and teams using AI were also three times more likely to suggest product ideas in the top 10% of solutions, based on a ranking by human experts. This can translate to real revenues. The paper’s findings carry implications for optimal team sizes and team make-up at organizations. It could reshape traditional teamwork and redefine how expertise is shared in the workplace. The study, “The Cybernetic Teammate,” conducted workshops among P&G professionals from May to July 2024. The authors measured performance gains, broadening of expertise and level of social engagement. What made this study especially meaningful was its real-world setting. The experiment embedded AI directly into the company’s actual product development process — it was not made in isolated tests. Participants were tasked with solving real business challenges across actual brand categories. P&G’s global brands include Pampers, Head & Shoulders, Old Spice, Olay, Gillette, Oral-B, Braun, Olay and many more. The study’s findings could be unsettling for workers. Among those who use generative AI weekly, 74% said it can automate or replace elements of their job, according to a January 2025 PYMNTS Intelligence report. However, not all research agrees with the Harvard study. According to an October 2024 MIT paper, human-AI collaborations do not always lead to outperformance compared to humans or AI acting alone. Reasons for this counterintuitive finding include communication barriers, trust issues, ethical concerns and the need for effective coordination between humans and AI. Read more: AI’s Next Job Is as Your Collaborative ‘Digital Chief of Staff’ Inside the Experiment The researchers created four types of teams: individuals working alone without AI, teams of two working without AI, individuals working with AI, and teams of two working with AI. P&G employees were asked to come up with new product ideas in four lines of business: Baby care, feminine care, grooming and oral care. The target markets were the Americas and Europe. Their solutions were graded by human experts for quality. The generative AI tool used was built on OpenAI’s GPT-4 foundation model accessed through Microsoft Azure cloud. The experiments took place from May to July 2024. The researchers discovered that one person using AI could replicate the work of two-person teams not using AI. That means one person paired with gen AI produced ideas and solutions of equal quality to those generated by a traditional human duo. But the implications go beyond productivity. At P&G, cross-functional collaboration between R&D and Commercial divisions is a foundational part of product innovation. However, each group tends to gravitate toward solutions in their expertise: R&D favoring technical solutions, Commercial leaning toward market-friendly ideas. When employees used AI, those silos dissolved. Commercial experts suggested more technical ideas, and R&D specialists incorporated more marketplace ideas. AI served to expand access to specialized knowledge. This finding can be a revelation to companies dealing with knowledge silos. “AI serves not just as an information provider but as an effective boundary-spanning mechanism, helping professionals reason across traditional domain boundaries and approach problems more holistically,” the authors said. Breaking down the results: Quality of work: Relative performance or employees using AI was “significantly higher” than those not using AI. Productivity: A single person using AI took 16.4% less time on average than the solo employee not using AI, while for team using AI, they took 12.7% less time. Expertise: Less experienced employees were able to match more experienced colleagues by using AI. New ideas: Without AI, employees stick to what they know. With AI, employees can think of ideas even outside their areas of expertise. Idea rankings: Ideas suggested by employees using AI were three times more likely to land in the top 10% of submissions. Social impact: Individuals using AI reported positive emotions that match or surpass those of two-person teams not using AI, suggesting that AI can perform the social role of a teammate. “We found that individuals randomly assigned to use AI did as well as a team of two without AI,” co-author and Wharton professor Ethan Mollick concluded, in a LinkedIn post. “AI-augmented teams produced more exceptional solutions. The teams using AI were happier as well.” Thus, the standard view of AI as productivity tool “may be too limiting. Today’s AI can function as a kind of teammate, offering better performance, expertise sharing, and even positive emotional experiences,” Mollick said. For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. The post How Generative AI Affects Teamwork at Companies appeared first on PYMNTS.com.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "-2778379854996816181",
        "title": "This Hair-Removal Device Saved Me From a Year of Painful Bikini Waxes",
        "url": "https://www.nytimes.com/wirecutter/reviews/braun-silk-expert-pro-review/?utm_source=rss&utm_medium=feed&utm_campaign=RSS%20Feed",
        "site": "nytimes.com",
        "time": 1742486142000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "pg"
        ],
        "description": "It was only after I unboxed Braun’s at-home hair removal device—and showered and shaved and started mentally preparing to blast a strong, laser-like light along my bikini line—that I found myself wondering if I had lost my mind. I had learned about Braun’s Silk-Expert Pro 5 on TikTok, and in my defense, the woman talking… It was only after I unboxed Braun’s at-home hair removal device—and showered and shaved and started mentally preparing to blast a strong, laser-like light along my bikini line—that I found myself wondering if I had lost my mind.I had learned about Braun’s Silk-Expert Pro 5 on TikTok, and in my defense, the woman talking about it seemed trustworthy. She was a Los Angeles–based Pilates instructor, after all, and I had fallen down a rabbit hole watching her series about things that her private clients recommended to her. And if there’s one thing I trust rich people in LA who do a lot of Reformer Pilates to recommend, it’s effective beauty treatments. The Pilates instructor also said it works “really well.”In hindsight, this was embarrassingly little research for me to have done before spending well over $300 on a gadget that would semi-permanently stop my body hair from regrowing.",
        "tickers": [
            "pg"
        ]
    },
    {
        "id": "7006447388258567163",
        "title": "The flu season was so heavy that it may have pushed up earnings for some stocks | $PG $JNJ $WBA $QDEL $CVS",
        "url": "https://seekingalpha.com/news/4417109-the-flu-season-was-so-heavy-that-it-may-have-pushed-up-earnings-for-some-stocks",
        "site": "seekingalpha.com",
        "time": 1741116851000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pg"
        ],
        "tickers": [
            "pg"
        ]
    }
]