[
    {
        "id": "9182118576999908964",
        "title": "50% Downside For Coca-Cola Stock?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/17/50-downside-for-coca-cola-stock/",
        "site": "forbes.com",
        "time": 1750156241000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Is KO stock currently overpriced, and is it possible that it could face a significant correction, perhaps by 25-30% or even 50% to below $40? Is KO stock currently overpriced, and is it possible that it could face a significant correction, perhaps by 25-30% or even 50% to below $40?",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-140212643381948999",
        "title": "As Companies Abandon Climate Pledges, Is There a Silver Lining?",
        "url": "https://www.bloomberg.com/news/features/2025-06-12/climate-pledges-dropped-by-coca-cola-bp-hsbc-as-planet-heats-up",
        "site": "bloomberg.com",
        "time": 1749729614000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Coca-Cola, BP, HSBC and countless others are dropping environmental goals, highlighting the inadequacy of voluntary action.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "6720231541792601336",
        "title": "Coca-Cola is named a top beverage stock pick at Morgan Stanley",
        "url": "https://seekingalpha.com/news/4456789-coca-cola-is-named-a-top-beverage-stock-pick-at-morgan-stanley",
        "site": "seekingalpha.com",
        "time": 1749552378000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "8336682026149319404",
        "title": "Consumer staples favorites Kroger and Coca-Cola fall as investors go on the offensive",
        "url": "https://seekingalpha.com/news/4455096-consumer-staples-favorites-kroger-and-coca-cola-fall-as-investors-go-on-the-offensive",
        "site": "seekingalpha.com",
        "time": 1748972365000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-8433086113357249969",
        "title": "Does the ‘McMigraine meal’ really help with headaches? TikTok thinks so",
        "url": "https://www.fastcompany.com/91345337/does-the-mcmigraine-meal-really-help-with-headaches-tiktok-thinks-so",
        "site": "fastcompany.com",
        "time": 1748964444000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Migraine sufferers have heard it all: ice hats, essential oils, ginger tea. The latest advice? Head to McDonald’s and order a large Coca-Cola and fries, dubbed the “McMigraine meal.” One viral video with 5.7 million views reads: “Trying McDonald’s chips and a Diet Coke because I’ve had a headache for 48 hours and TikTok said it would help.” In the caption, the TikTok creator confirmed the hack worked. @millyhancockk Can confirm it works ♬ original sound – Franklin Saint Another posted, “the migraine girls get it” while pulling up to a McDonald’s drive-through. A third asked, “can someone please explain why the McMigraine always works?” While TikTok health hacks should be taken with a generous pinch of salt, this one may have some basis in science. “This is a hack that’s relatively well known in the migraine community,” neurologist and fellow migraine sufferer Jessica Lowe (@doctorbrainbarbie), explained in a TikTok video with 9.3 million views. “A large coke from Mcdonalds has about 80 milligrams of caffeine in it. That right there is probably enough to stop your migraine in its tracks.” @doctorbrainbarbie McDonald’s Migraine hack explained by a Neurologist. #migraine #migraines #migrainerelief #migrainetiktok #headache #headacherelief #neurology ♬ original sound – Doctor Brain Barbie Caffeine acts as a vasoconstrictor—meaning it narrows blood vessels, which helps counter the dilation that occurs during a migraine. The fries offer both electrolytes and carbohydrates. “Mcdonalds is well known to have some of the saltiest fries around,” Lowe added. Electrolytes can ease migraine symptoms tied to dehydration or low sodium, while carbs may help if the trigger is hunger or a drop in blood sugar. Still, proceed with caution. For some people, caffeine and fast food can trigger migraines rather than relieve them. Dr. Kay Kennis, a trustee for the Migraine Trust and a GP who specializes in migraines, told the BBC that McDonald’s food may also contain high levels of tyramine—a known potential trigger. If you’re struggling with migraines, consult your healthcare provider to explore treatment options. But if you’re craving McDonald’s in the meantime, go for it—you just might get some relief.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-8983537152674611030",
        "title": "The Curious Case Of Booze-Free Beverages",
        "url": "https://www.forbes.com/sites/daveknox/2025/06/03/the-curious-case-of-booze-free-beverages/",
        "site": "forbes.com",
        "time": 1748955600000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ko"
        ],
        "description": "What began as a personal quest by JW Wiseman to drink less has blossomed into a pioneering force in the non-alcoholic beverage industry. What began as a personal quest by JW Wiseman to drink less has blossomed into a pioneering force in the non-alcoholic beverage industry.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-5092045913311311942",
        "title": "How Olipop CEO Ben Goodwin built a brand new kind of soda brand",
        "url": "https://www.fastcompany.com/91342002/how-olipop-ceo-ben-goodwin-built-a-brand-new-kind-of-soda-brand",
        "site": "fastcompany.com",
        "time": 1748512800000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ko"
        ],
        "description": "eOlipop’s surging popularity has taken the $60 billion soda industry by storm. As Gen Z and millennials ditch sugary sodas, Olipop is leading the pre-biotic beverage trend, sparking the likes of Coca Cola and PepsiCo to enter the fray. Olipop co-founder, CEO and formulator, Ben Goodwin, shares how the brand is navigating the turbulence of rapid growth amid rising competition, and whether healthy soda is actually healthy or just a TikTok-fueled fad.This is an abridged transcript of an interview from Rapid Response, hosted by the former editor-in-chief of Fast Company Bob Safian. From the team behind the Masters of Scale podcast, Rapid Response features candid conversations with today’s top business leaders navigating real-time challenges. Subscribe to Rapid Response wherever you get your podcasts to ensure you never miss an episode. So for folks who are less familiar, Olipop’s known as a functional soda. What does that mean? What is a prebiotic soda versus a probiotic soda? Give us the landscape. Soda itself has a really, really interesting, very deep history. It goes back a couple hundred years. There’s Middle East roots, there’s European roots. So in the U.S., obviously full-sugar soda in a myriad of forms existed for many, many decades, especially starting in the late 1800s. It actually wasn’t until 1943 that the federal government stepped in and told Coke and Pepsi and Dr. Pepper that they could no longer call soda “healthy.” That’s how long it was they were saying that it was healthy, even though, by that time, it was loaded with caffeine and sugar. And then in the ’60s and ’70s, and then really peaking in the ’80s, you had diet soda come in, and that was this awareness that, “Hey, all the sugar’s not great for you. Let’s go with these kind of artificial sweeteners.” And it’s been that two-horse race for a really long time. Ben Goodwin [Photo: Olipop] Functional soda, which I am fortunate enough to effectively have been the one that created the category and I’ve been working on it since about 2010, is basically this idea that soda can actually be health-contributing. I was looking at the evolution of the science around digestive and microbiome health and decided that this kind of nutritional intervention was, I thought, actually a superior strategy. The base of our nutritional pillars are fiber, prebiotics, and nutritional diversity. So sometimes when I hear people say, “The prebiotic soda category,” I’m like, “Well, that’s true, but that’s just part of the story,” because a lot of the other competitors that have come into the space are just looking to capitalize for the most part on a trend, but it only is actually technically a part of what we offer. The health benefits, not everyone’s on board about them. There have been some class-action lawsuits, not about your claims, but about claims from others. Is Olipop actually healthy for me, or is it just better for me than traditional soda? I’m actually so grateful that you asked that question. I don’t want to wade into trash-talking territory here, but I do think a lot of the other entrants, they’ve either got a really small amount of total fiber or they’re putting some of that fiber in and it’s not even stable in their product. You really want a blend of different high-quality prebiotics. It’s how you get to the best outcome. That’s at least my formulation philosophy. Olipop is actually healthy. We have done multiple in vitro clinical trials now at Purdue. We’ve a partnership with their stability lab, we’ve a partnership with their complex carbohydrates laboratory, and we’ve looked at microbiome and digestive health outputs. We saw incredible bifidogenesis. We saw the fermentation of multiple forms of short-chain fatty acids. And then we just finished our first pilot human clinical trial, and we were looking at blood sugar stability and blood sugar response. And basically, of the folks that we studied, it kept their blood sugar stable for a full three hours. [Photo: Rob Kim/Getty Images for NYCWFF] So if you start stabilizing people’s blood sugar response, you start benefiting their digestive health microbiome outputs. I don’t know exactly what level of data most people need to classify something as healthy, but I’d say that certainly meets my criteria. My goal is to say, “Health and wellness should be actually contributing to your health and wellness,” and you should have some empirical data to validate that. If you’re going to ask consumers to spend a premium, you want to know that you’re actually giving them real outcomes for what they’re spending. You mentioned how fast your business has been growing, and it’s one of the fastest-growing U.S. beverage brands ever. You recently raised funds that, I don’t know, around a $2 billion valuation, but you do have this intense competition, right? Poppi, which is known for these Super Bowl ads, that was recently acquired by PepsiCo for just under $2 billion. Coca-Cola’s launched Simply Pop. How much does that change the game when the big players step in? I really want to see this category live up to its full potential. You’ve got soda, which is a $60 billion, 98% household penetration market in the United States. If we can do good in that category and use that as a kind of a Trojan horse to drive healthy outcomes for people, it’s really powerful. In terms of big players entering the space, to be honest with you, I think it’s fantastic. Some of the largest brands and the largest players in the soda and beverage space in the world getting into your category goes a long way to massively validate what you’re doing. And so hats off to Poppi. I know that getting out, selling their business was really important to them. Coke as well getting involved. It’s like, to be honest with you, it’s a bit of an honor. One of your investors is Indra Nooyi, the former PepsiCo CEO. I imagine that PepsiCo may have approached you at the same time as they did Poppi. I don’t know. Do you consider tying up with a bigger place? Look, I mean, I can’t really speak to that with a lot of detail. I don’t want to be overly coy in terms of Olipop does need to create a liquidity event, right? The reality is we’ve taken on investor capital, you just pointed to that, that was our final round into the business. We’re very, very fully profitable and really liquid, pun intended, but we have raised investor capital, which means you need to generate a liquidity event. There’s multiple ways that you can go through M&A, there’s obviously IPO going public, and so that is where right now—we’re just preserving optionality. I mentioned Poppi’s Super Bowl ad earlier. They spent, I don’t know, $16 million on a one-minute spot. Oh, more than that, yeah. You didn’t make that investment, and, instead, you teased them for their spending on social media, which they then called online bullying. Is that kind of back-and-forth with them, is that strategic? Is that what customers want from brands? You’re laughing. Yeah, I have no idea. The online bullying thing is really good. It’s really good. First of all, there’s a difference between the stuff that I personally authorize, and sometimes the stuff that the social media team decides that they want to get up to. And that was a moment where, to be honest with you, there was a little bit of a gap. I was actually at a friend’s wedding in Puerto Rico. I was not the one hitting send on the whatever platform it is that we were commenting on. But at the same time, I understand where the consumers were coming from, which is we do live in a time with an enormous amount of income inequality. Whatever it was about how Poppi showed up, that hit a nerve for a lot of people. They made their own voices heard. I don’t need to add to that conversation. Our team did say a couple things, but then they stopped, and that’s good because they probably would’ve been fired if they hadn’t, and we just went on with their lives. But yeah, I think that we don’t spend the same amount of money on marketing that Poppi does. I’m okay with that because a lot of what has driven our business has been organic demand and organic word-of-mouth. That is real, sustainable growth that we’re experiencing, and I’m really proud of that. And as long as you can continue to grow the business like that, you should. I think that we will probably have increase in spend in marketing as we go, but it’s okay for us as brands to have different strategies in terms of how we approach growth.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-6438467818859968682",
        "title": "Interns designed Coca-Cola’s new Sprite + Tea flavor",
        "url": "https://www.fastcompany.com/91339539/interns-designed-coca-colas-new-sprite-tea-flavor",
        "site": "fastcompany.com",
        "time": 1748253600000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ko"
        ],
        "description": "The Coca-Cola Co. just announced its newest limited-time soda, and it’s a combination of Sprite and tea that was initially floated by a team of interns six years ago. Sprite + Tea just hit shelves earlier across the U.S. and Canada, and is expected to remain on the market through October. The soda is available in both regular and zero-sugar varieties, and, according to a press release, it “blends the crisp, lemon-lime refreshment of Sprite with the classically refreshing flavor of tea.” The new product arrives just a month after Coca-Cola announced better-than-anticipated first-quarter 2025 financial results, logging a 2% year-over-year revenue decline but maintaining its growth forecasts for 2025, unlike rival PepsiCo. For years now, Coca-Cola has been experimenting with new, unexpected flavor combinations designed to attract younger consumers, ranging from Spiced Coke to last summer’s Sprite Chill and the ever-popular seasonal rerelease Sprite Winter Spiced Cranberry. Most recently, the company introduced Orange Cream Coke, citing “growing demand among millennials and Gen Z-ers for fun, unexpected tastes and sensory experiences” as the inspiration behind the nostalgic flavor. [Photo: Coca-Cola] Unlike these other flavor plays from the company, Sprite + Tea might already be familiar to many fans. That’s because before it became an official product, the soda started as an idea floated by Coca-Cola interns that later became a viral DIY TikTok trend. TikTok saw it first In an interview with Ad Age, Coca-Cola Co. senior creative director A.P. Chaney explained that Sprite + Tea first landed on executives’ radars back in 2019, when a group of interns pitched a combination of the two beverages. “It was an R&D project, and interns were asked to come up with different innovations and marketing ideas for different brands, and Sprite + Tea was an ideation of that,” Chaney told Ad Age. From there, the idea seems to have sat on the back burner until summer 2023, when a DIY Sprite tea started popping up on TikTok. In an initial TikTok by Malaysian chef Hisham Raus, Raus is shown steeping Lipton tea bags in a regular bottle of Sprite and enjoying the concoction with a slice of lemon. The video, which has since racked up 19.8 million views and 1.3 million likes, has spawned dozens of copycat videos across platforms like YouTube Shorts and Instagram Reels. Food influencer @shophocho7798 re-created the concept in a YouTube video with 3.7 million views, calling the result “literally a carbonated Arnold Palmer.” In another YouTube short with 8.3 million views, creator Jordan Howlett declared the hack “delicious” and encouraged his 4.4 million subscribers to give it a try. “When [the trend] blew up on TikTok with millions of views, it was a gut check that we were on the right track,” Chaney said in the company’s press release. While it’s unlikely that Coca-Cola is actually using the tea bag hack to mass-produce Sprite + Tea, the release does note that Coca-Cola’s North American R&D team “completed several rounds of consumer testing to fine-tune the formula for the amber-colored sparkling beverage.” For Coca-Cola, Sprite seems to be a reliable base for flavor remixes: In 2024, the limited-time Sprite Chill became the company’s best-selling drink innovation, and Sprite Winter Spiced Cranberry has returned several times as a holiday fan favorite since 2013. Meanwhile, the recent Spiced Coke experiment was phased out after just six months when it failed to land with customers. TikTok is already flooded with videos of fans trying Sprite + Tea, with some reviews commending the drink’s “strong tea flavor,” while others recommend that viewers stick with the DIY version.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-6283727904790107946",
        "title": "Racer Kyle Larson Crashes at Coca-Cola 600 and Indy 500",
        "url": "https://www.bloomberg.com/en/news/thp/2025-05-25/urgent-kyle-larson-crashes-out-of-indy-500-near-the-midway-point-ending-his-second-bid-for-the-double",
        "site": "bloomberg.com",
        "time": 1748201299000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "CONCORD, N.C. (AP) — Kyle Larson’s day went from bad to worse Sunday night at the Charlotte Motor Speedway, leaving the talented young driver unsure if he will attempt to run “The Double” again. CONCORD, NORTH CAROLINA - MAY 25: Kyle Larson, driver of the #5 HendrickCars.com Hendrick 1100 Chevrolet, greets fans as he walks the grid prior to the NASCAR Cup Series Coca-Cola 600 at Charlotte Motor Speedway on May 25, 2025 in Concord, North Carolina. (Photo by Jared C. Tilton/Getty Images)",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-7849665489584555493",
        "title": "Ryan Blaney On Aiming To Win NASCAR’S Coca-Cola 600 This Weekend: ‘I’m Inching For Another One’",
        "url": "https://www.forbes.com/sites/djsiddiqi/2025/05/21/ryan-blaney-on-aiming-to-win-nascars-coca-cola-600-this-weekend-im-inching-for-another-one/",
        "site": "forbes.com",
        "time": 1747849642000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "-6283727904790107946"
        ],
        "description": "Ryan Blaney details the key to winning another NASCAR Cup Series and how he's aiming to win the Coca-Cola 600 — again — this weekend in this one-on-one interview. Ryan Blaney details the key to winning another NASCAR Cup Series and how he's aiming to win the Coca-Cola 600 — again — this weekend in this one-on-one interview.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "4875046622463241309",
        "title": "Coca-Cola grants vote of confidence to WPP with Open X renewal",
        "url": "https://digiday.com/marketing/coca-cola-grants-vote-of-confidence-to-wpp-with-open-x-renewal/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
        "site": "digiday.com",
        "time": 1747843260000,
        "favicon_url": "https://static.tickertick.com/website_icons/digiday.com.ico",
        "tags": [
            "ko"
        ],
        "description": "WPP's retained its account, which covers global creative, and media outside North America, with the beverage giant. WPP has retained its account with Coca-Cola, one its largest clients, according to the global beverage giant’s chief marketing officer Manuel Arroyo. Writing on LinkedIn, the CMO said Coca-Cola had renewed its partnership with WPP and credited it with delivering “significant value” to the firm, which is one of the world’s largest advertisers. “I’m happy to share that The Coca-Cola Company has renewed its partnership with WPP Open X as its global marketing partner,” he wrote. “We are living a special moment in marketing at The Coca-Cola Company, and I’m glad to have WPP Open X on our team to help us create the future of marketing.”Continue reading this article on digiday.com. Sign up for Digiday newsletters to get the latest on media, marketing and the future of TV.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-8724540703296064644",
        "title": "Coca-Cola and Philip Morris headline the top consumer staples picks list at Morgan Stanley",
        "url": "https://seekingalpha.com/news/4450475-coca-cola-and-philip-morris-headline-the-top-consumer-staples-picks-list-at-morgan-stanley",
        "site": "seekingalpha.com",
        "time": 1747756536000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-1256240823207772061",
        "title": "Femsa Exits Heineken After 15 Years With €359 Million Sale",
        "url": "https://www.bloomberg.com/news/articles/2025-05-20/femsa-exits-heineken-after-15-years-with-359-million-sale",
        "site": "bloomberg.com",
        "time": 1747726061000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Fomento Economico Mexicano SAB, a Mexican Coca-Cola bottler and convenience store operator, sold its remaining stake in Heineken Holding NV as it focuses on its core business. Cans of Heineken beer.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-3272576994046371104",
        "title": "8x8 outlines path to high single-digit revenue growth by fiscal 2028 as Fuze transition nears completion",
        "url": "https://seekingalpha.com/news/4450301-8x8-outlines-path-to-high-single-digit-revenue-growth-by-fiscal-2028-as-fuze-transition-nears",
        "site": "seekingalpha.com",
        "time": 1747706333000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "803712597259666759",
        "title": "American brands have a new image problem",
        "url": "https://www.economist.com/business/2025/05/19/american-brands-have-a-new-image-problem",
        "site": "economist.com",
        "time": 1747675211000,
        "favicon_url": "https://static.tickertick.com/website_icons/economist.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Donald Trump is hurting products from Coca-Cola to Jack Daniel’s",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "5823046820445138479",
        "title": "American companies have a new image problem",
        "url": "https://www.economist.com/business/2025/05/19/american-companies-have-a-new-image-problem",
        "site": "economist.com",
        "time": 1747675211000,
        "favicon_url": "https://static.tickertick.com/website_icons/economist.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "803712597259666759"
        ],
        "description": "Donald Trump is hurting brands from Coca-Cola to Jack Daniel’s",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-7843414766119651345",
        "title": "Meet Project Fizzion, Coca-Cola’s big bet on an AI-powered design copilot",
        "url": "https://www.fastcompany.com/91334830/project-fizzion-coca-cola-ai-copilot-adobe",
        "site": "fastcompany.com",
        "time": 1747303200000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "9182118576999908964",
            "-1839321795892020992",
            "6720231541792601336",
            "8336682026149319404",
            "-6438467818859968682",
            "4875046622463241309",
            "-8724540703296064644",
            "5879824525713945157"
        ],
        "description": "Back in the 1930s, Robert W. Woodruff, president of the Coca-Cola Co., would carry a red swatch in his wallet. Of course, it wasn’t just any red. It was Coca-Cola red. And so anywhere he went and encountered his brand—painted on a wall, wrapping a refrigerator—he would pull out the little swatch to check that it matched.Woodruff understood the importance of Coca-Cola’s brand equity as it expanded globally—a challenge that has only grown since, now that Coca-Cola sells 2.2 billion servings a day across 200 countries, 150 languages, and 30 million points of sale.But where Woodruff used a swatch, Coca-Cola’s design team has spent the past four years dreaming up a modern operational upgrade to its 400 pages of brand guidelines. Teaming with Adobe, it developed Project Fizzion. Trained specifically on Coca-Cola’s design logic, it’s a brand-managing AI that lives inside Adobe platforms like Photoshop and Illustrator, generates designs, and, most of all, helps keep designers across the globe brand-compliant as they dream up the next big campaign.In a design world that’s equally dependent upon and terrified of generative AI tools, Coca-Cola is clear that Fizzion is not about cost cutting via AI. As it’s integrating Fizzion globally, it’s doing so with no reduction in spending on brand campaigns. Instead, the company believes it’s charting a path forward that’s sustainable for creatives to drive better work and eliminate headaches under deadline.“Fizzion was never a design automation tool,” says Rapha Abreu, global VP of design at Coca-Cola. “It’s a creative copilot that is powered by AI but guided by designers.”Dreaming up a new AIWhen Abreu joined Coca-Cola in 2021, his design team—who spent countless hours in meetings explaining to external agencies that their seemingly great ideas broke brand guidelines—became almost philosophical in imagining another way forward. Given that any Coca-Cola campaign can include up to 5,000 separate assets, it had become nearly impossible to manage.“We had this kind of crazy idea,” Abreu recalls. “What if the Coca-Cola logo could learn what to do and what not to do?” They imagined software built so a designer literally couldn’t place the logo in the wrong context. And if that could work for the logo, maybe the same thing could be true for colors, typography, and imagery associated with Coca-Cola campaigns. It was an enticing thought that was ahead of its time, but only a little. Within two years, ChatGPT and other GenAI tools would drop upon the world to automate all sorts of tasks that never before seemed possible. [Image: Adobe/Coca-Cola]Companies including Adobe and Canva quickly whipped up GenAI tools that could suck in brand guidelines via PDF, then apply them to design templates. Sometimes they worked. And sometimes they didn’t. These sorts of guidelines can have trouble scaling to new, complex projects, and of course they do. Guidelines are just words trying to articulate visual relationships that are sometimes as instinctual as they are codified. Coca-Cola’s idea, led largely by its global head of AI design, Dom Heinrich, was to start with the images themselves, and to train a machine on Coca-Cola’s visual sensibility rather than a written rule set. Given that Coca-Cola and its partners were already working inside Adobe products, partnering with the company on building out such an AI system made a lot of sense.“It happens inside the tools that creatives already use,” says Abreu. “For us, that was the most important thing.”Together, the Adobe and Coca-Cola teams developed a different approach to training AI and deploying it at scale, which they call Project Fizzion (what seems like a most certain nod to Coca-Cola’s carbonated roots).[Image: Adobe/Coca-Cola]How does Fizzion learn?Many AIs are already trained on images, but Fizzion takes a slightly different approach. It’s trained more on visual design systems, stuffed full of actual Coca-Cola assets. This means Fizzion isn’t analyzing a century of soda campaigns in order to hallucinate a polar bear dressed as Santa Claus sharing a Coke. It’s specifically not generating imagery like Adobe’s own Firefly or DALL-E, but it will create a new variation on an existing design, mixing and matching Coca-Cola assets to do so.[Image: Adobe/Coca-Cola]Fizzion lives like Microsoft Copilot right inside Adobe software, considering the interdependencies of things on the screen.[Image: Adobe/Coca-Cola]“When you’re designing a visual identity system, the model should be able to learn, not just from the images but from the relationships between all the components, how the text maps to the images’ other elements that need to be part of it,” says Ash King, senior director of Firefly enterprise solutions at Adobe. “That allows [the designer] to test various aspect ratios, free-form.”Fizzion can see the canvas a designer is working on in real time, complete with the positioning of logos, imagery, and typefaces. The AI learns from Coca-Cola’s own designers only when a project is finalized. Once a designer has a product they like—and knows works with brand standards—they save it as what they call a Style ID that adds to the AI’s knowledge. That’s basically the visual logic of one Cola-Cola campaign. At this time Fizzion also collects all necessary brand assets for that campaign so that it can incorporate them perfectly whenever necessary. (In other words, Fizzion is pulling the Coca-Cola logo fresh every time, rather than dreaming up what it’s supposed to look like from old references.)[Image: Adobe/Coca-Cola]This is how Fizzion is trained to learn new styles. (It also incorporates background from Coca-Cola’s 400-page brand guidelines, via Adobe Firefly.) From there, Fizzion sits atop a global production pipeline that allows partners to tweak the visual formula without breaking it.[Image: Adobe/Coca-Cola]How teams across Coca-Cola use FizzionBuilding a marketing campaign in Fizzion can start with a prompt to generate—something like “Coca-Cola polar bears on the ocean”—or with a blank canvas as Fizzion watches along.At the very top of the stack, the Coca-Cola design team has full access to build or alter anything across the brand that it wants. Partner agencies that Coke hires to make ads have more limitations. They can generate a new aspect ratio for a campaign on demand, and the AI will piece it all together. But if they want to stretch the logo—real bad—Fizzion won’t let them. However, they can send that change as a request to Coca-Cola proper through the platform to get approval (saving a meeting). [Image: Adobe/Coca-Cola]As design teams go down the chain from America to local markets, more and more of the design process becomes about localization. These teams have the least amount of access to tweak a campaign—certain assets and layers may be locked—though they can still make requests up the chain. This might sound controlling (and of course to an extent Coca-Cola is very much controlling its brand). But the design team argues that having these brand guidelines integrated into design tools is ultimately more freeing for design partners.[Image: Adobe/Coca-Cola]“One thing that we speak a lot internally about this global system is that we need to help designers and creatives downstream do the right thing, right. So it cannot be a burden for them to try to be compliant with the brand,” Abreu says. “We need to make this as easy as possible.”However, with kerning off the table, Coca-Cola argues that it leaves time for creatives to focus on everything else about a campaign: “storytelling, having ideas, making sure cultural nuance is applied, and [focusing on] emotional resonance,” Abreu says. [Image: Adobe/Coca-Cola]Indeed, despite all of the checks and balances in the system, Coca-Cola’s designers are hoping that their creative partners continue to push back. In fact, they are depending on it, as that’s the only way they believe a brand can grow and evolve. “If everybody builds on the same LLM, it just follows the same kind of way of interacting with an AI. We will just get a lot of the same,” says Heinrich. “We believe that designers need to be more in charge. . . . [They need to] be more creative in order to push the AI to the next level. The better you are at your job and the better you push, the better the outputs are and the more uniqueness comes from them.”[Image: Adobe/Coca-Cola]For now, Coca-Cola is all-in with Fizzion. Since March of this year, every partner agency that’s building a campaign is required to create it with a Fizzion Style ID. And the Coca-Cola team believes Fizzion is so efficient at handling design standards that its 400-page PDF guidelines will fall out of use. As for Adobe, it’s built a powerful design tool that, no doubt, many companies using its platform would benefit from. However, it’s also been designed to meet the gargantuan needs of Coca-Cola, meaning it’s probably too big and multitiered for many teams to adopt efficiently.“Few companies are thinking on the scale as Coke is right now. So we need to take a future-forward look at this and figure out how it’s best applied,” says King. “We like to start with the use cases. We like to have something very concrete that a customer wants to do and then build backwards into what we’re [shipping].”",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "4077093777132016276",
        "title": "Is CELH Stock Still A Buy After Its 30% Rally?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/05/09/is-celh-stock-still-a-buy-after-its-30-rally/",
        "site": "forbes.com",
        "time": 1746784822000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Profitability: Celsius’s operating cash flow margins surpass 19% , compared to 14% for Coca-Cola, indicating a larger portion of their revenue growth is converted into... Profitability: Celsius’s operating cash flow margins surpass 19% , compared to 14% for Coca-Cola, indicating a larger portion of their revenue growth is converted into...",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "8015019075550647460",
        "title": "Quotes from the quarter: What CEOs and CFOs are saying about the state of ad spend",
        "url": "https://www.modernretail.co/marketing/quotes-from-the-quarter-what-ceos-and-cfos-are-saying-about-the-state-of-ad-spend/?utm_campaign=modernretaildis&utm_medium=rss&utm_source=general-rss",
        "site": "modernretail.co",
        "time": 1746676800000,
        "favicon_url": "https://static.tickertick.com/website_icons/modernretail.co.ico",
        "tags": [
            "ko"
        ],
        "description": "Nothing makes a CMO freeze faster than not knowing what’s possibly around the corner. Here's what executives from Publicis Groupe, Procter & Gamble, Coca-Cola and more had to say about the state of ad spend during recent earnings calls. This story was originally published on Modern Retail’s sister publication, Digiday. The longer this earnings season drags on, the clearer it becomes: the ad slowdown might be steeper than anyone first thought. It’s not the tariffs themselves spooking advertisers – its the fog of uncertainty they create. And nothing makes a CMO freeze faster than not knowing what’s possibly around the corner. Publicis Groupe CEO Arthur Sadoun nailed it early in the cycle, telling analysts: “Until there is more clarity, this is not going to get better.”Continue reading this article on modernretail.co. Sign up for Modern Retail newsletters to get the latest on the shifting dynamics between retail’s old and new guards.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "3125624459902821551",
        "title": "Hispanic shoppers are spending less on groceries, putting pressure on consumer companies",
        "url": "https://www.cnbc.com/2025/05/06/hispanic-shoppers-groceries-coca-cola-modelo-corona-mazola.html",
        "site": "cnbc.com",
        "time": 1746529201000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Coca-Cola, Constellation Brands and Colgate-Palmolive reported that Hispanic consumers are spending less, which weighed on their North American sales.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-5642670498596478511",
        "title": "How Ambani's Campa Cola is Hurting Coke, Pepsi in India",
        "url": "https://www.bloomberg.com/news/videos/2025-05-06/how-ambani-s-campa-cola-is-hurting-coke-pepsi-in-india-video",
        "site": "bloomberg.com",
        "time": 1746509606000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Asia's richest man, Mukesh Ambani, is challenging Coca-Cola and PepsiCo's dominance in India with Reliance Industries' Campa Cola brand. Bloomberg's Satviki Sanjay appeared on Insight with Haslinda Amin to discuss what's behind the growing success of the brand. (Source: Bloomberg) PepsiCo Inc Photographer: SeongJoon Cho/Bloomberg",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "4827632788432487638",
        "title": "Ambani’s 12-Cent Cola Is Eroding Coke, Pepsi Dominance in India",
        "url": "https://www.bloomberg.com/news/articles/2025-05-06/mukesh-ambani-takes-on-coke-pepsi-with-reliance-s-cheaper-campa-cola-in-india",
        "site": "bloomberg.com",
        "time": 1746489600000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "-5642670498596478511"
        ],
        "description": "Asia’s richest man is challenging the decades-long dominance of Coca-Cola Co. and PepsiCo Inc. in the most-populous country using a playbook he has practiced to perfection in other sectors: price disruption. Pilgrims walk past advertisements for Reliance Industries Ltd.’s Campa brand during Maha Kumbh Mela 2025 in Prayagraj, India, on Feb. 2, 2025.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-6549497619966215511",
        "title": "Coca-Cola features prominently at the Berkshire Hathaway meeting once again",
        "url": "https://seekingalpha.com/news/4440876-coca-cola-features-prominently-at-the-berkshire-hathaway-meeting-once-again",
        "site": "seekingalpha.com",
        "time": 1746443875000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "741775001286418499",
        "title": "Dividend Roundup: Apple, Coca-Cola, Exxon Mobil, Citigroup, and more",
        "url": "https://seekingalpha.com/news/4440135-dividend-roundup-apple-coca-cola-exxon-mobil-citigroup-and-more",
        "site": "seekingalpha.com",
        "time": 1746190173000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "6795888828945723468",
        "title": "Coca-Cola declares $0.51 dividend",
        "url": "https://seekingalpha.com/news/4439364-coca-cola-declares-0_51-dividend",
        "site": "seekingalpha.com",
        "time": 1746122788000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-8594367074023959416",
        "title": "2 big companies aren't rushing to return to Russia",
        "url": "https://www.businessinsider.com/mcdonalds-coca-cola-return-russia-market-ukraine-2025-4",
        "site": "businessinsider.com",
        "time": 1745992506000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Both McDonald's and Coca-Cola have pushed back on talk of returning to the Russian market.ALEXANDER NEMENOV/AFP via Getty ImagesMcDonald's and Coca-Cola have pushed back on talk of returning to the Russian market.Their responses follow speculation in Russian media that they were preparing a return to the country.Russian officials said the country is prioritizing domestic companies over returning Western firms.Two of the biggest brands to exit Russia after its invasion of Ukraine do not appear ready to stage a comeback.President Donald Trump has indicated that the US could reconcile with Russia, which could allow Western companies to reenter the market. That's spurred speculation in Russian media about which companies could come back and under what circumstances.In March, the Ukrainian advocacy group B4UKraine Coalition contacted several Western countries, including Coca-Cola and McDonald's. In correspondence with the group, executives from both companies indicated they plan to stay out of Russia.In the group's letter to McDonald's, B4Ukraine Coalition highlighted comments in local media from political analyst Vadim Siprov, who said in mid-February that McDonald's could return by year's end.McDonald's is sticking to the principles that guided its decision to exit Russia in 2022, the company said in its March response. The organization posted McDonald's letter online.In 2022, McDonald's evaluated five questions: whether it's legal to operate in the country, whether it has the freedom to run its business, whether its presence is helpful to its brand, whether staying aligns with its values, and whether it makes good business sense.\"The principles behind these questions, which guided our decision to 'de-Arch' a major market and sell our portfolio of McDonald's restaurants, still apply today,\" wrote Jon Banner, the fast food giant's global chief impact officer.In 2022, \"the answer to each of those questions was no,\" Banner wrote.Meanwhile, Coca-Cola said in a late March email reply to the Ukrainian group that \"sanction regimes and other legal hurdles\" stand in the way of any return to the Russian market.McDonald's and Coca-Cola did not respond to requests for comment from Business Insider.'A price to pay for past decisions'Russia said in February that it is not in a hurry to receive Western companies that had left the country over its war in Ukraine.\"We are not waiting for anyone with open arms. There will be a price to pay for past decisions,\" Anton Alikhanov, the Russian industry and trade minister, told reporters in February, according to the state news agency TASS.Three years into the war in Ukraine, nearly 475 foreign companies have left the Russian market completely, per the Leave Russia database from the Kyiv School of Economics. Those that have made a complete exit include McDonald's, Starbucks, Ikea, the British energy giant Shell, and the Japanese tire maker Bridgestone.Alikhanov also said Russia was prioritizing domestic brands instead of waiting for foreign brands to return.Analysts have said that businesses are likely to be cautious about returning to the country even if sanctions are lifted.Russia's wartime economy is facing multiple issues, including high inflation, currency volatility, and sky-high interest rates. Putin's ironclad reign also presents concerns about the rule of law and safety.Read the original article on Business Insider Both McDonald's and Coca-Cola have pushed back on talk of returning to the Russian market.ALEXANDER NEMENOV/AFP via Getty ImagesMcDonald's and Coca-Cola have pushed back on talk of returning to the Russian market.Their responses follow speculation in Russian media that they were preparing a return to the country.Russian officials said the country is prioritizing domestic companies over returning Western firms.Two of the biggest brands to exit Russia after its invasion of Ukraine do not appear ready to stage a comeback.President Donald Trump has indicated that the US could reconcile with Russia, which could allow Western companies to reenter the market. That's spurred speculation in Russian media about which companies could come back and under what circumstances.In March, the Ukrainian advocacy group B4UKraine Coalition contacted several Western countries, including Coca-Cola and McDonald's. In correspondence with the group, executives from both companies indicated they plan to stay out of Russia.In the group's letter to McDonald's, B4Ukraine Coalition highlighted comments in local media from political analyst Vadim Siprov, who said in mid-February that McDonald's could return by year's end.McDonald's is sticking to the principles that guided its decision to exit Russia in 2022, the company said in its March response. The organization posted McDonald's letter online.In 2022, McDonald's evaluated five questions: whether it's legal to operate in the country, whether it has the freedom to run its business, whether its presence is helpful to its brand, whether staying aligns with its values, and whether it makes good business sense.\"The principles behind these questions, which guided our decision to 'de-Arch' a major market and sell our portfolio of McDonald's restaurants, still apply today,\" wrote Jon Banner, the fast food giant's global chief impact officer.In 2022, \"the answer to each of those questions was no,\" Banner wrote.Meanwhile, Coca-Cola said in a late March email reply to the Ukrainian group that \"sanction regimes and other legal hurdles\" stand in the way of any return to the Russian market.McDonald's and Coca-Cola did not respond to requests for comment from Business Insider.'A price to pay for past decisions'Russia said in February that it is not in a hurry to receive Western companies that had left the country over its war in Ukraine.\"We are not waiting for anyone with open arms. There will be a price to pay for past decisions,\" Anton Alikhanov, the Russian industry and trade minister, told reporters in February, according to the state news agency TASS.Three years into the war in Ukraine, nearly 475 foreign companies have left the Russian market completely, per the Leave Russia database from the Kyiv School of Economics. Those that have made a complete exit include McDonald's, Starbucks, Ikea, the British energy giant Shell, and the Japanese tire maker Bridgestone.Alikhanov also said Russia was prioritizing domestic brands instead of waiting for foreign brands to return.Analysts have said that businesses are likely to be cautious about returning to the country even if sanctions are lifted.Russia's wartime economy is facing multiple issues, including high inflation, currency volatility, and sky-high interest rates. Putin's ironclad reign also presents concerns about the rule of law and safety.Read the original article on Business Insider",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "7815549362410911687",
        "title": "McDonald’s, Coca-Cola Still See Risks to Operating in Russia",
        "url": "https://www.bloomberg.com/news/articles/2025-04-29/mcdonald-s-coca-cola-still-see-risks-to-operating-in-russia",
        "site": "bloomberg.com",
        "time": 1745961479000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "McDonald’s Corp. and Coca-Cola Co. said they continue to see risks to operating in Russia, a signal that major US firms remain cautious about business investments in the country. Boxes of Coca-Cola cans inside an Utkonos fulfillment center in Moscow, on Monday, Dec. 27, 2021. Billionaire Alexey Mordashov’s Lenta IPJSC retailer will buy his online grocery platform Utkonos, as consolidation continues in Russia’s supermarket sector amid rapid growth in the online food delivery segment.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-7978298544656378155",
        "title": "Coca-Cola Ties Political Tension to Hispanic Consumer Pullback",
        "url": "https://www.bloomberg.com/news/articles/2025-04-29/coca-cola-ties-political-tension-to-hispanic-consumer-pullback",
        "site": "bloomberg.com",
        "time": 1745946683000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Coca-Cola Co. said that geopolitical tensions caused by US immigration and trade policies are partially to blame for Hispanic consumers spending less on the soda company’s beverages. Coca-Cola soft drinks for sale in a store in Crockett, California, US, on Friday, April 25, 2025. Coca-Cola Co. is scheduled to release earnings figures on April 29. Photographer David Paul Morris/Bloomberg Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-8232108518055254048",
        "title": "Coca-cola anticipates 5%-6% organic revenue growth for 2025 with expanded global strategies",
        "url": "https://seekingalpha.com/news/4437069-coca-cola-anticipates-5-percentminus-6-percent-organic-revenue-growth-for-2025-with-expanded",
        "site": "seekingalpha.com",
        "time": 1745941531000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "5879824525713945157",
        "title": "Coca-Cola hold its gain after analysts say the stock is a consumer staples standout",
        "url": "https://seekingalpha.com/news/4436951-coca-cola-hold-its-gain-after-analysts-say-the-stock-is-a-consumer-staples-standout",
        "site": "seekingalpha.com",
        "time": 1745936233000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-7358645009163720360",
        "title": "Danes boycotting Coca-Cola, says Carlsberg",
        "url": "https://www.ft.com/content/50e6ec67-54be-4050-ab92-f97415f2777b",
        "site": "ft.com",
        "time": 1745933929000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Local brand soars 13-fold in March as US fizzy drink is rejected in protest against US foreign policy",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "8307678418617489878",
        "title": "4 stocks to watch on Tuesday: KO, PFE, GM and UPS | $GM $KO $UPS $PFE $AMZN",
        "url": "https://seekingalpha.com/news/4436864-4-stocks-to-watch-on-tuesday-ko-pfe-gm-and-ups",
        "site": "seekingalpha.com",
        "time": 1745932869000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "4073765520222783082",
        "title": "Warren Buffett first bought Coca-Cola stock in 1988—how much a $1,000 investment made then would be worth today",
        "url": "https://www.cnbc.com/2025/04/29/how-much-coca-cola-stock-is-worth.html",
        "site": "cnbc.com",
        "time": 1745932770000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Coca-Cola's stock has had a total return of 3,534% since Warren Buffett first invested in 1988.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "4902876042744444127",
        "title": "Coca-Cola in Charts: Q1 unit case volume rose 2% while revenue slipped 2% Y/Y amid mixed regional performance",
        "url": "https://seekingalpha.com/news/4436826-coca-cola-in-charts-q1-unit-case-volume-rose-2-while-revenue-slipped-2-yy-amid-mixed-regional-performance",
        "site": "seekingalpha.com",
        "time": 1745928368000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "728394470594835252",
        "title": "Coca-Cola leaves profit outlook intact, says tariffs are ‘manageable’",
        "url": "https://www.marketwatch.com/story/coca-cola-leaves-profit-outlook-intact-says-tariffs-are-manageable-a0ee93a8?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1745927400000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "3971808602760779981"
        ],
        "description": "Stock gains as quarterly profit beats expectations, while revenue slipped as growth in case volume and price was offset by negative currency moves.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "2594017340655560812",
        "title": "Coca-Cola gains after reporting higher organic sales marks than PepsiCo and Keurig Dr Pepper",
        "url": "https://seekingalpha.com/news/4436792-coca-cola-gains-after-reporting-higher-organic-sales-marks-than-pepsico-and-keurig-dr-pepper",
        "site": "seekingalpha.com",
        "time": 1745925891000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-1676485781965580211",
        "title": "Coca-Cola Profit Beats Estimates on Smaller Price Hikes",
        "url": "https://www.bloomberg.com/news/articles/2025-04-29/coca-cola-profit-beats-estimates-on-smaller-price-hikes",
        "site": "bloomberg.com",
        "time": 1745924964000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Coca-Cola Co. posted quarterly profit that beat Wall Street expectations as price-conscious consumers continued to purchase the company’s beverages despite worsening sentiment. Coca-Cola soft drinks including Fanta, Sprite, and Diet Coke. Photographer David Paul Morris/Bloomberg Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "6431414419777009144",
        "title": "Coca-Cola Non-GAAP EPS of $0.73 beats by $0.01",
        "url": "https://seekingalpha.com/news/4436747-coca-cola-non-gaap-eps-of-0_73-beats-by-0_01",
        "site": "seekingalpha.com",
        "time": 1745924218000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "8184221596299490549",
        "title": "Coca-Cola Europacific Partners declares €0.79 dividend",
        "url": "https://seekingalpha.com/news/4436702-coca-cola-europacific-partners-declares-079-dividend",
        "site": "seekingalpha.com",
        "time": 1745919059000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "6423467891135223636",
        "title": "Coca-Cola Company Q1 Preview: What to expect",
        "url": "https://seekingalpha.com/news/4436431-coca-cola-company-q1-preview-what-to-expect",
        "site": "seekingalpha.com",
        "time": 1745864696000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-8561894807120392902",
        "title": "Healthy Sodas Like Poppi, Olipop Are Drawing PepsiCo’s and Coca-Cola’s Attention",
        "url": "https://www.bloomberg.com/news/articles/2025-04-25/healthy-sodas-like-poppi-olipop-are-drawing-pepsi-and-coca-cola-s-attention",
        "site": "bloomberg.com",
        "time": 1745575241000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "-8232108518055254048",
            "2594017340655560812"
        ],
        "description": "Big-money deals, new players and promises of healthy guts are building a new generation of soda drinkers.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-5055919179003419893",
        "title": "UBS says these 5 consumer-staple stocks are built to weather the uncertain economic storm right now",
        "url": "https://www.businessinsider.com/consumer-staple-stock-picks-to-buy-trump-tariffs-equity-market-2025-4",
        "site": "businessinsider.com",
        "time": 1744988512000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Consumer staples have dominated the stock market this year, and UBS expects continued strong performance from a specific handful. Coca-Cola is one of UBS's top picks in the consumer staples sector.Firdous Nazir/NurPhoto via Getty ImagesConsumer-staple stocks have been a beacon of strength this year as the market has faltered.Still, UBS says it's not immune to a tariff-driven deterioration of the macro landscape.The firm pointed to five stocks it says are well-positioned to weather an economic storm right now.Trump's tariffs have tripped up the stock market — but there are a handful of names in the consumer-staples sector well-positioned to ride out a period of trade war uncertainty, according to UBS.The sector as a whole has fared well in 2025, making it the best performer in the S&P 500 and one of just two groups to post and increase at all. As Trump's tariffs have roiled the discretionary sector, staples have lived up to their billing as a defensive haven.But even staples won't be immune from trade-war pressures, which has UBS seeking single-stock opportunities within the group.The firm highlighted five names in particular that are poised to weather the near-term storm:Coca-Cola Co. (KO)Coca-ColaFirdous Nazir/NurPhoto via Getty ImagesRating: BuyLast closing price: $73.00 (+18% YTD)UBS analysts say: \"Although investors have become somewhat concerned on the fundamental trajectory given slightly weaker US tracked trends performance as well as unfavorable commentary from others on certain key international markets, our discussions with investors would suggest that KO is still well liked.\"Keurig Dr. Pepper Inc. (KDP)Smith Collection/Gado/Getty ImagesRating: BuyLast closing price: $35.40 (+11% YTD)UBS analysts say: \"KDP remains one of the few where there appears to be little risk to bottom line estimates for now … we think the risk/reward skews to the upside.\"Celsius Holdings Inc. (CELH)Beth HeynRating: BuyLast closing price: $37.24 (+37% YTD)What analysts have to say: \"Our conversations with investors would suggest sentiment has improved considerably and that CELH has become one of the more well liked names in our coverage universe.\"Monster Beverage Corp. (MNST)Mike Kemp/In Pictures via Getty ImagesRating: NeutralLast closing price: $58.41 +(12% YTD)What analysts have to say: \"We suspect MNST may be viewed as one of the few stocks that remains ownable this earnings season … we think the risk/reward is balanced looking out longer term.\"Church & Dwight Co. Inc. (CHD)Arm and Hammer and brushGili Malinsky/INSIDERRating: NeutralLast closing price: $105.37 (+1% YTD)What analysts have to say: \"Our conversations suggest that sentiment on CHD has shifted more constructive in recent weeks, despite unfavorable valuation, as many view the company as a potential beneficiary in a trade-down scenario if the consumer remains under pressure.\"Read the original article on Business Insider",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-4623878192086143854",
        "title": "Coca-Cola’s clever new ad uses its logo in a refreshingly old-school way",
        "url": "https://www.fastcompany.com/91316441/coca-cola-clever-new-logo-in-books?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1744709400000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ko"
        ],
        "description": "A new ad from the Coca-Cola Co. opens with a shot of a typewriter clacking out Stephen King’s The Shining. The viewer follows a passage being written in an old-timey typeface until there’s a reference to a bottle of Coke. Suddenly, the type appears as the cola company’s script logo. The ad is part of a new campaign called “Classic” running in Spain and the U.K., in which Coca-Cola highlights instances when its brand name appears in literature by rendering them in the books’ original first-edition typefaces. The passages are printed in black, and references to either “Coke” or “Coca-Cola” in passages from King’s The Shining, J. G. Ballard’s Extreme Metaphors, and V. S. Naipaul’s A House for Mr. Biswas are rendered in logo format. Coke’s red logo pops against the white paper amid the black retro type. [Photo: Courtesy of VML] The approach emphasizes Coke’s legacy and plays on nostalgia in an analog medium and in an analog way. While so much of soda marketing is contemporary and youth-oriented, Coke is doing the opposite. It found a clever way to remind viewers that it’s been part of culture long before e-readers and cellphones by going back to print. It’s anti-trend and purposefully old-school, using the brand’s history and resonance in culture as social proof of its legacy. The campaign will appear on outdoor billboards and signage, streaming radio, online video, print, and cinema. Out-of-home posters show passages printed on paper, complete with page numbers and the books’ author and title. [Photo: Courtesy of VML] The challenge for the creatives behind “Classic” was how to reinforce “the timelessness and authenticity of Coca-Cola in a world where trends reign,” says VML, the marketing agency that worked with Coke’s agency, WPP Open X, to create the campaign. “Coca-Cola has always been more than a beverage—it’s a cultural icon that naturally finds its way into the stories we love,” Rafael Pitanguy, VML’s deputy global chief creative officer, said in a statement. “With ‘Classic,’ we’re honoring that legacy by bringing its literary presence to life in a way that feels both nostalgic and fresh.” Coca-Cola has played with its vintage-style script logo in new and surprising ways recently, like in a 2024 campaign from VML and WPP Open X that used authentic but unauthorized hand-drawn examples of the logo. And to promote recycling last year, Coca-Cola’s campaign with Ogilvy New York used smashed versions of the logo as they appear on crushed cans. With “Classic,” Coca-Cola isn’t so much finding experimental or clever ways to break from its brand guide like in some of last year’s creative. Instead, it’s finding a novel way to impose its brand guide onto culture, showing how Coke is embedded into literary history itself.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "5688138869280478337",
        "title": "Publicis Keeps Outlook as Client Wins Offset Economic Turmoil",
        "url": "https://www.bloomberg.com/news/articles/2025-04-15/publicis-keeps-outlook-as-client-wins-offset-economic-turmoil",
        "site": "bloomberg.com",
        "time": 1744695000000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Publicis Groupe SA, the French advertising company, is sticking to its revenue forecast for 2025 despite global economic uncertainty, buoyed by a strong start to the year with big client wins such as Coca-Cola Co. and Banco Santander SA.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-6149083400779813854",
        "title": "Is Coca-Cola Stock About To Pop?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/14/is-coca-cola-stock-about-to-pop/",
        "site": "forbes.com",
        "time": 1744629337000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Coca-Cola stock (NYSE: KO) has recently reversed its short-term downtrend, suggesting there may be further upside ahead. Coca-Cola stock (NYSE: KO) has recently reversed its short-term downtrend, suggesting there may be further upside ahead.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-5800551950157845054",
        "title": "Why kosher-for-Passover Coca-Cola is going viral among non-Jewish shoppers",
        "url": "https://www.marketwatch.com/story/why-kosher-for-passover-coca-cola-is-going-viral-among-non-jewish-shoppers-63951740?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1744409040000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ko"
        ],
        "description": "The product, distinguished by its yellow cap, is made with cane sugar rather than high-fructose corn syrup. Some people can’t get enough.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "724143160181752468",
        "title": "Coca-Cola Consolidated declares $2.50 dividend",
        "url": "https://seekingalpha.com/news/4430572-coca-cola-consolidated-declares-2_50-dividend",
        "site": "seekingalpha.com",
        "time": 1744402410000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "6795888828945723468",
            "8184221596299490549"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-6132900850430021817",
        "title": "Hyatt Plans To Treble India Capacity on Wedding, Concerts Boom",
        "url": "https://www.bloomberg.com/news/articles/2025-04-11/hyatt-plans-to-treble-india-capacity-on-wedding-concerts-boom",
        "site": "bloomberg.com",
        "time": 1744373307000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Hyatt Hotels Corp. plans to treble its number of properties in India over the next five years, as affluent residents splurge on weddings, pilgrimage and concerts. Pilgrims take photographs at a photobooth set up by Coca-Cola brand, during Maha Kumbh Mela 2025 in Prayagraj, Uttar Pradesh, India, on Saturday, Feb. 1, 2025.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-2862860348448546931",
        "title": "P&G Targeted by EU Antitrust Watchdog Alongside Coca-Cola Raids",
        "url": "https://www.bloomberg.com/news/articles/2025-04-10/p-g-targeted-by-eu-antitrust-watchdog-alongside-coca-cola-raids",
        "site": "bloomberg.com",
        "time": 1744279244000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Procter & Gamble Co., the maker of Pampers diapers and Oral-B toothbrushes, was the unidentified target of an informal antitrust probe by European Union watchdogs, according to people familiar with the case. The Proctor & Gamble Co. logo.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "3148105674348981672",
        "title": "Arizona Lawmakers Approve Bill to Bar Soda From SNAP Purchases",
        "url": "https://www.bloomberg.com/news/articles/2025-04-08/arizona-lawmakers-approve-bill-to-bar-soda-from-snap-purchases",
        "site": "bloomberg.com",
        "time": 1744147574000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Arizona is poised to join a growing list of states seeking to stop low-income residents from using government-issued food benefits to purchase sugary beverages, including those made by Coca-Cola Co., PepsiCo Inc. and Keurig Dr. Pepper Inc. A shopper walks past Pepsi products at a supermarket in Clifton Park, New York, US, on Friday, Feb. 2, 2024. PepsiCo Inc. is scheduled to release earnings figures on February 9. Photographer: Angus Mordant/Bloomberg",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-7524884380578252606",
        "title": "Fuse raises $6.6M to fix a payment problem for companies expanding to MENA",
        "url": "https://techcrunch.com/2025/04/03/ex-bvnk-founder-launches-fuse-raises-6-6m-to-power-cross-border-payments-in-mena/",
        "site": "techcrunch.com",
        "time": 1743681600000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Expanding into the Middle East and North Africa (MENA) remains a costly and complex challenge for global businesses, thanks to fragmented regulations and banking systems. Dubai-based fintech Fuse aims to simplify that with a cross-border payments API and has raised $6.6 million in seed funding to make it happen. Founded in 2023 by George Davis, […]",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-3047756162000357883",
        "title": "FDA warns of possible plastic in recalled Coca-Cola cans",
        "url": "https://www.fastcompany.com/91306280/fda-warns-of-possible-plastic-in-recalled-coca-cola-cans?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1743010200000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ko"
        ],
        "description": "More than 10,000 cans of Original Coca-Cola distributed in two states have been voluntarily recalled. Manufacturer Reyes Coca-Cola Bottling initiated the recall on March 6 after reports of foreign plastic found inside cans. On March 24, the U.S. Food and Drug Administration (FDA) designated the recall as Class II, per the FDA enforcement report. According to the FDA’s recall classification page, a Class II recall means “a violative product may cause temporary or medically reversible adverse health consequences or where the probability of serious adverse health consequences is remote.”The report indicated that 864 12-count packs of the product distributed in Illinois and Wisconsin are included in the recall. The products have a single-can UPC of 0 49000-00634 6 and 12-pack UPC of 0 49000-02890 4. The recall number is F-0664-2025.A spokesperson with Reyes Coca-Cola Bottling confirmed the recall to ABC News. “The cases are being withdrawn because they did not meet our high-quality standards,” the spokesperson said. “We are taking this voluntary action because nothing is more important to us than providing high-quality products to the people who drink our beverages.”The latest recall is definitely not the first recall over foreign plastic or other foreign materials being found inside of a product’s packaging lately. Last month, Trader Joe’s issued a recall of its Frozen Acai Bowls over plastic contamination, and just last week, Nestlé USA recalled a number of Stouffer’s and Lean Cuisine meals over wood-like foreign material in the meals.If it seems like recalls have been happening more frequently lately, there’s truth to that suspicion. A February 2025 report, published by the Public Interest Research Group, a nonprofit consumer protection group, found that last year, there were about 300 food recalls which led to nearly 1,400 illnesses and 19 deaths.“Nearly 1,400 people became ill from food they ate in 2024 – 98% of them from just 13 outbreaks, a stunning fact that shows the consequences of companies producing or selling contaminated food,” the report explained.Stunningly, the number of hospitalizations and deaths in 2024 were about twice that of the previous year. According to that report, the most concerning contaminants were Listeria, Salmonella and E. coli.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-1440655777420435966",
        "title": "Coca-Cola brings back ‘Share a Coke’ for Gen Z",
        "url": "https://www.fastcompany.com/91305206/coca-cola-share-a-coke-for-gen-z",
        "site": "fastcompany.com",
        "time": 1743008400000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ko"
        ],
        "description": "For the first time in over a decade, Coca-Cola is relaunching its iconic “Share a Coke” campaign. This time around, it’s targeting Gen Z. When “Share a Coke” first debuted in Australia in 2011, replacing the “Coca-Cola” logo on Coke bottles with 150 of the most popular names in the region, it sold 250 million named bottles and cans in a nation of just under 23 million people. The idea was so successful that, over time, Coca-Cola replicated it in 70 different countries. And this April 1, a new version of “Share a Coke” is rolling out globally. The bones of the concept are the same as when it debuted more than a decade ago: In each local market, a range of the most popular regional names has been selected and printed onto Coke bottles and cans. This time, though, the campaign is including an expanded range of names, launching on a broader scale, and adding a few digital touches to attract a younger generation. The company is positioning this relaunch as a campaign with “unprecedented personalization” for Gen Z, but it’s a tough sell in an era when AI has made personalized marketing a much more achievable reality. Instead, it’s more like a nostalgic re-run with a couple modern tweaks—and it might not be enough to impress a new, digitally native generation. [Image: Coca-Cola] Coca-Cola’s plan to recruit young consumers According to the industry research firm IBIS, American consumption of soft drinks has been on a steady decline since 1999. That year, the average American would’ve consumed 49.7 gallons of soda, compared to 42.2 gallons today. But while the category as a whole might be losing steam, Coca-Cola remains profitable: Net revenues were up 3% to $47.1 billion in 2024, and the company’s shares have gone up by about 14% in the past year. For Gen Z, there are a few factors that influence soda consumption. To start, many younger consumers are increasingly interested in wellness, and therefore are choosing “functional beverages” like prebiotic drinks or lower sugar options. But soda isn’t a lost cause, either: As many younger consumers opt to drink less or stay sober entirely, they’re turning to other kinds of drinks at the bar, including plain old soda. Trends like the rise of dirty soda also signal that Gen Z still enjoys a sugary drink here and there. Islam Eldessouky, Coca-Cola’s global vice president of creative strategy and content, says the company’s idea to bring “Share a Coke” back actually came up while discussing new ways to “recruit as many Gen Zers into the franchise as we can” (a mission that the company has already pursued with new flavor launches like Spiced and Orange Cream). “One key data point that came up is that 72% of Gen Zers are really aspiring to make real connections,” Eldessouky says. “While we were contemplating different ideas of bringing this aspect of connection to the brand, somebody said, ‘Share a Coke was built on that.’” Originally, he explains, “Share a Coke” was about creating organic connections, like finding a bottle with a friend’s name on it and sharing it with them. In 2011—an era when “the whole notion of personalization was very basic and very primitive,” he says—discovering a Coke with your name on it felt especially exciting. To reinvent the concept in 2025 for a digitally native generation, though, the Coca-Cola team felt they’d have to do something bigger. [Image: Coca-Cola] A more digital ‘Share a Coke’ There are a few ways that Coca-Cola is seeking to make this new campaign feel more weighty. The scale is literally larger. This campaign is launching globally in 120 different markets over the course of the coming year, starting in North America, Latin America, and Asia South Pacific. The actual number of names used is greater as well, though the specific statistics vary by market. This version of the campaign will also include two new digital elements: “Memory Maker,” which lets users scan a QR code on their bottle to upload photos and videos to something like a Coke-powered group chat, and a new customization platform which lets fans order a Coke bottle online with a custom name or word (though, Eldessouky assures me, the platform won’t allow users to enter anything obscene or inflammatory). In addition, Coca-Cola is partnering with McDonald’s on an exclusive “Share a Coke” meal bundle, which will be available in the fast food chain’s restaurants. Coca-Cola says the goal of the ”Share a Meal,” as the company calls its, is to incentivize friend groups to connect in person rather than online. Part of the strategy of this partnership, Eldessouky says, is to provide Gen Z consumers with an accessible, inexpensive “third place.” “The third place is something that Gen Z is really craving, because it’s a very connected generation digitally, but they desire much more connection in real life than other generations,” Eldessouky says. “We’re trying to give [Gen Z] a lot of opportunities where they can actually go and find these third places to connect.” But the ‘Share a Coke’ concept doesn’t need add-ons As a member of the campaign’s target demographic myself, I think the customization platform is a nice add-on that might allow those whose names are less common to still participate in the campaign. But the other elements fall flat. The “Memory Maker” feature, for one, doesn’t exactly feel like the “unprecedented personalization” Coke hopes it will be. Today, given the advent of targeted marketing and AI tools, personalized campaigns just feel a lot less novel. Coca-Cola itself, for example, used AI in 2024 to make a holiday ad that was customized across 12 different U.S. geographies. Frankly, it’s tough to imagine many young people going through the effort of scanning a QR code in the first place, let alone using it to message friends. And a Coke and McDonald’s collaboration makes intuitive sense—but I’m not totally convinced by the idea that it’ll make McDonald’s a novel “third space” for Gen Zers who aren’t already hanging out there. All in all, the new “Share a Coke” campaign doesn’t look very different from its 2011 iteration, and that’s fine. I just wish Coke had just gone full-on millennial nostalgia with the marketing (see this extremely 2010s ad, for example) rather than making a play at Gen Z that feels tired at best.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "4972911785527129354",
        "title": "Coca-Cola Sites Were Among Secret Targets of EU Antitrust Raids",
        "url": "https://www.bloomberg.com/news/articles/2025-03-26/coca-cola-sites-were-among-secret-targets-of-eu-antitrust-raids",
        "site": "bloomberg.com",
        "time": 1743002292000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "-2862860348448546931"
        ],
        "description": "Coca-Cola Co.’s business in Europe was one of the unidentified targets of European Union antitrust raids earlier this month, according to people familiar with the probe. Shrink-wrapped packages of 6 aluminium cans of Coke soda move along the automated production line at the Coca-Cola Hbc Magyarorszag Kft plant in Dunaharaszti, Hungary, on Thursday, July 13, 2017. Coca-Cola is pushing to expand its non-soda offerings, but carbonated soft drinks still make up the majority of sales.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-2453961837213663402",
        "title": "Coca-Cola’s Annual Plastic Footprint Forecasted to Grow to 9.1 Billion Pounds by 2030",
        "url": "https://markets.businessinsider.com/news/stocks/coca-cola-s-annual-plastic-footprint-forecasted-to-grow-to-9-1-billion-pounds-by-2030-1034515151",
        "site": "businessinsider.com",
        "time": 1742976000000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ko"
        ],
        "description": "WASHINGTON, March 26, 2025 (GLOBE NEWSWIRE) -- Today, Oceana released a",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "278084326446673275",
        "title": "Mexican Coke Bottler Sets Record With $895 Million Investment",
        "url": "https://www.bloomberg.com/news/articles/2025-03-25/arca-continental-doubles-down-on-us-south-america-in-895-million-plan",
        "site": "bloomberg.com",
        "time": 1742929150000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Mexican Coca-Cola bottler Arca Continental will invest a record $895 million to expand its business in 2025, with a quarter of that amount going into its US operations. Bottles of Topo Chico mineral water move along a conveyor belt at the Arca Continental SAB production facility in Monterrey, Nuevo Leon state, Mexico, on Thursday, June 20, 2019. Coca Cola Co. bought the rights to Topo Chico and its distribution for $220 million. Last year, Arca Continental sold the equivalent of 36 million cases of 24 eight-ounce bottles and estimates that number reaching 74 million in 2022.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "719918246525959743",
        "title": "Junior Bridgeman, N.B.A. Player Turned Mogul, Dies at 71",
        "url": "https://www.nytimes.com/2025/03/15/sports/basketball/junior-bridgeman-dead.html",
        "site": "nytimes.com",
        "time": 1742064171000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "ko"
        ],
        "description": "He became an entrepreneur during a solid career with the Milwaukee Bucks. He later bought hundreds of fast-food outlets, a Coca-Cola bottling business and Ebony and Jet magazines.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "3378998873352422641",
        "title": "WPP loses Coca-Cola media work in North America",
        "url": "https://www.ft.com/content/5ee92217-712e-47a6-81c9-059e56757dd9",
        "site": "ft.com",
        "time": 1741974210000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "ko"
        ],
        "description": "Publicis wins Coke mandate in US and Canada from London-listed rival",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-2504796780542453155",
        "title": "PepsiCo is rated a notch below Coca-Cola, Keurig Dr Pepper, and Monster Beverage by Jefferies",
        "url": "https://seekingalpha.com/news/4419807-pepsico-is-rated-a-notch-below-coca-cola-keurig-dr-pepper-and-monster-beverage-by-jefferies",
        "site": "seekingalpha.com",
        "time": 1741806890000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-8710907459448837873",
        "title": "Coca-Cola is said to be eyeing a new N. American ad partner instead of WPP",
        "url": "https://seekingalpha.com/news/4418642-coca-cola-is-said-to-be-eyeing-a-new-n_-american-ad-partner-instead-of-wpp",
        "site": "seekingalpha.com",
        "time": 1741376235000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ko"
        ],
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-8766279178820733283",
        "title": "Coca-Cola quietly considers moving its North American media out of WPP",
        "url": "https://digiday.com/media-buying/coca-cola-quietly-considers-moving-its-north-american-media-out-of-wpp/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
        "site": "digiday.com",
        "time": 1741368883000,
        "favicon_url": "https://static.tickertick.com/website_icons/digiday.com.ico",
        "tags": [
            "ko"
        ],
        "similar_stories": [
            "-8710907459448837873"
        ],
        "description": "Nothing is decided yet, but if Coca-Cola does opt for a change then Publicis Groupe is the frontrunner to handle its media dollars in North America, which is reportedly worth close to $1 billion. WPP, no stranger to financial strains as of late, is facing another major headache. Though it’s not decided yet, one of its biggest spending advertisers — Coca-Cola — is considering a new partner for its biggest market in North America, according to three sources with knowledge of the account. If Coca-Cola does opt for a change, Publicis Groupe is the frontrunner to handle its media dollars in North America, which is reportedly worth close to $1 billion, those sources said. Even if the account were to change, WPP isn’t being shut out entirely. It remains Coca-Cola’s global marketing partner under the OpenX model, which includes media and creative. And while the media account in North America is in flux, those same sources say the region’s creative business is expected to stay put.Continue reading this article on digiday.com. Sign up for Digiday newsletters to get the latest on media, marketing and the future of TV.",
        "tickers": [
            "ko"
        ]
    },
    {
        "id": "-6747612629686701398",
        "title": "Elusive Coke-Bottling Billionaire Thrust Into FTSE Limelight",
        "url": "https://www.bloomberg.com/news/articles/2025-03-06/elusive-coke-bottling-billionaire-thrust-into-ftse-limelight",
        "site": "bloomberg.com",
        "time": 1741237202000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ko"
        ],
        "description": "With Coca-Cola Europacific Partners entering the UK benchmark, Daurella will need to up the company’s game. CCEP bottles and distributes a variety of Coca-Cola-brand beverages, including Coke, Sprite, Monster, Fanta and Powerade.",
        "tickers": [
            "ko"
        ]
    }
]