[
    {
        "id": "-4880290052833038515",
        "title": "Regeneron is said to have declined a higher bid for 23andMe after Wojcicki's offer | $REGN $MEHCQ",
        "url": "https://seekingalpha.com/news/4458882-regeneron-declines-higher-bid-for-23andme",
        "site": "seekingalpha.com",
        "time": 1750167863000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-212050463460367990",
        "title": "Founder of 23andMe buys back company out of bankruptcy auction",
        "url": "https://arstechnica.com/science/2025/06/founder-of-23andme-buys-back-company-out-of-bankruptcy-auction/",
        "site": "arstechnica.com",
        "time": 1750081143000,
        "favicon_url": "https://static.tickertick.com/website_icons/arstechnica.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Concerns about transfer of genetic data to new company may now be moot. Anne Wojcicki has been declared the winner of a bankruptcy auction for 23andMe, the genetics testing start-up she founded, prevailing over a rival bid from Regeneron Pharmaceuticals. TTAM Research Institute, a non-profit public benefit company also founded by Wojcicki, won the auction with a $305 million bid for the 23andMe assets, which will not come with any company liabilities attached. 23andMe filed for bankruptcy in March after rejecting several go-private offers from Wojcicki in recent years. Regeneron was declared the winning bidder in May after the company accepted a $256 million bid in a previous auction.Read full article Comments",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "8205838743152824725",
        "title": "23andMe founder buys back genetic testing company in second auction",
        "url": "https://www.ft.com/content/43ec5fe2-3dec-41bf-9679-e9637951971f",
        "site": "ft.com",
        "time": 1749854921000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Anne Wojcicki pays $305mn to defeat a previous deal struck with Regeneron Pharmaceuticals",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "6150976619775831665",
        "title": "23andMe sold to non-profit headed by co-founder Anne Wojcicki | $REGN $MEHCQ",
        "url": "https://seekingalpha.com/news/4458148-23andme-sold-non-profit-headed-by-co-founder-anne-wojcicki",
        "site": "seekingalpha.com",
        "time": 1749849678000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "8491547468301795865",
        "title": "Sources: Anne Wojcicki is poised to regain control of 23andMe, after her nonprofit TTAM offered $305M to top Regeneron's bid for the DNA-testing company (Wall Street Journal)",
        "url": "http://www.techmeme.com/250613/p20#a250613p20",
        "site": "techmeme.com",
        "time": 1749846302000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Wall Street Journal: Sources: Anne Wojcicki is poised to regain control of 23andMe, after her nonprofit TTAM offered $305M to top Regeneron's bid for the DNA-testing company — Regeneron is backing away from buying the DNA-testing company after a nonprofit controlled by co-founder Wojcicki made a higher bid",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-6613948228806773969",
        "title": "23andMe plans to hold a new auction for its DNA data, opening with a $305M bid led by Anne Wojcicki, after the ex-CEO challenged Regeneron's winning bid in May (Steven Church/Bloomberg)",
        "url": "http://www.techmeme.com/250605/p4#a250605p4",
        "site": "techmeme.com",
        "time": 1749099000000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Steven Church / Bloomberg: 23andMe plans to hold a new auction for its DNA data, opening with a $305M bid led by Anne Wojcicki, after the ex-CEO challenged Regeneron's winning bid in May — Bankrupt genetic analysis company 23andMe will hold a second auction for its cache of DNA data with an opening bid of $305 million …",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-7850838336996561082",
        "title": "23andMe Judge Questions Limits for New Auction for Bankrupt Firm",
        "url": "https://www.bloomberg.com/news/articles/2025-06-04/23andme-judge-questions-limits-for-new-auction-for-bankrupt-firm",
        "site": "bloomberg.com",
        "time": 1749074027000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "regn"
        ],
        "description": "The judge overseeing the bankruptcy of 23andMe questioned the limits proposed for a second auction that is designed to push bids higher than a current $256 million offer from Regeneron Pharmaceuticals for the genetic-testing firm. Signage at 23andMe headquarters in Sunnyvale, California, U.S., on Wednesday, Jan. 27, 2021. Consumer DNA-testing company 23andMe Inc. is in talks to go public through a roughly $4 billion deal with VG Acquisition Corp., a special purpose acquisition company founded by billionaire Richard Branson, according to people familiar with the matter.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-8378899493638236911",
        "title": "Kymera’s STAT6 Degrader for Inflammatory Disease Shows Early Success in Phase I",
        "url": "https://www.genengnews.com/topics/translational-medicine/kymeras-stat6-degrader-for-inflammatory-disease-shows-early-success-in-phase-i/",
        "site": "genengnews.com",
        "time": 1748915736000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "regn"
        ],
        "description": "The investigational drug demonstrated robust STAT6 degradation in blood and skin that was well tolerated in healthy volunteers, and aims to rival Sanofi and Regeneron’s blockbuster therapy, Dupilumab, which is taken by more than one million patients. The post Kymera’s STAT6 Degrader for Inflammatory Disease Shows Early Success in Phase I appeared first on GEN - Genetic Engineering and Biotechnology News. Kymera Therapeutics has announced positive results in an early-stage Phase I trial for an investigational drug designed to treat millions of patients experiencing symptoms of chronic inflammation and allergic reactions. This spectrum of targeted conditions, known as Th2 diseases, is characterized by dysregulation of T helper type 2 (Th2) cells in immune response and includes common conditions, such as asthma and atopic dermatitis (AD) or eczema. The oral drug candidate aims to rival Sanofi and Regeneron’s blockbuster therapy, Dupilumab, which recorded $11.6 billion in global sales in 2023. The trial tested the safety and efficacy of KT-621, a once-a-day drug which degrades STAT6, a signaling protein crucial in immune response. Results from the 118 healthy volunteer study showed that KT-621 was well tolerated with a safety profile undifferentiated from placebo. To support proof-of-concept, KT-621 achieved over 90% STAT6 degradation in blood at all doses above 1.5 mg. Additionally, complete STAT6 degradation was achieved in both blood and skin at all doses over 50 mg. Although the Phase I trial was completed in healthy volunteers who did not experience disease symptoms, KT-621 impacted Th2 biomarkers competitive to Dupilumab with median 37% and 63% reduction in TARC (thymus and activation-regulated chemokine) and Eotaxin-3 respectively, two signaling molecules that play an active role in recruiting immune cells. Dupilumab, which is taken by more than one million patients, is approved for both eczema and asthma, among other conditions. The treatment is an antibody administered as an injectable biologic that targets the IL-4 receptor upstream of STAT6 to block immune signals for inflammation. In contrast, Kymera’s targeted protein degradation (TPD) technology uses small molecules to trigger degradation of a disease-relevant protein, in this case STAT6, to achieve a competitive therapeutic effect. In biology, cells clean out misfolded or accumulated proteins via the E3 ubiquitin pathway. TPD involves the tagging of protein targets by small molecule degraders, sometimes called PROTACs (proteolysis targeting chimeras). KT-621 was previewed in a keynote presentation at SLAS 2024 by Juliet Williams, PhD, head of research at Kymera. Nello Mainolfi, PhD, CEO of Kymera, told GEN that the goal of KT-621 is to expand treatment access to large patient populations who may not be eligible for injectable biologics use. He added that KT-621 demonstrates the first safe and successful targeting of STAT6, an attractive target that has eluded the industry for the past decade, that operates as well as its injectable counterparts. TBD small molecules have the advantage of not being challenged by logistical considerations faced by injectable biologics, such as cold storage. Catalytic degraders also provide sustained effects over time compared to traditional small molecule inhibitors, whose effects dissipate once the drug is cleared. Mainolfi said Kymera distinguishes itself as a company that goes after targets that have not yet been drugged with a TBD pipeline fully focused on immunology. Other candidates in Kymera’s pipeline include an IRF5 degrader program announced in May which expands into rheumatic and other autoimmune diseases, including lupus. The KT-621 Phase Ib trial in moderate and severe AD is actively recruiting with data expected in Q4 of 2025. Additionally, two parallel Phase IIb trials in AD and asthma are planned to start in Q4 of 2025 and Q1 of 2026 respectively. The post Kymera’s STAT6 Degrader for Inflammatory Disease Shows Early Success in Phase I appeared first on GEN - Genetic Engineering and Biotechnology News.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-1582242008788749839",
        "title": "Regeneron reports early data in mid-stage trial of obesity treatment",
        "url": "https://seekingalpha.com/news/4454219-regeneron-reports-early-data-in-mid-stage-trial-of-obesity-treatment",
        "site": "seekingalpha.com",
        "time": 1748871882000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-6840957858659268936",
        "title": "REGN Stock Undervalued At $500?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/02/regn-stock-undervalued-at-500/",
        "site": "forbes.com",
        "time": 1748869596000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "regn"
        ],
        "description": "In light of the significant drop in Regeneron’s stock price, a natural question emerges: is REGN now a viable buying opportunity? In light of the significant drop in Regeneron’s stock price, a natural question emerges: is REGN now a viable buying opportunity?",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-8196467960850640378",
        "title": "23andMe founder says Fortune 500 company backs new buyout offer",
        "url": "https://www.ft.com/content/6dd8adf1-317d-4883-83ee-a11d81b7f415",
        "site": "ft.com",
        "time": 1748792995000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Anne Wojcicki calls for fresh bankruptcy auction of genetic testing company after Regeneron won bidding",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "2743063988997605258",
        "title": "Notable analyst calls this week: Southwest Airlines, Regeneron and Nvidia among top picks",
        "url": "https://seekingalpha.com/news/4453945-notable-analyst-calls-this-week-southwest-airlines-regeneron-and-nvidia-among-top-picks",
        "site": "seekingalpha.com",
        "time": 1748698513000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "5880280533240670989",
        "title": "Regeneron dashes Wall Street’s hopes as COPD treatment trial suffers a failure",
        "url": "https://www.marketwatch.com/story/regeneron-dashes-wall-streets-hopes-as-copd-treatment-trial-suffers-a-failure-1ffb6016?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1748632740000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Regeneron’s stock is having its worst day in 14 years after the failure of late-stage trial of its COPD treatment, after analysts had just placed a high probability of a positive result.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "7291158328320882671",
        "title": "StockWatch: Intellia Stumbles on News of Patient’s Severe Liver Toxicity",
        "url": "https://www.genengnews.com/topics/genome-editing/stockwatch-intellia-stumbles-on-news-of-patients-severe-liver-toxicity/",
        "site": "genengnews.com",
        "time": 1748629616000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Intellia's MAGNITUDE trial is evaluating nexiguran ziclumeran (nex-z), an in vivo CRISPR therapy partnered with Regeneron, designed to treat ATTR-CM by inactivating the TTR gene that drives transthyretin amyloidosis. The post StockWatch: Intellia Stumbles on News of Patient’s Severe Liver Toxicity appeared first on GEN - Genetic Engineering and Biotechnology News. Intellia Therapeutics (NASDAQ: NTLA) found out this past week what other genetic medicine developers have learned in recent weeks: Any safety issue that arises in a clinical trial is enough to send investors scrambling to sell their shares. Intellia saw its stock tumble 23% Thursday to $7.45 from $9.66 at Wednesday’s closing bell. In between, Intellia filed a Form 8-K on Wednesday evening revealing that one of about 365 patients enrolled in the company’s global Phase III MAGNITUDE trial (NCT06128629) developed severe liver toxicity which apparently later abated. That news sparked a double-digit post-market drop in Intellia’s stock price that dragged down shares through Thursday and into Friday, when the stock price fell another roughly 8% to $6.87. “There has been a single, recent, asymptomatic patient with grade 4 liver transaminase elevations based on laboratory tests, which appear to be resolving without hospitalization or medical intervention and have fallen to grade 3 ALT [alanine aminotransferase] and grade 2 AST [aspartate transaminase] elevations,” Intellia reported. “We continue to monitor these events as the MAGNITUDE study progresses.” MAGNITUDE, which dosed its first patient in March 2024, is assessing nexiguran ziclumeran (nex-z, formerly NTLA-2001), a Regeneron Pharmaceuticals-partnered in vivo CRISPR-based therapy designed to treat transthyretin amyloidosis with cardiomyopathy (ATTR-CM) by inactivating the TTR gene. This gene encodes for the mutated transthyretin (TTR) protein that causes polyneuropathy. As Adam Feuerstein of STAT News reported on X and several analysts later confirmed in their research notes, Intellia issued the regulatory filing after initially disclosing the safety issue selectively at investor meetings. The company then discussed the news with analysts Wednesday evening on a conference call. Mani Foroohar, MD, a senior research analyst with Leerink Partners focused on genetic medicines, opined that Intellia’s post-market stock drop was expected given the broader issue raised by the company’s safety disclosure—though he and other analysts continue, for now, to maintain a generally positive view of the CRISPR-based gene editing therapy developer. ‘Not surprised’ “While this one occurrence comes in the context of hundreds of treated patients across NTLA trials, we are not surprised to see shares down 15% after hours, with investor sensitivity high in the wake of unexpected safety events in Genetic Medicines,” Foroohar wrote Wednesday. He cited as a recent example Rocket Pharmaceuticals (NASDAQ: RCKT), which on Tuesday disclosed that one of its patients dosed with its Danon disease gene therapy candidate RP-A501 died in a pivotal Phase II trial, which the FDA has placed on clinical hold. The patient, whose age was not disclosed, suffered an unexpected serious adverse event involving clinical complications related to capillary leak syndrome, following dosing with RP-A501 in early May, Rocket’s CEO Gaurav Shah, MD, told analysts. Another tragedy linked to a gene therapy took place in March, when Sarepta Therapeutics (NASDAQ: SRPT) acknowledged the sudden death of a 16-year-old patient with Duchenne muscular dystrophy (DMD) following treatment with Elevidys® (delandistrogene moxeparvovec-rokl), the only gene therapy approved by the FDA to treat DMD. In Intellia’s case, the patient with liver toxicity showed no transaminase elevations after one week, which according to Foroohar suggested that the event was not driven by nex-z’s lipid nanoparticle (LNP) formulation, since such elevations would have appeared after ~4-5 days had there been LNP toxicity. The Grade 4 elevation was detected at Day 24, with transaminase peaking at Day 28. The patient showed “high normal” bilirubin at baseline, and increased marginally, but never exceeded 2x the upper limit of normal. “While this incremental color has us feeling more reassured on this patient’s course, and on the impact of this event on the fundamentals of the company (virtually nil), we expect bears to argue this disclosure could slow enrollment or deter patient interest—a thesis unsupported by brisk enrollment to date, low rate of occurrence for this (reversible and asymptomatic) event, and robust patient interest suggested by our recent TTR physician treater survey,” Foroohar added. Myles R. Minter, PhD, a partner and analyst covering biotechnology companies for William Blair, added additional details shared by Intellia during the analysts call in his research note Thursday: By the last update on day 36 following infusion, lab tests had fallen to grade 3 for ALT and grade 2 for AST without hospitalization or medication. The patient’s liver issue did not qualify as Hy’s Law, since there was no evidence of liver damage. ALT and AST levels are expected to return to baseline within 6-8 weeks post-infusion if the liver tox case is similar to a grade 4 liver function test (LFT) case seen in a Phase I study of nex-z. Remaining positive Because the profiles were similar among the two patients who showed grade 4 LFT, Intellia presumes that the safety issues were related to nex-z, though Intellia remains blinded to study results. “Although there are outstanding questions here, we remain positive on the risk/benefit given the two reported grade 4 LFT events with nex-z have been asymptomatic to date, avoided hospitalization, and are likely to resolve without medication, in our view,” Minter wrote. Intellia said MAGNITUDE had reached enrollment of 365 patients as of the analysts’ conference call, 48% of the target enrollment of approximately 765 patients after about 17 months. Trial enrollment is expected to be completed by early 2027. More than 200 patients have been dosed with nex-z in the MAGNITUDE trial, according to Intellia. “If we assume about 240 patients treated in MAGNITUDE (2:1 randomization) and 65 patients treated in the Phase I study (polyneuropathy and cardiomyopathy) with nex-z, then the grade 4 LFT elevation incidence is 0.66%,” Minter wrote. “We will be keeping an eye on this but it is an objectively low rate, and we do not believe at this time it should have broader read-through to other LNP-delivered genetic medicines.” Minter cited as an example Verve Therapeutics (NASDAQ: VERV), which announced positive initial data on April 14 from the Phase 1b Heart-2 trial (NCT06164730) assessing VERVE-102 in heterozygous familial hypercholesterolemia (HeFH) and/or premature coronary artery disease. Among 14 participants across three dose levels, a single VERVE-102 infusion yielded dose-dependent decreases in blood PCSK9 protein levels and low-density lipoprotein cholesterol (LDL-C), with a mean reduction in blood LDL-C of 53% and a maximum of 69% seen among four participants in the 0.6 mg/kg dose cohort. Yet last year, investors punished Verve by sending its shares nosediving 35% after the company reported a serious adverse event in one patient during its Phase 1b Heart-1 trial (NCT05398029), a grade 3 drug-induced transient elevation of serum alanine aminotransferase (ALT) and grade 3 drug-induced thrombocytopenia. After pausing Heart-1 which assessed VERVE-101 in heterozygous familial hypercholesterolemia (HeFH), Verve pivoted its development effort toward VERVE-102. Outstanding safety questions “[Intellia’s] second grade 4 LFT serious adverse event with nex-z is obviously disappointing and with the stock down 18% in aftermarket trading, there will be outstanding questions about safety moving forward. However, we believe the asymptomatic nature of these elevations and low incidence still plays out for a favorable risk/benefit for nex-z in TTR amyloidosis,” Minter asserted. He continued: “Yes, there are other effective treatment options here with TTR stabilizers and silencers, so safety will be a consideration moving forward in this indication, but with enrollment timelines for MAGNITUDE on track, we continue to see nex-z’s TTR knockdown profile as impressive and derisking a positive clinical outcome.” Minter reiterated William Blair’s “Outperform” rating on Intellia shares, “but expect the stock to be weak in response to this safety update.” Also holding fast are H.C. Wainwright analyst Mitchell Kapoor, who reiterated his firm’s “Buy” rating and $30 price target on Intellia shares; analyst Silvan Tuerkcan of Citizens JMP, who maintained his firm’s “Market Perform” rating; and Rick Bienkowski of Cantor Fitzgerald, who reiterated his firm’s “Overweight” rating and $65 price target. However, Greg Harrison at BofA Securities trimmed his firm’s price target on Intellia shares 9%, from $43 to $39. Jefferies equity analyst Maury Raycroft, PhD, noted in his report that in addition to high-normal bilirubin, the patient also was shown to have 3 grams of paracetamol (the equivalent of Tylenol sold outside the U.S.) per day for about 8 days before receiving nex-z, “which we believe could be an additional/supportive explanation for the Gr[ade] 4 LFT event, since acetaminophen can induce liver damage on its own and may have induced an exaggerated response to NTLA’s gene editing therapy.” After noting an 18% post-market drop in the stock as of his report deadline, Raycroft offered some investment advice favorable to Intellia: “We would accumulate on weakness.” Leaders and laggards InflaRx (NASDAQ: IFRX) shares plummeted 60% from $1.82 to 73 cents Wednesday after the company announced it intends to end development of vilobelimab in pyoderma gangrenosum (PG), halting a Phase II",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-22006607380006076",
        "title": "Regeneron slumps as Wells Fargo cuts on COPD trial data",
        "url": "https://seekingalpha.com/news/4453927-regeneron-stock-downgraded-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1748617263000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-4400748571096194167",
        "title": "Stock Movers: Ulta Beauty, Cooper Companies, Regeneron (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-30/stock-movers-ulta-beauty-cooper-companies-regeneron-podcast",
        "site": "bloomberg.com",
        "time": 1748615487000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "regn"
        ],
        "similar_stories": [
            "-8075859424786251388"
        ],
        "description": "Source: Bloomberg, 5:02",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "328697812561911644",
        "title": "Sanofi, Regeneron fall after late-stage data for COPD therapy",
        "url": "https://seekingalpha.com/news/4453787-sanofi-stock-regeneron-stock-fall-copd-data",
        "site": "seekingalpha.com",
        "time": 1748602540000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-4567963192604782902",
        "title": "Intellia slides after safety concern for Regeneron-partnered gene editing therapy | $NTLA $REGN",
        "url": "https://seekingalpha.com/news/4453339-intellia-stock-down-safety-concern-gene-editing-drug",
        "site": "seekingalpha.com",
        "time": 1748518230000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "4744348792369149647",
        "title": "Biohaven says anti-cancer agent cut tumor size with Regeneron’s Libtayo in Phase 1 trial | $REGN $BHVN",
        "url": "https://seekingalpha.com/news/4453127-biohaven-says-anti-cancer-agent-cut-tumor-size",
        "site": "seekingalpha.com",
        "time": 1748457886000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "8136946542860753844",
        "title": "Bayer wins EU recommendation for label expansion of Regeneron-partnered Eylea",
        "url": "https://seekingalpha.com/news/4451999-bayer-wins-eu-recommendation-for-label-expansion-of-regeneron-partnered-eylea",
        "site": "seekingalpha.com",
        "time": 1748005823000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "6156442668099706489",
        "title": "Bayer A.G.'s eye disease treatment gets approval in China | $REGN $BAYZF",
        "url": "https://seekingalpha.com/news/4451584-bayer-ags-eye-disease-treatment-gets-approval-in-china",
        "site": "seekingalpha.com",
        "time": 1747921215000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-3149562071966528195",
        "title": "Customized CRISPR for KJ, 10x and Illumina Lawsuits, Regeneron Bags 23andMe",
        "url": "https://www.genengnews.com/topics/genome-editing/customized-crispr-for-kj-10x-and-illumina-lawsuits-regeneron-bags-23andme/",
        "site": "genengnews.com",
        "time": 1747890907000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "regn"
        ],
        "description": "We discuss the first patient to be treated with a personalized CRISPR therapy and new CRISPR research. On the business front, 10x settles with Bruker and Vizgen, Illumina sues Element, and Prime downsizes. The post Customized CRISPR for KJ, 10x and Illumina Lawsuits, Regeneron Bags 23andMe appeared first on GEN - Genetic Engineering and Biotechnology News. A baby, named KJ, has become the first patient to be treated with a personalized CRISPR therapy to address a severe metabolic disorder. We discuss this story—one of the biggest science/medical stories from ASGCT 2025—and talk about the family and scientists at its center. In other news, laboratory-evolved CRISPR-associated bacterial transposases are being used to insert healthy genes into human cells. On the business front, 10x Genomics settles with Bruker and Vizgen while Illumina sues Element Biosciences for patent infringement. Also, trouble for Prime Medicine as the company pivots its pipeline and downsizes, and after months of speculation about its fate, 23andMe is acquired by Regeneron. Listed below are links to the GEN stories referenced in this episode of Touching Base: ASGCT 2025: World’s First Patient Treated with Personalized CRISPR TherapyBy Fay Lin, PhD, GEN, May 15, 2025 EvoCAST Harnesses CRISPR-Linked Bacterial Transposases to Insert Genes Into Human CellsGEN, May 18, 2025 eePASSIGE Engineers Gene-Sized Edits in Human CellsGEN, June 10, 2024 Illumina Sues Element Biosciences, Alleging Infringement of Flow Cell, Imaging PatentsBy Alex Philippidis, GEN Edge, May 18, 2025 10x Settles Bruker, Vizgen Patent LawsuitsBy Julianna LeMieux, PhD, and Alex Philippidis, GEN, May 18, 2025 Prime Medicine Chops 25% of Workforce, Pivots Pipeline as CEO QuitsBy Alex Philippidis, GEN Edge, May 19, 2025 Regeneron to Acquire 23andMe with Winning $256M BidGEN, May 19, 2025 Produced with support from: The post Customized CRISPR for KJ, 10x and Illumina Lawsuits, Regeneron Bags 23andMe appeared first on GEN - Genetic Engineering and Biotechnology News.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-1200344961359852680",
        "title": "What Regeneron's Purchase Of 23andMe Means For Your Genetic Privacy",
        "url": "https://www.forbes.com/sites/larsdaniel/2025/05/21/what-regenerons-purchase-of-23andme-means-for-your-genetic-privacy/",
        "site": "forbes.com",
        "time": 1747859065000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Your DNA, new owner—what Regeneron's purchase of 23andMe means for your genetic privacy. Your DNA, new owner—what Regeneron's purchase of 23andMe means for your genetic privacy.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-4800521266982404649",
        "title": "InnovationRx: FDA Will Limit Covid-19 Vaccines To Those Over 65 Or At High Risk",
        "url": "https://www.forbes.com/sites/innovationrx/2025/05/21/innovationrx-fda-will-limit-covid-19-vaccines-to-those-over-65-or-at-high-risk/",
        "site": "forbes.com",
        "time": 1747843255000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "regn"
        ],
        "description": "In this week’s edition of InnovationRx, we look at the FDA's new rules on Covid-19 vaccines, Novartis’s acquisition strategy, Medtronic’s diabetes spinoff, Regeneron’s purchase of 23AndMe, and more. In this week’s edition of InnovationRx, we look at the FDA's new rules on Covid-19 vaccines, Novartis’s acquisition strategy, Medtronic’s diabetes spinoff, Regeneron’s purchase of 23AndMe, and more.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-9115665490092555940",
        "title": "23andMe sale grafts a happy ending on to a glum tale",
        "url": "https://www.ft.com/content/0c688f2f-5724-441b-b6f4-6ba98ec0d827",
        "site": "ft.com",
        "time": 1747753853000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Being spliced on to Regeneron will free the genetic testing company from its fatal dependence on sporadic revenue",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-763084681151094237",
        "title": "Biotech company Regeneron to buy bankrupt 23andMe for $256M",
        "url": "https://arstechnica.com/science/2025/05/biotech-company-regeneron-to-buy-bankrupt-23andme-for-256m/",
        "site": "arstechnica.com",
        "time": 1747689882000,
        "favicon_url": "https://static.tickertick.com/website_icons/arstechnica.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Regeneron will use trove of 23andMe genetic data to develop medical advances. Biotechnology company Regeneron will acquire 23andMe out of bankruptcy for $256 million, with a plan to keep the DNA-testing company running without interruption and uphold its privacy protection promises. In its announcement of the acquisition, Regeneron assured 23andMe's 15 million customers that their data—including genetic and health information, genealogy, and other sensitive personal information—would be safe and in good hands. Regeneron aims to use the large trove of genetic data to further its own work using genetics to develop medical advances—something 23andMe tried and failed to do. \"As a world leader in human genetics, Regeneron Genetics Center is committed to and has a proven track record of safeguarding the genetic data of people across the globe, and, with their consent, using this data to pursue discoveries that benefit science and society,\" Aris Baras, senior vice president and head of the Regeneron Genetics Center, said in a statement. \"We assure 23andMe customers that we are committed to protecting the 23andMe dataset with our high standards of data privacy, security, and ethical oversight and will advance its full potential to improve human health.\"Read full article Comments",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-843385046659429198",
        "title": "23andMe to Be Bought by Regeneron Pharmaceuticals, a Biotech Company, for $256 Million",
        "url": "https://www.nytimes.com/2025/05/19/business/regeneron-pharmaceuticals-23andme-data.html",
        "site": "nytimes.com",
        "time": 1747688244000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Regeneron Pharmaceuticals said it would acquire 23andMe, which filed for bankruptcy in March and would continue to offer consumer DNA testing services. 23andMe’s DNA testing kits were once a hot item, bought by millions of customers to learn about their ancestry, family traits and potential health risks.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "8006748988170175765",
        "title": "Regeneron to Acquire 23andMe with Winning $256M Bid",
        "url": "https://www.genengnews.com/topics/omics/regeneron-to-acquire-23andme-with-winning-256m-bid/",
        "site": "genengnews.com",
        "time": 1747673748000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "regn"
        ],
        "similar_stories": [
            "-4880290052833038515",
            "4413552090532095957"
        ],
        "description": "The sale remains subject to approval by the U.S. Bankruptcy Court for the Eastern District of Missouri, which has appointed an independent Consumer Privacy Ombudsman to examine the deal, assess its impact on consumers’ privacy, and report back to the court by June 10. The post Regeneron to Acquire 23andMe with Winning $256M Bid appeared first on GEN - Genetic Engineering and Biotechnology News. More than two months after filing for Chapter 11, 23andMe has found a buyer in Regeneron Pharmaceuticals, which has agreed to acquire substantially all the bankrupt direct-to-consumer genetic testing pioneer’s assets for approximately $256 million after winning a competitive auction on Friday. Regeneron emphasized in announcing the deal that it had committed to complying with 23andMe’s privacy policies, protecting its genetic data contributed by customers under applicable law, and maintaining security controls in place designed to protect such data. 23andMe has collected data from some 15 million customers. Yet the sale remains subject to approval by the U.S. Bankruptcy Court for the Eastern District of Missouri, which has appointed an independent Consumer Privacy Ombudsman to examine the deal, assess its impact on consumers’ privacy, and report back to the court by June 10. The bankruptcy court is set to consider approving Regeneron’s acquisition of 23andMe on June 17, with the deal expected to close during the third quarter of this year. The transaction remains subject to approval by the bankruptcy court, approval under the Hart-Scott-Rodino Act, and customary closing conditions. “Through our Regeneron Genetics Center, we have a proven track record of safeguarding personal genetic data, and we assure 23andMe customers that we will apply our high standards for safety and integrity to their data and ongoing consumer genetic services,” George D. Yancopoulos, MD, PhD, Regeneron’s co-founder, board co-chair, president and chief scientific officer, said in a statement. “We believe we can help 23andMe deliver and build upon its mission to help people learn about their own DNA and how to improve their personal health, while furthering Regeneron’s efforts to improve the health and wellness of many.” Regeneron said it will acquire substantially all of 23andMe’s assets, including its Personal Genome Service (PGS), Total Health, and Research Services business lines. Its $256 million agreement does not include the purchase of 23andMe’s Lemonaid Health subsidiary, which 23andMe said it plans to “wind down in an orderly manner” in accordance with the purchase agreement. Employment offered to all employees Regeneron has offered employment to all employees of the acquired 23andMe business units, “which will allow us to continue our mission of helping people access, understand and gain health benefits through greater understanding of the human genome,” Mark Jensen, Chair and member of the special committee of 23andMe’s board, said in the statement. 23andMe filed for protection from creditors under Chapter 11 of the U.S. Bankruptcy Code on March 23, with the aim of finding a buyer for the business through a bankruptcy court auction. As part of the court-supervised sale process, 23andMe required all bidders to guarantee that they will comply with its privacy policies and applicable law. “After a thorough evaluation of strategic alternatives, we have determined that a court-supervised sale process is the best path forward to maximize the value of the business,” Jensen said in a statement at the time. “We expect the court-supervised process will advance our efforts to address the operational and financial challenges we face, including further cost reductions and the resolution of legal and leasehold liabilities.” Jensen was appointed board chair, while Joe Selsavage, 23andMe’s chief financial and accounting officer, took on the additional role of interim chief executive officer, and Matt Kvarda, a managing director at management consulting firm Alvarez & Marsal, has been appointed chief restructuring officer. To support its operations, 23andMe secured a commitment for up to $35 million in debtor-in-possession (DIP) financing from JMB Capital Partners. The DIP financing plus cash generated from the company’s ongoing operations is expected to support the business during the bankruptcy period. 23andMe said the outcome of the auction satisfied conditions to access the second tranche of the financing, providing additional liquidity to support the business pending completion of the sale. Among potential bidders who expressed interest in acquiring 23andMe were Anne Wojcicki, who co-founded 23andMe in 2006 and served as its CEO until she resigned shortly before the Chapter 11 filing. Wojcicki, who has remained on 23andMe’s board, offered in March to take 23andMe out of public ownership by offering to buy the company for $42 million—consisting of a $30 million bridge loan, $10 million in new capital, and $2 million of her own rollover equity. “We are pleased to have reached a transaction that maximizes the value of the business and enables the mission of 23andMe to live on, while maintaining critical protections around customer privacy, choice and consent with respect to their genetic data,” Jensen said today. The post Regeneron to Acquire 23andMe with Winning $256M Bid appeared first on GEN - Genetic Engineering and Biotechnology News.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-3466977581194758208",
        "title": "23andMe, including sensitive genetic data, sold to biotech company Regeneron Pharmaceuticals",
        "url": "https://www.fastcompany.com/91336911/23andme-sensitive-dna-genetic-data-sold-to-regeneron-biotech?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1747668300000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Genetic data was on the auction block, and a U.S. biotech company ponied up the cash. New York-based Regeneron Pharmaceuticals announced on Monday that it has purchased DNA testing company 23andMe through a bankruptcy auction for a total of $256 million. The deal includes most of the company’s assets, including, notably, user and customer data. Regeneron’s announcement emphasizes that the company will comply with existing privacy laws and 23andMe’s policies, which were conditions of the sale. Privacy experts have said that any such sale presents special challenges given the sensitive nature of the genetic data that 23andMe collects. “The agreement includes Regeneron’s commitment to comply with the Company’s privacy policies and applicable law, process all customer personal data in accordance with the consents, privacy policies and statements, terms of service, and notices currently in effect and have security controls in place designed to protect such data,” the announcement reads. Regeneron says that 23andMe required any bidders to “guarantee” that they would comply with its existing privacy policies. A third-party consumer privacy ombudsman, or CPO, will be appointed by the court to examine the transaction, which is still subject to court approval. Such court-appointed ombudsman are often required in bankruptcy cases where sensitive data is involved, although 23andMe had initially tried to argue that one wasn’t necessary. Company leadership also doubled-down on the promises to protect the integrity of 23andMe’s customers’ data. “We are pleased to have reached a transaction that maximizes the value of the business and enables the mission of 23andMe to live on, while maintaining critical protections around customer privacy, choice and consent with respect to their genetic data,” said Mark Jensen, chair and member of the special committee of the board of directors of 23andMe, per the statement. A stellar rise and steep fall Founded in 2006, 23andMe gained popularity for its DNA testing kits, which were used to collect saliva samples and provide customers with a readout of their genetic ancestry and history. At one time, it had 15 million customers, but a data breach in 2023 hammered demand after 7 million customer records were accessed, and 23andMe never recovered. The company went public by merging with a special purpose acquisition company in 2021, the height of the so-called SPAC craze. It briefly hit a valuation of $6 billion, but profits were elusive. By the middle of 2024, it was trading in penny-stock territory. Following the breach and the company’s subsequent Chapter 11 filing in March of this year, some policymakers—such as California Attorney General Rob Bonta—recommended that users delete their information, which could be done through a user’s profile on the 23andMe website. As for what’s next, the deal should close sometime later this year, and 23andMe is expected to continue to operate as a unit of Regeneron. Shares of Regeneron Pharmaceuticals (Nasda: REGN) were down about 1.1% in late-morning trading.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-2395407077572918435",
        "title": "Struggling DNA testing firm 23andMe to be bought for $256m",
        "url": "https://www.bbc.com/news/articles/c0ln0e5g6kgo",
        "site": "bbc.com",
        "time": 1747667483000,
        "favicon_url": "https://static.tickertick.com/website_icons/bbc.com.ico",
        "tags": [
            "regn"
        ],
        "description": "It said new buyers Regeneron had committed to protect user data as part of the deal.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-1882315536520344299",
        "title": "Pharma giant Regeneron to buy 23andMe and its customers’ data for $256M",
        "url": "https://techcrunch.com/2025/05/19/pharma-giant-regeneron-to-buy-23andme-and-its-customers-data-for-256m/",
        "site": "techcrunch.com",
        "time": 1747665359000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "regn"
        ],
        "description": "23andMe was sold by bankruptcy auction, a year after the company had a massive data breach.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "7788351835099999246",
        "title": "Regeneron Pharmaceuticals to buy 23andMe and its data for $256 million",
        "url": "https://www.cnbc.com/2025/05/19/regeneron-pharmaceuticals-to-buy-23andme-for-256-million-including-data.html",
        "site": "cnbc.com",
        "time": 1747664073000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "regn"
        ],
        "similar_stories": [
            "-212050463460367990",
            "8205838743152824725",
            "6150976619775831665",
            "-5116075715387206899",
            "-763084681151094237",
            "-843385046659429198",
            "8288301657762939249",
            "-6707223399230307377"
        ],
        "description": "Regeneron is acquiring \"substantially all\" of 23andMe's assets for $256 million following a bankruptcy auction.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "2181384876491589320",
        "title": "23andMe sold out of bankruptcy to Regeneron",
        "url": "https://www.ft.com/content/362bcad4-8f4a-42b4-ab86-38821d74352f",
        "site": "ft.com",
        "time": 1747662671000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Drugmaker’s takeover could raise privacy concerns among genetics start-up’s 15mn users",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "8297141020720721700",
        "title": "23andMe was once worth $6 billion. What's left of the DNA testing startup is being bought for $256 million.",
        "url": "https://www.businessinsider.com/23andme-bought-regeneron-chapter-11-bankruptcy-assets-anne-wojcicki-2025-5",
        "site": "businessinsider.com",
        "time": 1747662339000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "regn"
        ],
        "similar_stories": [
            "-2395407077572918435"
        ],
        "description": "Regeneron is buying the assets of DNA testing firm 23andMe.Justin Sullivan/Getty ImagesRegeneron Pharmaceuticals will acquire 23andMe's assets for $256 million, both companies said.23andMe filed for Chapter 11 bankruptcy earlier this year.The DNA testing company has faced major challenges including a data breach and mass lay-offs.The assets of failed DNA testing firm 23andMe are being bought for $256 million. Biotechnology firm Regeneron Pharmaceuticals said on Monday it would acquire 23andMe's personal genome service, total health, and research services business lines, and its biobank of customers' genetic samples. Regeneron said San Francisco-headquartered 23andMe would continue to offer all consumer genome services.\"We believe we can help 23andMe deliver and build upon its mission to help those interested in learning about their own DNA and how to improve their personal health, while furthering Regeneron's efforts to use large-scale genetics research to improve the way society treats and prevents illness overall,\" said George Yancopoulos, cofounder, chief scientific officer, and president of Regeneron, in a statement.Mark Jensen, chair of 23andMe's special committee of directors, said the deal \"maximizes the value of the business and enables the mission of 23andMe to live on, while maintaining critical protections around customer privacy, choice and consent with respect to their genetic data.\" Under the agreement, Regeneron must comply with the firm's privacy policies and applicable law regarding customers' personal data. The transaction is expected to close in the third quarter of this year.In March, 23andMe filed for Chapter 11 bankruptcy protection, with CEO and cofounder Anne Wojcicki stepping down immediately.The firm that offered a popular saliva sample service for analyzing ancestry and health risks went public in 2021 and was briefly valued at $6 billion.However, it never turned a profit and faced major challenges last year, including a $30 million settlement in a class-action suit following the data of some users becoming compromised, two failed attempts by Wojcicki to take the company private, and about 40% of employees being laid off to cut costs.23andMe said in a Securities and Exchange Commission filing in November it had debts of $2.3 billion, about $126 million in cash and cash equivalents, and would need additional liquidity.23andMe did not immediately respond to a request for comment.Read the original article on Business Insider Regeneron is buying the assets of DNA testing firm 23andMe.Justin Sullivan/Getty ImagesRegeneron Pharmaceuticals will acquire 23andMe's assets for $256 million, both companies said.23andMe filed for Chapter 11 bankruptcy earlier this year.The DNA testing company has faced major challenges including a data breach and mass lay-offs.The assets of failed DNA testing firm 23andMe are being bought for $256 million. Biotechnology firm Regeneron Pharmaceuticals said on Monday it would acquire 23andMe's personal genome service, total health, and research services business lines, and its biobank of customers' genetic samples. Regeneron said San Francisco-headquartered 23andMe would continue to offer all consumer genome services.\"We believe we can help 23andMe deliver and build upon its mission to help those interested in learning about their own DNA and how to improve their personal health, while furthering Regeneron's efforts to use large-scale genetics research to improve the way society treats and prevents illness overall,\" said George Yancopoulos, cofounder, chief scientific officer, and president of Regeneron, in a statement.Mark Jensen, chair of 23andMe's special committee of directors, said the deal \"maximizes the value of the business and enables the mission of 23andMe to live on, while maintaining critical protections around customer privacy, choice and consent with respect to their genetic data.\" Under the agreement, Regeneron must comply with the firm's privacy policies and applicable law regarding customers' personal data. The transaction is expected to close in the third quarter of this year.In March, 23andMe filed for Chapter 11 bankruptcy protection, with CEO and cofounder Anne Wojcicki stepping down immediately.The firm that offered a popular saliva sample service for analyzing ancestry and health risks went public in 2021 and was briefly valued at $6 billion.However, it never turned a profit and faced major challenges last year, including a $30 million settlement in a class-action suit following the data of some users becoming compromised, two failed attempts by Wojcicki to take the company private, and about 40% of employees being laid off to cut costs.23andMe said in a Securities and Exchange Commission filing in November it had debts of $2.3 billion, about $126 million in cash and cash equivalents, and would need additional liquidity.23andMe did not immediately respond to a request for comment.Read the original article on Business Insider",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-7359089748107913514",
        "title": "23andMe sells its most valuable asset. Regeneron promises keep your DNA private.",
        "url": "https://www.marketwatch.com/story/23andme-sells-its-most-valuable-asset-regeneron-promises-keep-your-dna-private-d8065fc7?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1747658400000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Regeneron said it will continue uninterrupted service of 23andMe’s consumer genome services — such as connecting with living relatives with shared DNA — after its purchase closes as expected in the third quarter of this year.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "9067582614065382553",
        "title": "23andMe Sells Gene-Testing Business to DNA Drug Maker Regeneron",
        "url": "https://www.bloomberg.com/news/articles/2025-05-19/23andme-sells-gene-testing-business-to-dna-drug-maker-regeneron",
        "site": "bloomberg.com",
        "time": 1747657694000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Bankrupt genetic-testing firm 23andMe agreed to sell its data bank, which once contained DNA samples from about 15 million people, to the drug developer Regeneron Pharmaceuticals for $256 million. A 23andMe DNA kit.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-2533080740281539798",
        "title": "Regeneron Pharmaceuticals says it will acquire all of 23andMe's assets, including its Personal Genome Service, for $256M in a bankruptcy auction, closing in Q3 (Dean Seal/Wall Street Journal)",
        "url": "http://www.techmeme.com/250519/p10#a250519p10",
        "site": "techmeme.com",
        "time": 1747655702000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Dean Seal / Wall Street Journal: Regeneron Pharmaceuticals says it will acquire all of 23andMe's assets, including its Personal Genome Service, for $256M in a bankruptcy auction, closing in Q3 — Regeneron Pharmaceuticals said it will acquire substantially all of 23andMe's assets — Regeneron Pharmaceuticals …",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-6707223399230307377",
        "title": "Regeneron to Buy 23andMe Out of Bankruptcy for $256 Million",
        "url": "https://www.wsj.com/tech/biotech/regeneron-to-buy-23andme-out-of-bankruptcy-for-256-million-a1f27eff?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1747655280000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-8939295721411345057",
        "title": "Regeneron to buy 23andMe for $256M in court-supervised sale | $REGN $MEHCQ",
        "url": "https://seekingalpha.com/news/4450002-regeneron-to-buy-23andme-for-256m-in-court-supervised-sale",
        "site": "seekingalpha.com",
        "time": 1747654346000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-8826103264499308372",
        "title": "Notable analyst calls this week: Caterpillar, UnitedHealth and Peloton among top picks | $CAT $UNH $REGN $FSLR $SMCI",
        "url": "https://seekingalpha.com/news/4449641-notable-analyst-calls-this-week-caterpillar-unitedhealth-and-peloton-among-top-picks",
        "site": "seekingalpha.com",
        "time": 1747488908000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "6217610790740193346",
        "title": "Regeneron wins over $400M jury award as Amgen found liable in antitrust case | $AMGN $REGN $SNY $SNYNF $GCVRZ",
        "url": "https://seekingalpha.com/news/4449512-regeneron-awarded-400m-jury-amgen-antitrust-case",
        "site": "seekingalpha.com",
        "time": 1747394182000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-6099488218909913175",
        "title": "Regeneron upgraded, AbbVie downgraded as Citi reviews policy risk | $REGN $ABBV",
        "url": "https://seekingalpha.com/news/4448129-regeneron-stock-upgraded-abbvie-downgraded-at-citi",
        "site": "seekingalpha.com",
        "time": 1747238530000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-4538327228486194815",
        "title": "Regeneron Pharmaceuticals declares $0.88 dividend | $REGN",
        "url": "https://seekingalpha.com/news/4440283-regeneron-pharmaceuticals-declares-0_88-dividend",
        "site": "seekingalpha.com",
        "time": 1746196483000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-810924296940433100",
        "title": "Regeneron ordered to face lawsuit alleging Medicare fraud over Eylea | $REGN",
        "url": "https://seekingalpha.com/news/4439203-regeneron-ordered-face-lawsuit-alleging-medicare-fraud-eylea",
        "site": "seekingalpha.com",
        "time": 1746115657000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-1590029202662936193",
        "title": "Regeneron projects pivotal data readouts for multiple programs in 2025 | $REGN",
        "url": "https://seekingalpha.com/news/4437120-regeneron-projects-pivotal-data-readouts-for-multiple-programs-in-2025",
        "site": "seekingalpha.com",
        "time": 1745944275000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "7670596277490695921",
        "title": "Regeneron drops as Eylea drives Q1 miss",
        "url": "https://seekingalpha.com/news/4436882-regeneron-stock-drops-eylea-drives-q1-miss",
        "site": "seekingalpha.com",
        "time": 1745931132000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-4487649218036543923",
        "title": "Regeneron Pharmaceuticals misses Q1 estimates | $REGN",
        "url": "https://seekingalpha.com/news/4436725-regeneron-pharmaceuticals-misses-q1-estimates",
        "site": "seekingalpha.com",
        "time": 1745922784000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "2231801847951755771",
        "title": "Regeneron Pharmaceuticals Q1 2025 Earnings Preview | $REGN",
        "url": "https://seekingalpha.com/news/4436436-regeneron-pharmaceuticals-q1-2025-earnings-preview",
        "site": "seekingalpha.com",
        "time": 1745864914000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-7756986690537864516",
        "title": "Regeneron gets EU nod for multiple myeloma treatment",
        "url": "https://seekingalpha.com/news/4436219-regeneron-gets-eu-nod-for-multiple-myeloma-treatment",
        "site": "seekingalpha.com",
        "time": 1745846761000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "3547404130625161451",
        "title": "FUJIFILM Diosynth Biotechnologies and Regeneron Sign 10-year, $3+ Billion U.S. Manufacturing Deal",
        "url": "https://www.genengnews.com/topics/bioprocessing/fujifilm-diosynth-biotechnologies-and-regeneron-sign-10-year-3-billion-u-s-manufacturing-deal/",
        "site": "genengnews.com",
        "time": 1745506831000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "regn"
        ],
        "similar_stories": [
            "-4144625574363210669"
        ],
        "description": "FUJIFILM Diosynth Biotechnologies, a subsidiary of FUJIFILM Corporation, is a CDMO for biologics, vaccines, and advanced therapies. With 30+ years of experience, the company specializes in developing and manufacturing biopharmaceuticals using microbial, mammalian, and host/virus systems. The post FUJIFILM Diosynth Biotechnologies and Regeneron Sign 10-year, $3+ Billion U.S. Manufacturing Deal appeared first on GEN - Genetic Engineering and Biotechnology News. FUJIFILM Diosynth Biotechnologies signed a 10-year manufacturing supply agreement, valued at over $3 billion, with Regeneron Pharmaceuticals to provide U.S.-based production of its biologic medicines. FUJIFILM will provide U.S.-based manufacturing for Regeneron over the 10-year period through current and planned expansions at its new large-scale biopharmaceutical manufacturing facility in Holly Springs, NC, when the site begins operations later this year. “FUJIFILM Diosynth Biotechnologies will be bringing additional capacity online in 2025, 2026, and beyond as it completes the current $7 billion of expansion projects underway in both Europe and the United States,” said Toshihisa Iida, director, corporate vp, general manager of life sciences strategy headquarters and Bio-CDMO division, FUJIFILM, Japan. “We are delighted to be selected as the manufacturing supply partner for Regeneron, utilizing our new facility in Holly Springs. The Holly Springs site is part of our kojoX interconnected manufacturing network, which provides a first-of-its-kind modular approach with standardized equipment, processes, and procedures across our sites around the globe to help ensure supply chain security and seamless tech transfers,” noted Lars Petersen, president and CEO, FUJIFILM Diosynth Biotechnologies. “We take our role seriously, and our decision to work with FUJIFILM Diosynth Biotechnologies reflects our belief that they will meet our high standards and grow with us,” added Daniel Van Plew, executive vp and general manager, industrial operations and product supply at Regeneron. “As the U.S. is the largest market for biopharmaceuticals, FUJIFILM has made significant investments in the U.S. of about $4 billion in building biopharmaceutical manufacturing sites, life sciences capabilities, and growing its technical talent. “Additionally, through our previously announced expansion efforts, we are pleased to share that we’ve already added 500 new positions as part of our overall goal of creating 1,400 new jobs in North Carolina by 2031.” The post FUJIFILM Diosynth Biotechnologies and Regeneron Sign 10-year, $3+ Billion U.S. Manufacturing Deal appeared first on GEN - Genetic Engineering and Biotechnology News.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-4144625574363210669",
        "title": "Regeneron inks $3B deal to boost U.S. manufacturing capacity",
        "url": "https://seekingalpha.com/news/4433097-regeneron-inks-3b-deal-to-boost-us-manufacturing-capacity",
        "site": "seekingalpha.com",
        "time": 1745317690000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "2710036850873863582",
        "title": "Regeneron Inks $3 Billion Fujifilm Deal to Bolster US Drugmaking",
        "url": "https://www.bloomberg.com/news/articles/2025-04-22/regeneron-inks-3-billion-fujifilm-deal-to-bolster-us-drugmaking",
        "site": "bloomberg.com",
        "time": 1745316000000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "regn"
        ],
        "description": "Regeneron Pharmaceuticals Inc. agreed to pay Fujifilm Diosynth Biotechnologies more than $3 billion over the next decade to help manufacture its medicines in the US, as the threat of tariffs looms over the nation’s drug supply. Regeneron is in the midst of a planned $3.6 billion expansion of its campus in Tarrytown, New York.",
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-8500011472880841027",
        "title": "Regeneron gets FDA acceptance to review expanded label for Eylea HD | $REGN $BAYZF",
        "url": "https://seekingalpha.com/news/4432107-regeneron-gets-fda-acceptance-to-review-expanded-label-for-eylea-hd",
        "site": "seekingalpha.com",
        "time": 1744895867000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-8041196626212211819",
        "title": "Regeneron falls after appeals court ruling in Eylea case",
        "url": "https://seekingalpha.com/news/4420782-regeneron-falls-after-appeals-court-ruling-in-eylea-case",
        "site": "seekingalpha.com",
        "time": 1741965462000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "-5109202135620247483",
        "title": "Ocular rises as Needham issues new Buy on lead candidate | $OCUL $REGN $BAYRY $BAYZF",
        "url": "https://seekingalpha.com/news/4419413-ocular-rises-needham-issues-newbuy",
        "site": "seekingalpha.com",
        "time": 1741705193000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "regn"
        ],
        "tickers": [
            "regn"
        ]
    },
    {
        "id": "2791607881507160274",
        "title": "Levi & Korsinsky Notifies Regeneron Pharmaceuticals, Inc. Investors of a Class Action Lawsuit and Upcoming Deadline - REGN",
        "url": "https://markets.businessinsider.com/news/stocks/levi-korsinsky-notifies-regeneron-pharmaceuticals-inc-investors-of-a-class-action-lawsuit-and-upcoming-deadline---regn-1034450421",
        "site": "businessinsider.com",
        "time": 1741288500000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "regn"
        ],
        "description": "NEW YORK, NY / ACCESS Newswire / March 6, 2025 / If you suffered a loss on your Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN) investment and want to learn about a potential recovery under the federal securities laws, follow the link below for more information:",
        "tickers": [
            "regn"
        ]
    }
]