[
    {
        "id": "-5770459570037692713",
        "title": "Estee Lauder, L’Oreal Suffer as China’s Duty-Free Spending Falls",
        "url": "https://www.bloomberg.com/news/articles/2025-05-21/estee-lauder-l-oreal-suffer-as-china-s-duty-free-spending-falls",
        "site": "bloomberg.com",
        "time": 1747866600000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "el"
        ],
        "description": "Unable to travel overseas during the Covid-19 pandemic, Chinese consumers sparked a shopping boom in the southernmost province of Hainan, lured by the tropical island’s plethora of duty-free shopping malls. Customers shop at Haikou International Duty Free City in Hainan Province in Dec. 2024. Photographer: Guo Cheng/Xinhua/Getty Images",
        "tickers": [
            "el"
        ]
    },
    {
        "id": "755179059294088944",
        "title": "Stock Movers: Nvidia, Estee Lauder, Charter (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-16/stock-movers-nvidia-estee-lauder-charter-podcast",
        "site": "bloomberg.com",
        "time": 1747408572000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "el"
        ],
        "description": "Source: Bloomberg, 3:44 Estee Lauder Cos Inc/The Photographer: SeongJoon Cho/Bloomberg",
        "tickers": [
            "el"
        ]
    },
    {
        "id": "5324734925008574400",
        "title": "Estee Lauder declares $0.35 dividend",
        "url": "https://seekingalpha.com/news/4439010-estee-lauder-declares-0_35-dividend",
        "site": "seekingalpha.com",
        "time": 1746105844000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "el"
        ],
        "tickers": [
            "el"
        ]
    },
    {
        "id": "6408328315515072518",
        "title": "Estee Lauder to lay off up to 7,000 — more than it initially planned",
        "url": "https://www.marketwatch.com/story/estee-lauder-to-lay-off-up-to-7-000-more-than-it-initially-planned-1ace15e0?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1746103500000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "el"
        ],
        "description": "Estee Lauder said it would adopt a “more competitive approach” to its procurement by consolidating its spending and re-evaluating its suppliers.",
        "tickers": [
            "el"
        ]
    },
    {
        "id": "-6562126686600630743",
        "title": "Estée Lauder Forecasts Return to Sales Growth in 2026",
        "url": "https://www.bloomberg.com/news/articles/2025-05-01/estee-lauder-el-forecasts-return-to-sales-growth-in-2026",
        "site": "bloomberg.com",
        "time": 1746094632000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "el"
        ],
        "description": "Estée Lauder Cos. said it expects to return to sales growth next year despite a sharp revenue decline at the cosmetics maker. Estee Lauder store in New York.",
        "tickers": [
            "el"
        ]
    },
    {
        "id": "-2826423709816415419",
        "title": "Estee Lauder Non-GAAP EPS of $0.65 beats by $0.34, revenue of $3.55B beats by $30M",
        "url": "https://seekingalpha.com/news/4438767-estee-lauder-non-gaap-eps-of-0_65-beats-by-0_34-revenue-of-3_55b-beats-by-30m",
        "site": "seekingalpha.com",
        "time": 1746093948000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "el"
        ],
        "tickers": [
            "el"
        ]
    },
    {
        "id": "1981910019849656289",
        "title": "Clinique's Black Honey made me stop hating lipstick, and now it's on sale",
        "url": "https://www.businessinsider.com/guides/deals/clinique-black-honey-amazon-deal-2025",
        "site": "businessinsider.com",
        "time": 1745957760000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "el"
        ],
        "description": "I struggle to find lip products I like, but Clinique Black Honey lipstick is one of my favorites. Get it 15% off for the Amazon 2025 Beauty Event. When you buy through our links, Business Insider may earn an affiliate commission. Learn moreThe Clinique's viral Almost Lipstick in Black Honey is on sale for the Amazon Summer Beauty Event.Jennifer Gonick/Business InsiderLipstick and I have a complicated relationship. As much as I love adding a pop of color to my makeup routine, finding lip products that aren't too harsh against my pale skin and cool undertones has proven challenging. Finding ones that nourish and hydrate my lips throughout the day instead of drying them out is even harder. But my prayers were answered when I finally gave the viral Clinique Black Honey Almost Lipstick a try after getting a free sample. Years later, it's still one of the only pigmented lip products I reach for. If you've been wondering if Black Honey is truly worth the hype, get it now at 15% off during the Amazon Summer Beauty Event.Follow our WhatsApp channel on mobile for more shopping content from the Reviews TeamBlack Honey's main claim to fame is its versatility. The shade is designed to look a little different on everyone and complement virtually any skin tone. Not fully believing this at first, I was convinced that the color would look too dark and wash me out. But I was pleasantly surprised to be proven wrong. The shade blended perfectly with my natural lip color to create the perfect subtle-but-polished look I'm always after.As amazing as the shade itself is, the formula is what really makes it shine. Unlike typical satin-finish lipsticks that can be drying, this one goes on like a semi-glossy lip balm to keep my lips hydrated for hours. The sheer formula is also buildable, giving me more control over how pigmented I want the final look to be. A few swipes are perfect for a subtle flush during the day, but I can also layer more on top for a bolder color at night. Black Honey looks great on its own, but it can also be combined with a lip liner or gloss on top for more definition.AmazonWith over 7,000 five-star reviews, Amazon shoppers love Black Honey as much as I do. \"What's not to like about this great balm? It's a universally flattering color. It goes on super smooth and feels great on your lips,\" said one reviewer. \"It just looks lovely on. I receive a lot of compliments when I wear it. It's a keeper!\"Some shoppers even used it as a blush, an idea I'll have to try out myself. \"This is the perfect lip and cheek tint. It lasts for a long time and all day as a blush,\" said another reviewer. \"It's smooth and helps my chapped lips, and the color is incredible and natural looking. It's a deeper color than my natural lips, but it's perfect. This is my everyday color, and it's buildable enough to be a deep color for special occasions. I wish I had this color for my wedding.\"With the current Summer Beauty Event discount on Amazon, Clinique Black Honey is 15% off. Add it to your cart now for just $21 while the deal lasts and check out our full roundup of the best deals from the Amazon Summer Beauty Event.More trending Amazon Summer Beauty Event dealsLaneige Lip Glowy Balm, $19 $15.20Aveeno Calm + Restore Nourishing Oat Cleanser, $14.69 $9.97L'Oreal Paris True Match Lumi Glotion, $16.99 $13.98Hero Cosmetics Mighty Patch Original Pimple Patches, $12.99 $11.69Pacifica Beauty Sea + C Love Vitamin Serum, $16 $12.10Still shopping? Browse through the full Amazon Summer Beauty Event for more deals.Read the original article on Business Insider",
        "tickers": [
            "el"
        ]
    },
    {
        "id": "6029415333148361224",
        "title": "We Tried to Find a Perfect Dupe for the Black Honey Almost Lipstick. We Couldn’t.",
        "url": "https://www.nytimes.com/wirecutter/reviews/clinique-almost-lipstick-review/?utm_source=rss&utm_medium=feed&utm_campaign=RSS%20Feed",
        "site": "nytimes.com",
        "time": 1745251107000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "el"
        ],
        "description": "In 1971, a shift was stirring in the world of beauty. Carol Phillips, co-founder of Clinique and a former Vogue beauty editor, noticed a growing desire among makeup lovers toward gloss and gleam—a departure from the reigning matte, opaque lipsticks of the era. Sensing the moment, Phillips and her Clinique co-founder, dermatologist Norman Orentreich, introduced… In 1971, a shift was stirring in the world of beauty. Carol Phillips, co-founder of Clinique and a former Vogue beauty editor, noticed a growing desire among makeup lovers toward gloss and gleam—a departure from the reigning matte, opaque lipsticks of the era.Sensing the moment, Phillips and her Clinique co-founder, dermatologist Norman Orentreich, introduced a line called The Honeys—tiny pots of luscious, glistening lip color, the Clinique team told me. Among them was a shade called Black Honey. They couldn’t have known it then, but that single hue would endure, cherished by generations for over 50 years and counting.In recent years, younger generations have rediscovered Black Honey, with teens and young adults eagerly posting about their newfound obsession. What was once a legacy makeup shade is now thriving in the digital age, and its appeal continues to spread.Clinique’s 2023 data revealed that every minute, seven Black Honey Almost Lipsticks (the modern take on The Honeys) were sold worldwide. That same year, Circana, a consumer-insights research company, reported it was the number-one lip color shade in the US. The revival of this classic shows no signs of slowing. But the original is also $25, which is on the expensive side for lipsticks, especially compared with what you can find at the drugstore. So it’s no surprise that today’s beauty enthusiasts have taken to the internet to share their favorite “dupes.”As a beauty journalist, I’ve seen supposed dupes fall short time and again, especially for consumers loyal to an original. Given Black Honey’s cult status in a market flooded with gooey lip products, I wondered whether a true dupe existed, or if influencers were simply pushing any decent, low-priced lip balm with a similar hue. The beauty industry has come a long way since 1971, so surely someone has cracked the code by now, I thought.With a few fellow Wirecutter staffers, I plunged into the internet’s Black Honey dupe rabbit hole, testing everything from the wildly off-target to the surprisingly convincing.",
        "tickers": [
            "el"
        ]
    },
    {
        "id": "2884070775354492112",
        "title": "At Tom Ford, the Power of a Perfect Suit",
        "url": "https://www.nytimes.com/2025/03/06/style/tom-ford-suits-haider-ackermann-paris-fashion-week.html",
        "site": "nytimes.com",
        "time": 1741282033000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "el"
        ],
        "description": "The latest Tom Ford collection makes a strong case for them.",
        "tickers": [
            "el"
        ]
    },
    {
        "id": "3071684793973115275",
        "title": "Designer Debuts at Tom Ford and Dries Van Noten",
        "url": "https://www.nytimes.com/2025/03/06/style/tom-ford-haider-ackermann-dries-van-noten.html",
        "site": "nytimes.com",
        "time": 1741250686000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "el"
        ],
        "description": "Assessing the debuts of Haider Ackermann at Tom Ford and Julian Klausner at Dries Van Noten. Tom Ford, fall 2025",
        "tickers": [
            "el"
        ]
    }
]