[
    {
        "id": "-2758127207196532583",
        "title": "Mastercard and Thailand’s NITMX Team to Promote Real-Time Payments",
        "url": "https://www.pymnts.com/partnerships/2025/mastercard-and-thailands-nitmx-team-to-promote-real-time-payments/",
        "site": "pymnts.com",
        "time": 1750181883000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard says it is expanding its relationship with National ITMX (NITMX), the Thailand-based developer and service provider of electronic payments. [contact-form-7] This effort, the company announced Tuesday (June 17), will power PromptPay, the most widely used real-time payments (RTP) platform in Southeast Asia, to fuel the Thai digital economy. “The Thai digital payments ecosystem continues […] The post Mastercard and Thailand’s NITMX Team to Promote Real-Time Payments appeared first on PYMNTS.com. Mastercard says it is expanding its relationship with National ITMX (NITMX), the Thailand-based developer and service provider of electronic payments. [contact-form-7] This effort, the company announced Tuesday (June 17), will power PromptPay, the most widely used real-time payments (RTP) platform in Southeast Asia, to fuel the Thai digital economy. “The Thai digital payments ecosystem continues to grow, driven by the widespread adoption of PromptPay,” Mastercard said in a news release. Launched more than eight years ago, PromptPay has seen a surge in usage, the company said, with more than 81 million registrants as of the end of March of this year. “In that month alone, 2.1 billion transactions with a total value of more than 4.43 trillion baht were recorded on PromptPay, a 13% increase year-on-year,” the release added. “This reflects the country’s improving financial inclusion and widespread adoption of PromptPay as a ubiquitous payment method for everyday transactions among individuals.” Mastercard and NITMX have signed a new, multi-year, deal which will focus on signing up more consumers and businesses in Thailand. PromptPay, the release added, lets merchants display a QR code and receive payments directly to their bank accounts, lessening their dependence on cash or the need to visit a bank or invest in payment terminals. This allows “even the smallest of merchants, including mobile vendors, food stall owners and tuk tuk riders, to go cashless and accept digital payments — connecting small business owners to the digital financial ecosystem and bringing more opportunities to them,” the release said. PYMNTS examined the importance of instant payments in a report last week, noting that instant methods had evolved into a “vital strategic tool” for businesses that have a large share of ad hoc payments that need to be sent urgently. “Enterprises with a high need for urgent ad hoc payments are significantly more inclined to adopt instant payment methods,” that report said. In fact, research from PYMNTS Intelligence and Ingo Payments, in the report “Instant Payments: A Strategic Tool for Vendor Relationships and Urgent Transactions,” shows that businesses with elevated urgent payment needs were five times more likely to employ instant payments to uphold strong vendor relationships. “This necessity extends beyond mere operational efficiency; it is deeply rooted in the business need to avert disruptions, guarantee timely service or delivery, and, crucially, strengthen and safeguard positive vendor relationships,” PYMNTS wrote. The post Mastercard and Thailand’s NITMX Team to Promote Real-Time Payments appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5103228521605484026",
        "title": "Visa, Mastercard Tumble as Merchants Eye Stablecoins",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/visa-mastercard-tumble-as-merchants-eye-stablecoins",
        "site": "bloomberg.com",
        "time": 1749845360000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Visa Inc. and Mastercard Inc. fell, with Visa slipping as much as 7.1% and Mastercard dropping as much as 6.2%. Both declines were the biggest for the shares of companies since April. Meanwhile, Amazon.com Inc. and Walmart Inc. are among large multinational companies which have recently discussed issuing their own stablecoins in the US, the Wall Street Journal reported, citing unidentified people. Bloomberg's Michael Regan has more on the story. (Source: Bloomberg)",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-9031338486653252570",
        "title": "Visa, Mastercard Tumble as Merchants Eye Stablecoins | Bloomberg Markets 6/13/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/bloomberg-markets-6-13-2025-video",
        "site": "bloomberg.com",
        "time": 1749845352000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. Today's guests; Middle East Institute Vice President For Policy Kenneth Pollack, Bloomberg's Mishal Husain, and David Welch. (Source: Bloomberg)",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5547004919370367094",
        "title": "A $60 Billion Visa, Mastercard Slump Seen as Buying Opportunity",
        "url": "https://www.bloomberg.com/news/articles/2025-06-13/a-60-billion-visa-mastercard-slump-seen-as-buying-opportunity",
        "site": "bloomberg.com",
        "time": 1749840534000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "A report that large multinational merchants are exploring ways to bypass traditional credit-card fees presents investors with an opportunity to buy shares of Mastercard Inc. and Visa Inc., according to Wall Street analysts.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2334480904329112775",
        "title": "Visa and Mastercard shares slide on stablecoin fears — but is the selloff too harsh?",
        "url": "https://www.marketwatch.com/story/visa-and-mastercard-shares-slide-on-stablecoin-fears-but-is-the-selloff-too-harsh-1735979a?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1749832740000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Walmart and other retailers reportedly are exploring stablecoin ventures, but some analysts are doubtful these will take off with shoppers.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "6946464783854818704",
        "title": "Visa, Mastercard stocks slide after stablecoin report",
        "url": "https://seekingalpha.com/news/4458073-visa-mastercard-stocks-slide-after-stablecoin-report",
        "site": "seekingalpha.com",
        "time": 1749828583000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-3694633959899827349",
        "title": "Citizens Financial rolls out new suite of Mastercard credit cards",
        "url": "https://seekingalpha.com/news/4457668-citizens-financial-rolls-out-new-suite-of-mastercard-credit-cards",
        "site": "seekingalpha.com",
        "time": 1749737100000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "5376573796796351824",
        "title": "Mastercard and PayPal Partner to Develop Features Using Credential Solution",
        "url": "https://www.pymnts.com/partnerships/2025/mastercard-and-paypal-partner-to-develop-features-using-credential-solution/",
        "site": "pymnts.com",
        "time": 1749051445000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard and PayPal have partnered to co-develop features using Mastercard’s One Credential, a solution that enables consumers to use a single credential when shopping online or in-store. [contact-form-7] The companies aim to use this solution to give consumers more choice and control over how they pay at checkout, allowing them to access multiple payment options, they said in […] The post Mastercard and PayPal Partner to Develop Features Using Credential Solution appeared first on PYMNTS.com. Mastercard and PayPal have partnered to co-develop features using Mastercard’s One Credential, a solution that enables consumers to use a single credential when shopping online or in-store. [contact-form-7] The companies aim to use this solution to give consumers more choice and control over how they pay at checkout, allowing them to access multiple payment options, they said in a Wednesday (June 4) press release. One Credential can also help PayPal users improve their creditworthiness and progress from debit to installments and other structured credit, according to the release. “We both want to reduce friction for consumers and bring them more power over how they pay,” Chris Sweetland, senior vice president of partnerships at PayPal, said in the release. Bunita Sawhney, chief consumer product officer at Mastercard, said in the release that the partnership with PayPal will build on “our collective strength of global payments innovation.” “With One Credential, we’re delivering the personalized digital experiences that build consumer confidence and trust,” Sawhney said in the release. Mastercard announced its creation of One Credential in February, saying this digitally connected credential will allow consumers to choose to pay with debit, installments, prepaid or credit. Users can set their preferences online or in an app. They can also set preferences based on transaction type and time. For example, users can specify their checking account for expenses under $100, their credit card for expenses over $100 and installments for occasional larger purchases. “Today’s consumers expect to be in the driver’s seat,” Mastercard Chief Product Officer Jorn Lambert said in a February press release. “That’s what sparked One Credential. It gives people an innovative way to pay that’s truly personalized to them.” Mastercard is now rolling out One Credential as a network-level capability worldwide, according to the Wednesday press release. Consumers are demanding a broader range of payments and financial solutions from their primary banking relationships, Sawhney told PYMNTS in an interview posted in February. Most consumers “have a high desire to have tools that help them become strong and confident money managers,” Sawhney said. Key to that goal is having visibility and transparency into, and control over, cash flows. The post Mastercard and PayPal Partner to Develop Features Using Credential Solution appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "88105427757421413",
        "title": "Mastercard and PayPal team up on Mastercard One Credential to enhance checkout flexibility",
        "url": "https://seekingalpha.com/news/4455289-mastercard-and-paypal-team-up-on-mastercard-one-credential-to-enhance-checkout-flexibility",
        "site": "seekingalpha.com",
        "time": 1749027065000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-8177209330069906109",
        "title": "Mastercard: Tokenization in Europe Nears 50%",
        "url": "https://www.pymnts.com/mastercard/2025/mastercard-tokenization-in-europe-nears-50percent/",
        "site": "pymnts.com",
        "time": 1748994735000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "When a shopper whips out their credit card to buy something online, they can feel a lingering worry: Will my card number get stolen by hackers or otherwise misused? That’s why tokenization, a process that hides your 16-digit number from a merchant and instead uses a separate computer-generated number saved on your mobile phone or […] The post Mastercard: Tokenization in Europe Nears 50% appeared first on PYMNTS.com. When a shopper whips out their credit card to buy something online, they can feel a lingering worry: Will my card number get stolen by hackers or otherwise misused? That’s why tokenization, a process that hides your 16-digit number from a merchant and instead uses a separate computer-generated number saved on your mobile phone or smartwatch or stored with a retailer, is the next frontier of ensuring security when paying. Mastercard said Tuesday (June 3) that nearly half of all its online transactions in Europe are now tokenized. The payment giant unveiled the milestone exactly one year after outlining its plan to phase out manual card entry and achieve 100% tokenization by 2030. The process lets consumers avoid exposing their sensitive account details, preventing a fraudster from using your credit card for nefarious purposes. Mastercard said that tokenized transactions in Europe, encompassing methods like Secure Card on File (SCOF), Click to Pay and digital wallets, have seen a one-third increase in the past year. The company’s strategy of driving the adoption of safer transactions is gaining ground as growing numbers of eCommerce marketplaces, food delivery services and financial institutions across the continent embrace new standards and solutions. A major component of this growth is merchant tokenization, specifically known as Secure Card on File (SCOF). By replacing static card numbers stored by merchants with dynamic, merchant-specific tokens, SCOF helps to reduce fraud and improve approval rates. The result: Enhanced security for shoppers and fewer fraud-related losses for businesses. Another tokenization method, Click to Pay, is also playing a crucial role in simplifying the online checkout experience. This service, now used in 26 European markets, allows consumers to make purchases online without manually entering their card details each time, often using pre-saved, tokenized credentials. Mastercard said that consumer signups for Click to Pay have more than doubled over the past year. In other tokenization news, FinTech platform Adyen launched a collaboration with Japanese payment brand/credit card issuer JCB, PYMNTS reported in May. This service aims to bolster the security of credit card transactions for eCommerce merchants. “eCommerce transactions are growing rapidly, and alongside this growth, fraudulent transactions due to card information breaches are also increasing,” said Tac Watanabe, executive officer and head of brand infrastructure headquarters at JCB. “In response to this trend, it is important to reduce the risk associated with data breaches through COF tokenization and improve our customers’ payment experience by keeping card information up to date.” The post Mastercard: Tokenization in Europe Nears 50% appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "1523066035673054214",
        "title": "Credit Card Swipe Fee Fight Complicates Stablecoin Bill Passage",
        "url": "https://www.bloomberg.com/news/articles/2025-06-03/credit-card-swipe-fee-fight-complicates-stablecoin-bill-passage",
        "site": "bloomberg.com",
        "time": 1748986200000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "An effort by retailers and their allies in the Senate to mandate competition to Visa Inc. and Mastercard Inc. in credit card processing has complicated efforts to swiftly pass the stablecoin bill supported by the crypto industry and President Donald Trump. Visa Inc. and Mastercard Inc. credit cards are arranged for a photograph in Tiskilwa, Illinois, U.S., on Tuesday, Sept. 18, 2018. Visa and Mastercard agreed to pay as much as $6.2 billion to end a long-running price-fixing case brought by merchants over card fees, the largest-ever class action settlement of an antitrust case.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-8209718800844387084",
        "title": "Deutsche Bank and Mastercard Partner on Pay-by-Bank Solutions in Europe",
        "url": "https://www.pymnts.com/partnerships/2025/deutsche-bank-mastercard-partner-pay-by-bank-solutions-europe/",
        "site": "pymnts.com",
        "time": 1748968631000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "5376573796796351824",
            "88105427757421413"
        ],
        "description": "Deutsche Bank and Mastercard partnered to enable merchants across Europe to offer pay-by-bank functionality to their customers. The partnership will enable merchants to offer this functionality through Deutsche Bank’s Merchant Solutions, with the account-to-account payments based on Mastercard’s open banking network, the companies said in a Tuesday (June 3) press release. “This partnership with Mastercard […] The post Deutsche Bank and Mastercard Partner on Pay-by-Bank Solutions in Europe appeared first on PYMNTS.com. Deutsche Bank and Mastercard partnered to enable merchants across Europe to offer pay-by-bank functionality to their customers. The partnership will enable merchants to offer this functionality through Deutsche Bank’s Merchant Solutions, with the account-to-account payments based on Mastercard’s open banking network, the companies said in a Tuesday (June 3) press release. “This partnership with Mastercard marks a pivotal moment in the growth of open banking,” Deutsche Bank Global Head of Merchant Solutions Kilian Thalhammer said in the release. “Together, we are delivering innovative merchant solutions that reflect the needs of a digital-first economy — secure, instant and built for scale.” The integration of Mastercard’s open banking technology into Deutsche Bank’s platform will support faster settlement, enhanced reconciliation and greater payment transparency, according to the release. It will enable merchants to use the bank’s Request to Pay (R2P) service as a preferred method, allowing consumers to authorize payments directly from their bank accounts and receive immediate confirmation, per the release. “With the further expansion of our partnership, we combine our open banking payments technology with Deutsche Bank’s payments expertise and big merchant base across Europe, and together we’re shaping a future where account-based payments are becoming the new norm,” Valerie Nowak, executive vice president and head of Open Banking Mastercard Open Banking Europe, said in the release. Open banking powered 27 million payments in the United Kingdom during March, according to Open Banking Limited. “Open banking has already transformed the payments landscape in the past seven years, with uptake of account-to-account payments showing strong growth,” the group said in a May 2 press release. In the United States, 46% of consumers said they would be highly willing to use open banking payments, although only 11% have actually done so, according to the PYMNTS Intelligence report “Consumer Sentiment About Open Banking Payments.” The report found that millennials are especially interested in the payment method, with 66% of these consumers saying they would be highly willing to use open banking payments. Mastercard said in October that 76% of its customers connect their financial accounts, and 93% said having control over how their financial data is used is of “paramount importance.” The post Deutsche Bank and Mastercard Partner on Pay-by-Bank Solutions in Europe appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-6539255547074500684",
        "title": "Needing Dollars, Iran-Backed Militias Turn to Visa and Mastercard",
        "url": "https://www.wsj.com/world/middle-east/iran-visa-mastercard-dollars-sanctions-militias-0ecea0b9?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1748739600000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "2965163068694957304",
        "title": "Mastercard Launches Financial and Cybersecurity Tools for Small Businesses",
        "url": "https://www.pymnts.com/mastercard/2025/mastercard-launches-financial-and-cybersecurity-tools-for-small-businesses/",
        "site": "pymnts.com",
        "time": 1748559331000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard has launched a suite of digital tools, data and educational resources designed for small- to medium-sized businesses (SMBs) in the U.S. The company’s Small Business Navigator program offers small businesses “real, actionable support,” Ginger Siegel, head of small business in the U.S. at Mastercard, said in a Thursday (May 29) press release. “With Small Business Navigator, we’re delivering […] The post Mastercard Launches Financial and Cybersecurity Tools for Small Businesses appeared first on PYMNTS.com. Mastercard has launched a suite of digital tools, data and educational resources designed for small- to medium-sized businesses (SMBs) in the U.S. The company’s Small Business Navigator program offers small businesses “real, actionable support,” Ginger Siegel, head of small business in the U.S. at Mastercard, said in a Thursday (May 29) press release. “With Small Business Navigator, we’re delivering a powerful combination of insights, protection and financial tools that help business owners build toward long-term success,” Siegel said. The program includes an artificial intelligence-powered chatbot that “acts as a mentor” for business owners; actionable insights and data from the Mastercard Economic Institute and the Mastercard SpendingPulse report; and educational content covering cybersecurity, marketing and digital tools, according to the release. To help with cybersecurity, Small Business Navigator offers access to My Cyber Risk powered by RiskRecon, which guides small businesses in strengthening their defenses, and personalized recommendations based on their Cybersecurity Assessment Quiz results, the release said. The program also offers access to financial planning and cost management support through Biz2Credit’s Virtual CFO services as well as the opportunity to be featured on Mastercard’s social media channels, per the release. “The launch of Mastercard Small Business Navigator reinforces Mastercard’s leadership in delivering tangible, trusted solutions that go beyond payments, supporting small businesses at every stage of their journey,” the release said. This new program is the latest offering introduced by Mastercard to help small businesses. The company said in February that it launched credit and debit cards designed for creators and small business owners. These Business Builder cards feature Mastercard’s core small business benefits like Easy Savings, ID Theft Protection, Zero Liability and access to Digital Doors. In November, Mastercard launched the first of several immersive shopping experiences that it plans to roll out across North America this year and beyond. The first one, which was held in Fort Langley, British Columbia, Canada, included a storybook created by Mastercard that tied to the storefront displays and in-store art installations of local stores. During the same month, the company introduced a platform called Mastercard Biz360 that is designed to help financial and service providers offer their small business customers a way to consolidate the digital tools they use to run and grow their businesses. The post Mastercard Launches Financial and Cybersecurity Tools for Small Businesses appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-8091661118867858912",
        "title": "How creator marketing has become key to Mastercard’s culture-hacking strategy",
        "url": "https://digiday.com/marketing/how-creator-marketing-has-become-key-to-mastercards-culture-hacking-strategy/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
        "site": "digiday.com",
        "time": 1748404860000,
        "favicon_url": "https://static.tickertick.com/website_icons/digiday.com.ico",
        "tags": [
            "ma"
        ],
        "description": "MasterCard CMO Raja Rajamannar explains the brand's creator marketing approach — and why influencer activity could eclipse TV. Fine dining and globe-trotting travel have been displacing mere objects as consumer status symbols ever since Instagram first arrived on the app store way back in 2010. It’s a shift that brand marketers have long sought to connect with. Few have been as persistent as Mastercard, though. The payments brand first began marketing around “experiences” almost 10 years back, according to CMO Raja Rajamannar; it first unveiled its “Priceless.com” loyalty platform in 2016. A recent survey by research firm Dynata of 15,000 European consumers appears to validate that strategy. Despite the hairy economic circumstances facing shoppers across the continent, 70% said they wouldn’t hold back from spending on experiences like eating out or tourism.Continue reading this article on digiday.com. Sign up for Digiday newsletters to get the latest on media, marketing and the future of TV.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "3040846762285596475",
        "title": "Mastercard Helps Bahrain’s ila Bank Launch Loyalty Program",
        "url": "https://www.pymnts.com/news/banking/2025/mastercard-helps-bahrains-ila-bank-launch-loyalty-program/",
        "site": "pymnts.com",
        "time": 1748376214000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard has teamed with Bahrain-based ila Bank to help it introduce loyalty programs. The partnership, announced Tuesday (May 27), is centered around things like dining, travel and luxury shopping, while also employing enhanced fraud solutions and privacy protection. “ila has always been about the customer,” Mohamed Almaraj, the bank’s CEO, said in a news release. “We are proud […] The post Mastercard Helps Bahrain’s ila Bank Launch Loyalty Program appeared first on PYMNTS.com. Mastercard has teamed with Bahrain-based ila Bank to help it introduce loyalty programs. The partnership, announced Tuesday (May 27), is centered around things like dining, travel and luxury shopping, while also employing enhanced fraud solutions and privacy protection. “ila has always been about the customer,” Mohamed Almaraj, the bank’s CEO, said in a news release. “We are proud to have maintained our commitment to offering customer-centric solutions and experiences in a growingly cashless economy, and this strategic agreement furthers the ila promise of ‘banking that reflects you.’” According to the release, this effort is the latest in a series of collaborations between Mastercard and the digital, mobile-only ila, along with a multi-currency debit program, a “Pay with Rewards” loyalty program and the Mastercard airline co-brand with Gulf Air in Bahrain. Forthcoming research by PYMNTS Intelligence has shown that most Americans have cards with basic perks such as cash back or points, or popular co-branded cards tied to retailers, airlines or hotels. Close to 60% of cardholders own an entry-level card with basic rewards, while more than four in 10 have a co-branded card. “Nearly half of credit cardholders use their entry-level rewards card as their primary payment method,” PYMNTS wrote recently. “Cards without rewards? They’re the primary choice for fewer than 9% of cardholders and are rarely or never used by 15% of their owners. And those cards only usable at a single store? A mere 4.5% of owners whip them out at the register. The message is clear: If there aren’t rewards, the card is likely gathering dust in your pocketbook.” While only about one in five cardholders own a premium card with an annual fee of over $100, these consumers are incredibly engaged. Upwards of half make their premium card their primary payment method. And just a small 3.9% say that they rarely or never use them. Premium cardholders are the most loyal shoppers, paying a high fee, determined to get their money’s worth and using the cards frequently to maximize benefits. Think of a luxury credit card as the butler in your wallet. “Card-linked offers are also a big deal, especially for those premium cardholders,” the report added. “Owners of cards with annual fees over $100 were more than twice as likely to take advantage of their card’s special offers compared to those with no-fee cards.” Meanwhile, a surprising 74% of premium cardholders used at least one offer in the last year, compared to just 32% for no-fee card owners. “Present the right offer to a premium cardholder, and there’s a good chance they’ll take it,” PYMNTS wrote. The post Mastercard Helps Bahrain’s ila Bank Launch Loyalty Program appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-4893382905493211284",
        "title": "Report: European Commission Looking Into Visa and Mastercard Fees",
        "url": "https://www.pymnts.com/news/regulation/2025/report-european-commission-looking-into-visa-and-mastercard-fees/",
        "site": "pymnts.com",
        "time": 1748023126000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "The European Commission is reportedly looking into fees charged by Visa and Mastercard in a move that could lead to a formal probe. The competition regulator sent requests for information to market participants last week, asking about fees they impose on financial institutions that provide services to retailers using the Visa and Mastercard networks, Bloomberg […] The post Report: European Commission Looking Into Visa and Mastercard Fees appeared first on PYMNTS.com. The European Commission is reportedly looking into fees charged by Visa and Mastercard in a move that could lead to a formal probe. The competition regulator sent requests for information to market participants last week, asking about fees they impose on financial institutions that provide services to retailers using the Visa and Mastercard networks, Bloomberg reported Friday (May 23), citing unnamed sources. The questions focus on whether retailers have a choice in accepting Visa and Mastercard payments, whether merchants get value from the fees that are passed on to them, and whether the charges are transparent, according to the report. The commission told Bloomberg that “the investigation is ongoing,” without providing specifics. Visa said in the report that its fees “reflect the immense value that we provide to financial institutions, merchants and consumers in Europe,” including security and reliability. Mastercard told Bloomberg that it “offers consumers and businesses choice, ways to pay and be paid that are hassle-free and worry-free, secure and most convenient for them.” It was reported May 14 that a group of trade associations representing European retailers asked the European Commission to take action against Visa and Mastercard under EU antitrust laws, alleging that the companies charge high fees and don’t provide transparency on those fees. The letter also called for price controls on interchange fees, transparency and non-discriminatory obligations for international card schemes (ICSs), and a tool for regulators to scrutinize ICSs’ actions, according to the report. “International Card Schemes (ICS) have been able to increase their fees without competitive challenge or regulatory scrutiny,” the letter said, per the report. “They have also rendered their system of fees and rules so complex and opaque that players are unable to understand, let alone challenge, what they are paying for and why.” Mastercard was hit with a $648.3 million fine by the EU in 2019, with the EU alleging that the payments company raised the costs of card payments artificially. It was reported at the time that the fine was part of an effort on the part of European regulators to stamp out fees that U.S. credit card companies charge. The post Report: European Commission Looking Into Visa and Mastercard Fees appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "1868679853961787989",
        "title": "Visa, Mastercard Fees Hit by New Round of EU Antitrust Scrutiny",
        "url": "https://www.bloomberg.com/news/articles/2025-05-23/visa-mastercard-fees-hit-by-new-round-of-eu-antitrust-scrutiny",
        "site": "bloomberg.com",
        "time": 1748007389000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "-5103228521605484026",
            "-9031338486653252570",
            "-2334480904329112775",
            "6946464783854818704",
            "-4893382905493211284"
        ],
        "description": "Visa Inc. and Mastercard Inc. fees are under fresh scrutiny from European Union antitrust enforcers, less than a decade after a series of probes ended with hefty fines and an agreement to cut some of their controversial levies.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "3727932383106746237",
        "title": "Mastercard's Meyer Talks Retail and Travel Trends",
        "url": "https://www.bloomberg.com/news/videos/2025-05-22/mastercard-s-meyer-talks-retail-and-travel-trends-video",
        "site": "bloomberg.com",
        "time": 1747953289000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard Economics Institute Chief Economist Michelle Meyer says retailers are still seeing an engaged consumer and there's no clear evidence yet that tariffs are playing a role in spending on \"Bloomberg The Close.\" (Source: Bloomberg)",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5150873434108136646",
        "title": "UK Tribunal Finalizes Settlement in Class Action Against Mastercard",
        "url": "https://www.pymnts.com/legal/2025/uk-tribunal-finalizes-settlement-in-class-action-against-mastercard/",
        "site": "pymnts.com",
        "time": 1747769919000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "The U.K.’s Competition Appeal Tribunal announced its judgment Tuesday (May 20) in a long-running class action lawsuit that was brought against Mastercard over its swipe fees. The judgment determines the distribution of the settlement of 200 million pounds that was announced in February, the Competition Appeal Tribunal said in a summary of the judgment. It […] The post UK Tribunal Finalizes Settlement in Class Action Against Mastercard appeared first on PYMNTS.com. The U.K.’s Competition Appeal Tribunal announced its judgment Tuesday (May 20) in a long-running class action lawsuit that was brought against Mastercard over its swipe fees. The judgment determines the distribution of the settlement of 200 million pounds that was announced in February, the Competition Appeal Tribunal said in a summary of the judgment. It approves the settlement sought by the class representative, Walter Merricks, and Mastercard, according to the summary. The funder of Merricks’ lawsuit, Innsworth Capital, had objected to the settlement, saying the settlement figure was too low, and had begun arbitration against him, the summary said. As part of the settlement, Mastercard agreed to give Merricks indemnity of 10 million pounds, per the summary. “The Tribunal held that it was entirely satisfied that the terms of the settlement were just and reasonable such that the settlement should be approved […],” the summary said. “The likelihood of judgment being obtained for an amount significantly in excess of £200 million was low. Further, the personal indemnity to Mr. Merricks, in the unusual circumstances of this case, did not impugn the Tribunal’s view of the settlement.” With this final approval of the settlement, millions of U.K. consumers are set to receive up to 70 pounds each, the Independent reported Tuesday. “The settlement that has today been finally approved represents a fair and just outcome for U.K. consumers,” Merricks told the Independent. “On any view, recovering £200 million by way of a settlement for U.K. consumers is a huge sum, and that will translate into a meaningful impact in the pockets of U.K. consumers.” Merricks, a former financial ombudsman, filed the lawsuit in 2016, alleging that Mastercard charged exorbitant interchange fees — which retailers pay credit card companies when consumers shop with that card — and that those fees were passed on to consumers in the form of higher retail prices. Mastercard countered that consumers derived valuable benefits from its payment technology. Merricks and Mastercard announced an agreement in principle to settle the lawsuit on Dec. 3. The Competition Appeal Tribunal approved the settlement in February, adding that the approval was subject to finalization of the details and that a formal order would follow. The post UK Tribunal Finalizes Settlement in Class Action Against Mastercard appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "2003927931671730461",
        "title": "Funder of landmark Mastercard case hits out at court over ‘unreasonable’ return",
        "url": "https://www.ft.com/content/107bbb74-139b-474b-8d09-e5ab765389a2",
        "site": "ft.com",
        "time": 1747765759000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Litigation finance firm owned by US hedge fund Elliott warns outcome could deter industry from backing other claims",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "346787847179462544",
        "title": "Millions of consumers could get £70 after Mastercard ruling",
        "url": "https://www.bbc.com/news/articles/c14kkjyrk20o",
        "site": "bbc.com",
        "time": 1747757098000,
        "favicon_url": "https://static.tickertick.com/website_icons/bbc.com.ico",
        "tags": [
            "ma"
        ],
        "description": "It is not necessary to have held a Mastercard to make a claim, after a court ruled historic fees the firm charged were unfair.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2438222815988610374",
        "title": "AML Incubator Congratulates Nominis on Winning 1st Prize at Mastercard's Europe-Wide Fintech Forum - and Redefining the Future of Crypto Compliance",
        "url": "https://markets.businessinsider.com/news/stocks/aml-incubator-congratulates-nominis-on-winning-1st-prize-at-mastercards-europewide-fintech-forum-and-redefining-the-future-of-crypto-compliance-1034738639",
        "site": "businessinsider.com",
        "time": 1747417980000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Athens, Greece--(Newsfile Corp. - May 16, 2025) - AML Incubator, backs founders who rethink broken systems. AMLI congratulates their partner",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-7946372913714773867",
        "title": "Japan's exchange rate plays a key role in its attractiveness to tourists, says Mastercard",
        "url": "https://www.cnbc.com/video/2025/05/16/japans-exchange-rate-plays-a-role-in-its-attractiveness-mastercard.html",
        "site": "cnbc.com",
        "time": 1747370245000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ma"
        ],
        "description": "David Mann discusses the latest travel trends report from the Mastercard Economic Institute, which finds an increasing number of Asian countries becoming preferred destinations for the summer.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2809509844790925674",
        "title": "Travel among sectors most heavily impacted by fraud, Mastercard report finds",
        "url": "https://www.cnbc.com/video/2025/05/16/travel-among-sectors-most-heavily-impacted-by-fraud-mastercard-report-finds.html",
        "site": "cnbc.com",
        "time": 1747369534000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Fraud can start in the travel pre-planning stage, says Mastercard's David Mann, as he outlines details from the Mastercard Economic Institute's latest report on travel trends.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5637389127424433907",
        "title": "Mastercard and MoonPay Team to Promote Stablecoin Payments",
        "url": "https://www.pymnts.com/cryptocurrency/2025/mastercard-and-moonpay-team-to-promote-stablecoin-payments/",
        "site": "pymnts.com",
        "time": 1747320053000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard has launched a stablecoin-focused partnership with cryptocurrency payments FinTech MoonPay. The collaboration will allow consumers and businesses to send and receive stablecoin payments across global markets, according to a Thursday (May 15) news release. Companies and FinTechs will be able to employ Mastercard-branded cards linked to users’ stablecoin balances, allowing cardholders to spend their stablecoins, which […] The post Mastercard and MoonPay Team to Promote Stablecoin Payments appeared first on PYMNTS.com. Mastercard has launched a stablecoin-focused partnership with cryptocurrency payments FinTech MoonPay. The collaboration will allow consumers and businesses to send and receive stablecoin payments across global markets, according to a Thursday (May 15) news release. Companies and FinTechs will be able to employ Mastercard-branded cards linked to users’ stablecoin balances, allowing cardholders to spend their stablecoins, which will simultaneously be converted to fiat currency, at more than 150 million locations where Mastercard is accepted around the world. “By providing solutions that unlock stablecoin utility and ubiquity, we are redefining how money moves globally and driving a shift in payments as we know it,” Scott Abrahams, executive vice president, Global Partnerships at Mastercard, said in the release. “Together with MoonPay, we’re building innovative and secure connectivity between crypto and mainstream finance ecosystems, grounded by trust and driven by scale.” According to the release, the partnership will leverage the API-driven stablecoin infrastructure from Iron, acquired by MoonPay in March, to facilitate stablecoin transactions, turning “crypto wallets into new digital bank accounts for seamless global transactions.” This will let businesses, neobanks, and other payment participants manage payouts and disbursements more efficiently, improving cross-border money transfers, the release said, and help businesses offer stablecoin-based payouts to gig workers, contractors and creators. The partnership is happening amid what PYMNTS recently described as “the rise of stablecoins as financial infrastructure” following two other Mastercard partnerships centered around digital assets. One of them involved teaming with OKX, merging that company’s expertise in crypto trading with Mastercard’s payment network to promote the wider adoption of stablecoins. That adoption is happening amid a tumultuous time for global affairs, Konstantin Anissimov, chief executive at Currency.com, told PYMNTS CEO Karen Webster earlier this week. “There’s been a big shift in terms of adoption of stablecoin payments that is being driven by uncertainty in geopolitics,” Anissimov said. “I am personally seeing a big increase of small to medium enterprises utilizing stablecoin payments because banking rails are harder and harder to use.” Digital assets like stablecoins have become a needed tool to navigate a fragmented financial world, he added. “If the payment gets there quicker, faster, in a more definitive way, then a lot of these businesses are limited less in their working capital requirements,” Anissimov said. “The faster the payment, the more goods they can buy.” The post Mastercard and MoonPay Team to Promote Stablecoin Payments appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5854203055069081819",
        "title": "Report: European Retailers Seek Antitrust Case Against Mastercard and Visa",
        "url": "https://www.pymnts.com/antitrust/2025/european-retailers-seek-antitrust-case-against-mastercard-visa/",
        "site": "pymnts.com",
        "time": 1747259773000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "A group of trade associations representing European retailers reportedly asked the European Commission to take action against Mastercard and Visa under European Union antitrust rules, alleging that the companies charge high fees and don’t provide transparency on those fees. In a letter dated Tuesday (May 13) and addressed to the commission’s antitrust chief, financial services […] The post Report: European Retailers Seek Antitrust Case Against Mastercard and Visa appeared first on PYMNTS.com. A group of trade associations representing European retailers reportedly asked the European Commission to take action against Mastercard and Visa under European Union antitrust rules, alleging that the companies charge high fees and don’t provide transparency on those fees. In a letter dated Tuesday (May 13) and addressed to the commission’s antitrust chief, financial services commissioner and economy chief, the associations also called for price controls on interchange fees, transparency and non-discriminatory obligations for International Card Schemes (ICSs), and a tool for regulators to scrutinize ICSs’ actions, Reuters reported Wednesday (May 14), citing a copy of the letter. “International Card Schemes (ICS) have been able to increase their fees without competitive challenge or regulatory scrutiny,” the letter said, per the report. “They have also rendered their system of fees and rules so complex and opaque that players are unable to understand, let alone challenge, what they are paying for and why.” Reached by PYMNTS, a Mastercard spokesperson declined to comment on the report, saying the company had not seen or received the letter. Visa did not immediately reply to PYMNTS’ request for comment. In a statement provided to Reuters, Visa said its fees reflect the value of its services, adding: “This includes extremely high levels of security and fraud prevention, near-perfect operational resilience and reliability, and a wide range of consumer protections and high-quality, innovative products and services that serve consumer and merchant needs.” According to the report, the letter was signed by five lobbying groups: EuroCommerce, Ecommerce Europe, Independent Retail Europe, the European Association of Corporate Treasurers and the European Digital Payments Industry Alliance. The associations did not immediately reply to PYMNTS’ request for comment. Mastercard and Visa process about two-thirds of card payments in the eurozone, and retailers’ complaints in the past have led the EU to investigate alternatives to American payment providers, the report said. It was reported in November that the European Commission launched a probe into whether Mastercard and Visa’s fees are hurting merchants. An antitrust case brought by EU regulators could lead to fines of up to 10% of a company’s global earnings. The post Report: European Retailers Seek Antitrust Case Against Mastercard and Visa appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "8689801288402658260",
        "title": "Mastercard, BMO and Webster Bank on Securing Data",
        "url": "https://www.bloomberg.com/news/videos/2025-05-14/mastercard-bmo-and-webster-bank-on-securing-data-video",
        "site": "bloomberg.com",
        "time": 1747218145000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Ranjita Iyer, Executive Vice President, NAM Services, Mastercard; Patricia Voight, Chief Information Security Officer, Webster Bank; and Larry Zelvin, Executive Vice President & Head of Financial Crimes Unit, BMO Financial Group speak with Bloomberg's Diksha Gera about how new techologies help to protect against fraud and minimize risk at Winning the Innovation Game: Modernizing IT Without Disruption event in New York. (Source: Bloomberg)",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "2267612015569932865",
        "title": "Mastercard's Michelle Meyer: Consumers are still spending on travel",
        "url": "https://www.cnbc.com/video/2025/05/12/mastercards-michelle-meyer-consumers-are-still-spending-on-travel.html",
        "site": "cnbc.com",
        "time": 1747077431000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Michelle Meyer, Mastercard Economics Institute chief economist, joins CNBC's 'Power Lunch' to discuss outlooks on the consumer, travel trends, and more.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2577219598333201987",
        "title": "Mastercard and Habito Offer Mortgage Support to UK Small Business Owners",
        "url": "https://www.pymnts.com/partnerships/2025/mastercard-and-habito-offer-mortgage-support-to-uk-small-business-owners/",
        "site": "pymnts.com",
        "time": 1747073237000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Habito said Monday (May 12) that its mortgage advisers now offer support at no cost to U.K. small business owners who are members of Mastercard’s Business Bonus program. “We’ve partnered with Mastercard to bring smart, tailored mortgage support to small business owners across the U.K.,” Habito said in a Monday post on LinkedIn. “More guidance, less guesswork, […] The post Mastercard and Habito Offer Mortgage Support to UK Small Business Owners appeared first on PYMNTS.com. Habito said Monday (May 12) that its mortgage advisers now offer support at no cost to U.K. small business owners who are members of Mastercard’s Business Bonus program. “We’ve partnered with Mastercard to bring smart, tailored mortgage support to small business owners across the U.K.,” Habito said in a Monday post on LinkedIn. “More guidance, less guesswork, from advisers who get that running a business is already a full-time job.” This support is available to small business owners who are buying a home, refinancing or investing in a rental property, according to a Monday report by FinTech Finance News to which Habito provided a link in another post on LinkedIn. Together with personalized support from Habito’s qualified advisers, members of Mastercard’s Business Bonus can also use Habito’s platform to explore mortgage options and secure deals, all in one digital journey, according to the report. Habito did not immediately reply to PYMNTS’ request for comment. Business Bonus offers business cardholders access to benefits and offers from Mastercard partners worldwide, according to a web page about the program. The offers include travel; software and productivity; IT and cloud services; marketing; human resources (HR) and learning; logistics; and electronics, according to the page. Of the Habito Business Bonus Offer, the page said the offer is available in the U.K. and valid to Dec. 5, 2026. “As a valued Mastercard Business Bonus customer, you have access to exclusive mortgage benefits with Habito, the U.K.’s leading digital mortgage broker,” the page said. “Whether you’re looking to buy your first home, remortgage for better rates, or invest in property, we make the process simple, stress-free, and cost-effective.” Habito launched in 2016 as an end-to-end digital homebuying solution, helping to connect buyers to lenders and providing access to solicitors and case managers who can guide homebuyers through the process of applying for mortgages, building surveys and conveyance. Cardholder engagement hinges on the ease of accessing and the personalization of card-linked offers, according to the PYMNTS Intelligence and Banyan collaboration, “Beyond Points and Perks: How Relevant Benefits Drive Cardholder Engagement.” The report found that active engagement with card-linked offers is likely to boost credit card use, provided these offers align with consumers’ everyday needs. The post Mastercard and Habito Offer Mortgage Support to UK Small Business Owners appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-57639468148653889",
        "title": "At Mastercard, AI is helping to power fraud-detection systems",
        "url": "https://www.businessinsider.com/mastercard-ai-credit-card-fraud-detection-protects-consumers-2025-5",
        "site": "businessinsider.com",
        "time": 1747062694000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Getty Images; Karan Singh for BIMastercard is using AI to help detect and prevent credit card fraud.The company says the tech can flag unusual patterns and block fraudulent transactions.This article is part of \"AI in Action,\" a series exploring how companies are implementing AI innovations.When the text message came in, Kim Dow's heart sank.\"Hi,\" it read. \"Did you just make this purchase with your REI Co-op Mastercard?\"The message went on to share the last four digits of Dow's card number and a purchase for $88.69 worth of Alaska Airlines miles, which Dow says she did not make.She texted back \"no.\" Within seconds, Mastercard's fraud department disputed the charge and removed it from Dow's active statement.Though credit card safety technology has advanced in recent years with multi-factor authentication and EMV chips, fraud situations like Dow's still happen. Mastercard, one of the country's oldest credit card companies, is using artificial intelligence to prevent and minimize situations like this.For the past 10 years, the credit giant has incorporated some form of machine learning algorithms to monitor transactions in real time and detect unusual patterns such as multiple failed logins and large or sudden withdrawals.Mastercard's newest iteration of its AI-powered fraud detection system features AI technology that scans nearly 160 billion transactions every year. This technology has helped Mastercard significantly reduce false-positive fraud cases, according to a May 2024 press release from the company.AI powers a risk-scoring system that flags suspicious transactionsIdentifying fraud often comes down to pattern recognition, which makes AI well-suited for the task, said Daryl Lim, an affiliate at the Center for Socially Responsible Artificial Intelligence.\"AI enables real-time detection of suspicious transactions by identifying patterns and anomalies impossible for human analysts to spot at scale,\" Lim, who's also the H. Laddie Montague Jr. Chair in Law at Penn State Dickinson Law, told BI.This is especially true for a company such as Mastercard, which has large amounts of data that can be used to train an AI on what to look for, said Seckin Yilgoren, Mastercard's senior vice president of security solutions in North American markets.Yilgoren said the company processes nearly 160 billion transactions every year, providing it with terabytes upon terabytes of data to study and analyze for patterns that might expose fraud.Mastercard uses this knowledge to inform a risk-scoring system called Decision Intelligence, which assigns a score to each transaction. To do this, the system continuously scans hundreds of millions of data points, such as a cardholder's name, address, and purchase history, to predict whether a transaction is likely to be genuine.Scores above a certain threshold are deemed legitimate, while those below the threshold are flagged as fraud. It does this in 50 milliseconds or less, Yilgoren said — an important point because it means the system can detect and block fraudulent transactions nearly in real time. This can prevent headaches for customers like Dow by giving them the opportunity to approve or decline suspicious transactions almost immediately.Decision Intelligence is also continuously learning and adapting to new fraud patterns without human intervention, Yilgoren said. He added that this technology could snuff out false positives. By predicting context and behavior, AI can detect patterns the human brain cannot, and can distinguish between legitimate unusual activity, such as a rare entertainment splurge on a new television or concert tickets, and actual fraud, Yilgoren said.This year, Mastercard also introduced Decision Intelligence Pro, a system that assesses the relationships between identifying user characteristics and past user behaviors to determine the validity of a transaction.Lim told BI that these technologies make a compelling argument for AI as a method of fraud detection, but they also have limitations.He said that machine learning models could inadvertently learn to associate legitimate transactions with fraud based on biased historical data. If this happens, an AI-powered system has the potential to flag certain demographics or locations disproportionately. This raises serious concerns around equity and trust, Lim said.He said the final layer of fraud detection measures can often benefit from human judgment since they can investigate and provide insights into why any given transaction was flagged. \"The goal is a hybrid model: AI for speed and scale, humans for nuance and accountability,\" Lim told BI.Andrew Reiskind, Mastercard's chief data officer, agreed. He said the company has an AI governance program in which employees provide oversight on all AI-powered operations and solutions.\"By integrating human-centered design into our AI solutions and overseeing the process, we ensure that our technology not only enhances efficiency and delivers great products but also aligns with our ethical standards and commitment to responsible AI use,\" Reiskind told BI.Leveraging AI to fight fraud rings — and customer dishonestyMastercard also uses AI to detect fraud by mapping connections between accounts, devices, and transactions.This technology uses behavioral biometrics, which examine how specific users type and swipe on apps, to try to detect imposters. Apps monitor this information as part of each transaction. From there, on the back end, an algorithm takes into account unique data points such as the cadence with which a user types in a password, how they hold a device, and how they move their mouse. Yilgoren said there is a \"slight but noticeable\" difference between a trusted user's behaviors and the imitation of them.There's also the issue of first-party fraud, which occurs when a consumer makes a legitimate purchase and later requests a chargeback, even though goods and services were received. To combat this, Mastercard has rolled out its First-Party Trust program, which uses AI to scan data points such as IP address, device ID, and shipping address to determine the likelihood that a chargeback request is legitimate.Yilgoren said this initiative incorporates AI and risk modeling to enable greater insight into a cardholder's purchase history, delivery information, and geographic location. This, in turn, can help determine whether the original purchase was legitimate.In 2024, Mastercard also launched Scam Protect, a suite of AI-powered solutions designed to help identify and prevent online scams.\"Really, it's a question of how we can ensure data security and trust for our customers, but also for the banks and merchants who use our services,\" Yilgoren said.Read the original article on Business Insider Getty Images; Karan Singh for BIMastercard is using AI to help detect and prevent credit card fraud.The company says the tech can flag unusual patterns and block fraudulent transactions.This article is part of \"AI in Action,\" a series exploring how companies are implementing AI innovations.When the text message came in, Kim Dow's heart sank.\"Hi,\" it read. \"Did you just make this purchase with your REI Co-op Mastercard?\"The message went on to share the last four digits of Dow's card number and a purchase for $88.69 worth of Alaska Airlines miles, which Dow says she did not make.She texted back \"no.\" Within seconds, Mastercard's fraud department disputed the charge and removed it from Dow's active statement.Though credit card safety technology has advanced in recent years with multi-factor authentication and EMV chips, fraud situations like Dow's still happen. Mastercard, one of the country's oldest credit card companies, is using artificial intelligence to prevent and minimize situations like this.For the past 10 years, the credit giant has incorporated some form of machine learning algorithms to monitor transactions in real time and detect unusual patterns such as multiple failed logins and large or sudden withdrawals.Mastercard's newest iteration of its AI-powered fraud detection system features AI technology that scans nearly 160 billion transactions every year. This technology has helped Mastercard significantly reduce false-positive fraud cases, according to a May 2024 press release from the company.AI powers a risk-scoring system that flags suspicious transactionsIdentifying fraud often comes down to pattern recognition, which makes AI well-suited for the task, said Daryl Lim, an affiliate at the Center for Socially Responsible Artificial Intelligence.\"AI enables real-time detection of suspicious transactions by identifying patterns and anomalies impossible for human analysts to spot at scale,\" Lim, who's also the H. Laddie Montague Jr. Chair in Law at Penn State Dickinson Law, told BI.This is especially true for a company such as Mastercard, which has large amounts of data that can be used to train an AI on what to look for, said Seckin Yilgoren, Mastercard's senior vice president of security solutions in North American markets.Yilgoren said the company processes nearly 160 billion transactions every year, providing it with terabytes upon terabytes of data to study and analyze for patterns that might expose fraud.Mastercard uses this knowledge to inform a risk-scoring system called Decision Intelligence, which assigns a score to each transaction. To do this, the system continuously scans hundreds of millions of data points, such as a cardholder's name, address, and purchase history, to predict whether a transaction is likely to be genuine.Scores above a certain threshold are deemed legitimate, while those below the threshold are flagged as fraud. It does this in 50 milliseconds or less, Yilgoren said — an important point because it means the system can detect and block fraudulent transactions nearly in real time. This can prevent headaches for customers like Dow by giving them the opportunity to approve or decline suspicious transactions almost immediately.Decision Intellige",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "3596526781030845155",
        "title": "Green Dot Shares Jump on Report of Private Equity Interest",
        "url": "https://www.bloomberg.com/news/articles/2025-05-07/green-dot-shares-jump-on-report-of-private-equity-interest",
        "site": "bloomberg.com",
        "time": 1746647641000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Green Dot Corp. shares jump as much as 7.3%, the most intraday since April 9, after Fortune reported that the financial technology company had attracted private equity interest, citing unnamed banking and PE executives. A Green Dot Corp. prepaid Mastercard Inc. card and a Green Dot Corp. Visa Inc. debit card, right, are arranged for a photograph in Washington, D.C., U.S., on Thursday, Feb. 15, 2018. Green Dot is expected to release earnings figures on February 21. Photographer: Andrew Harrer/Bloomberg",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-332217503561850201",
        "title": "Mastercard Launches UK-Based Open Banking Pact With Cardstream",
        "url": "https://www.pymnts.com/partnerships/2025/mastercard-launches-uk-based-open-banking-pact-with-cardstream/",
        "site": "pymnts.com",
        "time": 1746645032000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard has teamed with British FinTech Cardstream to promote open banking payments. The partnership will allow Cardstream to bolster its Payment Facilitation-as-a-Service (PFaaS) platform and allow customers to offer open banking payments to merchants and retailers throughout the U.K., the companies said in a Wednesday (May 7) news release. “There’s strong demand for open banking payments as a secure […] The post Mastercard Launches UK-Based Open Banking Pact With Cardstream appeared first on PYMNTS.com. Mastercard has teamed with British FinTech Cardstream to promote open banking payments. The partnership will allow Cardstream to bolster its Payment Facilitation-as-a-Service (PFaaS) platform and allow customers to offer open banking payments to merchants and retailers throughout the U.K., the companies said in a Wednesday (May 7) news release. “There’s strong demand for open banking payments as a secure and convenient way to pay alongside cards,” Adam Sharpe, CEO of Cardstream, said in the announcement. “We’ve long collaborated with Mastercard on innovations like network tokenization and Click to Pay, and we’re excited to offer a turnkey solution that lets payment providers launch branded Open Banking Merchant Services quickly.” According to the release, the partnership will let acquirers, payment facilitators and payment channels that use Cardstream offer their merchant customers the option to accept open banking payments alongside debit and credit cards and other forms of payment. “The new solution expands payment choice for businesses and consumers in the UK, supporting single immediate payments (SIP) and preparing for commercial variable recurring payments — a new payment method that will allow people to pay for recurrent bills directly from their bank account — as they expectedly roll out across Europe, including in the UK, by late 2025,” the release added. Valerie Nowak, head of open banking, APEMEA at Mastercard, noted that the collaboration is occurring as the “open banking market is set for significant growth in Europe.” The partnership is also happening at a time when, as PYMNTS wrote last month, open banking payments remain a largely untapped opportunity. A report by PYMNTS Intelligence and Trustly, “What Consumers Need for Pay by Bank to Catch On,” suggests that the proper incentives could be the key that opens the door to more widespread consumer adoption. Research from the study shows that strategic incentives, especially discounts and cash-back offers, significantly increase interest even among consumers who were initially resistant. The report also stresses that while usage is modest, growth depends on effectively engaging key demographics and spotlighting the uses of pay by bank outside of traditional retail transactions. “The report identifies a significant awareness gap as a primary hurdle, with 56% of consumers stating they are simply not familiar with pay by bank,” PYMNTS wrote. “However, the research highlights the power of incentives in bridging this gap, demonstrating a 72% increase in interest when consumers are offered cash-back discounts or loyalty benefits.” The post Mastercard Launches UK-Based Open Banking Pact With Cardstream appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-6000218806576075194",
        "title": "Mastercard And Visa Unleash AI Agents To Shop For You",
        "url": "https://www.forbes.com/sites/torconstantino/2025/05/05/mastercard-and-visa-unleash-ai-agents-to-shop-for-you/",
        "site": "forbes.com",
        "time": 1746446400000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard and Visa debut AI agents that can research, recommend and pay for purchases — ushering in a new era of autonomous shopping and agentic commerce. Mastercard and Visa debut AI agents that can research, recommend and pay for purchases — ushering in a new era of autonomous shopping and agentic commerce.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "2093084462685007653",
        "title": "Visa, Mastercard, PayPal Fuel Agentic AI Commerce Boom",
        "url": "https://www.pymnts.com/news/artificial-intelligence/2025/visa-mastercard-paypal-fuel-agentic-ai-commerce-boom/",
        "site": "pymnts.com",
        "time": 1746207394000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Three of the world’s largest payment companies, Visa, Mastercard and PayPal, are racing into the next frontier in digital commerce: agentic AI. This week, all three announced they were deploying agentic commerce, a fast-emerging trend in which AI agents not only assist consumers with shopping but also complete transactions on their behalf. “These technologies have […] The post Visa, Mastercard, PayPal Fuel Agentic AI Commerce Boom appeared first on PYMNTS.com. Three of the world’s largest payment companies, Visa, Mastercard and PayPal, are racing into the next frontier in digital commerce: agentic AI. This week, all three announced they were deploying agentic commerce, a fast-emerging trend in which AI agents not only assist consumers with shopping but also complete transactions on their behalf. “These technologies have the potential to radically transform commerce, to radically transform how we all shop, how we all buy, and how commerce works at its most fundamental layers,” said Visa CEO Ryan McInerney at a livestreamed company product unveiling. Agentic commerce will be rolling out in the next few quarters, McInerney said in a separate interview with Bloomberg TV. Visa is working with Anthropic, Microsoft, Mistral, OpenAI, Perplexity and others to integrate payment capabilities into AI chatbots. When people use AI chatbots to shop, they will also be able to use AI agents to pay for purchases — something not possible yet. Absent were eCommerce giant Amazon and Google, whose core search business risks eroding from AI chatbots’ popularity. The three companies’ agentic commerce initiatives are: Visa Intelligent Commerce is a platform built to support AI agents in executing trusted, tokenized transactions globally. Mastercard’s Agent Pay replaces payment information with digital tokens for security. Consumers can set parameters under which the AI agent is allowed to make purchases. PayPal Agent Toolkit enables developers to integrate its payment processes into the agentic AI workflow. At the heart of Visa and Mastercard’s agentic commerce capabilities is the idea of tokenization, creating a new 16-digit series of numbers — or a cryptographically protected token — linked to the consumer’s original card and giving it to the AI agent to use. It’s like giving the AI agent its own credit card but with strict, parental-style controls. Consumers decide when to activate it, what the agent can buy and how much it can spend. It only works for that AI agent. According to the PYMNTS Intelligence report “Why Network Tokenization is eCommerce’s Newest Essential,” network tokens, provisioned by the major payment card networks in partnership with issuing banks, enable merchants to protect sensitive card payment information while reducing costs and boosting sales. PayPal’s approach is different. It offers a developer toolkit and access tokens that let AI agents interact directly with PayPal’s platform through APIs. APIs are pieces of code that let software programs quickly integrate a capability, like plug and play. A Profound Shift in Payments “The rise of agentic commerce represents a seismic shift in digital retail, following the waves of eCommerce and mobile, with profound implications for consumers, retailers and financial institutions,” Jerry Sheldon, an analyst at IHL, told PYMNTS. Martin Balaam, CEO of Pimberly, which curates product data for retailers, manufacturers and distributors, said agentic commerce is revolutionary. “It’s a chance to meet customers right at the moment of intent — no more hoping they click through a catalog or keyword ad,” Balaam told PYMNTS. “AI can surface exactly the right SKU based on a nuanced request,” such as, “Show me eco-friendly running shoes under $100.” “Search as we know it will inevitably give way to intent understanding,” Balaam said. “Instead of 10 blue links, shoppers will get a curated set of product suggestions, comparisons and even proactive deals based on their profile and behavior.” That also means retailers must optimize for this new landscape to ensure that consumers are directed to their products, Neil Saunders, managing director and retail analyst at GlobalData, told PYMNTS. Winners will be those retailers that feed the AI agent the right data, such as “real-time inventory, pricing, product and purchasing” information so they show up in the AI agent’s recommendations,” Sheldon said. Those who don’t risk losing out. AI agents can better match consumers to what they want, so this could “significantly” reduce returns, he said. The Way to Scale For consumers, an AI agent acts as a concierge that can plan, shop and pay for them, saving them time and effort. But to get them to engage in the technology, gaining their trust is paramount. “Agentic commerce is poised to redefine convenience and efficiency in retail, but its success will depend on building trust, ensuring transparency, and working hand-in-hand with regulators to protect consumers,” Sheldon said. According to Saunders, “People will be very comfortable with allowing agents to do things like searching for the best options, finding the best prices, and even arranging delivery and so forth. When comes to payment, he said, “consumers like to remain in control, and payment companies need to ensure that this is put in place along with safeguards.” Sheldon said the following features are needed to scale agentic commerce. Reliable trust layer: Payment networks building the trust infrastructure for agentic commerce must include robust agent verification, real-time behavioral monitoring, and clear audit trails to ensure accountability and prevent unauthorized activity. Transparent boundaries: Consumers need clear visibility into what’s automated versus what requires human approval. Explainable decisions: When an AI chooses brand X over brand Y, consumers will want to understand the decision factors — price, quality, brand reputation, sustainability, delivery speed and the like. Payment providers must work with retailers to standardize this data disclosure. Failsafe recourse: Real-time cancellation protocols and robust dispute resolution will be essential for consumer confidence. For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. The post Visa, Mastercard, PayPal Fuel Agentic AI Commerce Boom appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "7468041131039355486",
        "title": "This Week in AI: Visa, Mastercard and PayPal Go All in on Agentic Commerce",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/this-week-in-ai-visa-mastercard-and-paypal-go-all-in-on-agentic-commerce/",
        "site": "pymnts.com",
        "time": 1746205603000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "This week brings fresh news on the digital payments front, with Visa, Mastercard and PayPal unveiling their agentic commerce programs. Their moves represent a significant shift to the payments landscape, fueled by agentic artificial intelligence (AI) systems that can pay on behalf of consumers. Also this week, a PYMNTS Intelligence report showed that 90% of […] The post This Week in AI: Visa, Mastercard and PayPal Go All in on Agentic Commerce appeared first on PYMNTS.com. This week brings fresh news on the digital payments front, with Visa, Mastercard and PayPal unveiling their agentic commerce programs. Their moves represent a significant shift to the payments landscape, fueled by agentic artificial intelligence (AI) systems that can pay on behalf of consumers. Also this week, a PYMNTS Intelligence report showed that 90% of health care executives are seeing positive ROI for generative AI, which is fueling their GenAI investments for the future. Finally, Apple said it needs more time to upgrade Siri and warned of a Q3 tariff hit. Visa Launches ‘Visa Intelligent Commerce’ Visa introduced an agentic AI system that would equip AI agents with the ability to pay for purchases and bookings on behalf of consumers, not just shop for them. Called “Visa Intelligent Commerce,” the program opens the network’s rails to developers building AI agents that search, recommend and make payments using special cards that link back to the user’s original card. People have been increasingly using AI chatbots to shop and plan for things like vacation travel, according to Visa. But the missing link has been a payment mechanism, until now. “This is going to transform shopping and buying — we’re letting AI developers and engineers use the Visa network to allow AI agents to find, and buy, on [the consumer’s] behalf in a seamless and safe way,” Mark Nelsen, Visa’s global head of consumer products, told PYMNTS’ Karen Webster. Read more: Visa Gives AI Shopping Agents ‘Intelligent Commerce’ Superpowers Mastercard Introduces ‘Agent Pay’ Mastercard has launched an agentic AI-driven payments program called “Agent Pay.” The new offering uses Mastercard’s Agentic Tokens, which the company said builds upon tokenization capabilities that power global commerce solutions like mobile contactless payments. Mastercard is working with Microsoft and IBM on this technology, with other AI leaders to follow. The company will also work with checkout players like Braintree and Checkout.com to enhance tokenization capabilities. “This helps unlock an agentic commerce future where consumers and businesses can transact with trust, security, and control,” the company said in a news release. See also: Mastercard Debuts Agent Pay to Promote ‘Agentic Commerce Future’ PayPal Explores Agentic Commerce PayPal introduced the PayPal Agent Toolkit, which enables developers to integrate its payment processes into the agentic AI workflow. The company offers a developer toolkit and access tokens that let AI agents interact directly with PayPal’s platform through application programming interfaces (APIs). “The future is here,” PayPal CEO Alex Chriss said in this week’s earnings call. “Now any business can create agentic experiences that allow customers to pay, track shipments, manage invoices and more, all powered by PayPal and all within an AI client.” More here: PayPal Details Agentic Commerce Initiatives and Strategic Focus on Value-Added Services GenAI Use in Healthcare Brings Positive ROI According to recent research from PYMNTS Intelligence, the healthcare sector is bullish about GenAI, and most have already deployed the technology in key areas like product innovation and customer service. The report polled C-suite executives at healthcare companies generating at least $1 billion in annual revenue. Companies are both seeing and expecting positive ROI, which fuels future plans for additional investments in the technology. The report also showed that 59% of healthcare executives said they would increase their GenAI investment in the next year, a figure higher than the 52% cross-industry average. Related: 90% of Healthcare Execs Already See Positive ROI From GenAI Investments Apple Warns of $900 Million Tariff Hit Apple CEO Tim Cook is asking consumers to be patient since the company needs “more time” to upgrade Siri up to the standards set by competitors like Amazon’s Alexa and voice-enabled AI chatbots. “We need more time to complete our work on these features so they meet our high-quality bar,” Cook said during Apple’s earnings call with analysts. “We are making progress, and we look forward to getting these features into customers’ hands.” Cook also said that Apple expects to see a $900 million increase in costs due to tariffs during its fiscal third quarter, basing that number on current tariff policy. “We estimate the impact, assuming that the current global tariff rates, policies and applications don’t change for the balance of the quarter, to be $900 million to our cost,” Cook said. Cook also disputed the rebuke from a federal judge who said this week that Apple was in “willful violation” of a 2021 injunction related to the Epic Games lawsuit. The court had ordered Apple to let developers find a way to get paid by users without going through the Apple App Store, to avoid Apple’s 30% fee. The judge said Apple then assessed a 27% fee for outside sales. Cook said Apple disagrees with the ruling and will appeal. See also: Apple Needs ‘Time’ to Upgrade Siri; Services Revenue Dampened by Cost Hikes The post This Week in AI: Visa, Mastercard and PayPal Go All in on Agentic Commerce appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "6424885829997199345",
        "title": "Mastercard Move Transactions Grow 35%, CEO Says Consumer Spending ‘Solid’",
        "url": "https://www.pymnts.com/earnings/2025/mastercard-move-transactions-grow-35percent-ceo-says-consumer-spending-solid/",
        "site": "pymnts.com",
        "time": 1746122394000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Contactless payments continue to be a preferred method for consumers, Mastercard’s latest quarterly results showed, while debit and credit spending remained intact despite cardholders’ worries about the economy. Company materials that accompanied the Thursday (May 1) earnings release showed that gross dollar volumes were up 9% to $2.4 trillion; within the United States, credit and […] The post Mastercard Move Transactions Grow 35%, CEO Says Consumer Spending ‘Solid’ appeared first on PYMNTS.com. Contactless payments continue to be a preferred method for consumers, Mastercard’s latest quarterly results showed, while debit and credit spending remained intact despite cardholders’ worries about the economy. Company materials that accompanied the Thursday (May 1) earnings release showed that gross dollar volumes were up 9% to $2.4 trillion; within the United States, credit and debit spending gained 7% overall. Consumer Spending Is ‘Solid’ CEO Michael Miebach said on the conference call with analysts said that from a macro standpoint, “consumer and business sentiment has weakened, primarily due to concerns surrounding the impact from tariffs and geopolitical tensions. On the other hand, so far this year, the fundamentals that support consumer spending have been solid and our drivers are generally stable.” As for the company’s own prospects, he said that “there’s a substantial opportunity for us to drive sustainable growth across consumer payments, commercial new payment flows and value added services and solutions.” Miebach highlighted that 73% of all in-person switched transactions are contactless, and approximately 35% of all switched transactions are tokenized. The CEO said 85% of Mastercard’s value-added services and solutions revenues are recurring in nature, while the use of artificial intelligence (AI)-powered decisioning (which enhances fraud scoring) has detected 40% more payments fraud versus the first quarter of last year. Miebach said Mastercard Move has seen transaction growth of 35%, which has been borne aloft by payment use cases such as disbursements and payouts in the gig economy space. Chief Financial Officer Sachin Mehra said during the call that cross-border volumes were up 15%, “in line with expectations and reflecting continued growth in both travel and non travel related cross border spending.” As for April, Mehra said, payments volumes have been generally stable, and cross-border volumes were up 16%. “Consumer spending remains healthy,” said the CFO, who added that “the fundamentals that support consumer and business spending have been solid to date. Specifically, unemployment rates remain low and for the most part, wage growth continues to outpace the rate of inflation. At the same time, increased economic and geopolitical uncertainty has weakened sentiment and creates risks.” Mastercard executives stressed that the diversification of the platform’s business is resilient, underpinning expectations that with continued healthy consumer metrics, net revenues should grow at the “high end,” per Mehra, of a range into the low teens percentage points. Shares were 0.4% lower in early trading on Thursday. Analysts touched on the potential for stablecoins, and in response Miebach said there needs to be some regulatory clarity with legislation that is moving through Congress. “If you look at the role that we play today in the traditional card payment space, as we establish safety and security standards,” he said. “We provide interoperability. If you think about a world of stablecoins, you could start to see there’s a natural role emerging yet again for somebody like us who can provide trusted interoperability solutions, safety and security standards and a need for our services across identity questions, AML, KYC — you name it — across the board. So it’s a space that’s still emerging at this point in time.” Asked about the outlook for consumer spending, Miebach told analysts that “we expect the consumer to remain engaged … we expect the consumer to appreciate experiences and spend experiences. And the one thing that’s to be said about an engaged consumer … the engaged consumer is using all the tools of the digital economy to make expense decisions and decide between discretionary and nondiscretionary spending.” Miebach continued, “In our data, we don’t really see significant ‘upfronting’ of spending. So that’s not a trend that came through. In the U. S, we see generally stable spending.” Added Miebach later in the call, “having a secular trend where payments move from cash and checks into digital is an underlying powerful secular trend that continues. And in economic ups and downs, this will continue.” The post Mastercard Move Transactions Grow 35%, CEO Says Consumer Spending ‘Solid’ appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2637466443362548693",
        "title": "Mastercard outlines 2025 growth strategy amid 17% Q1 net revenue increase",
        "url": "https://seekingalpha.com/news/4439280-mastercard-outlines-2025-growth-strategy-amid-17-percent-q1-net-revenue-increase",
        "site": "seekingalpha.com",
        "time": 1746119153000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "3792879572798046910",
        "title": "CIBC Debuts Mastercard That Adapts Rewards to Spender Behavior",
        "url": "https://www.pymnts.com/credit-cards/2025/cibc-debuts-mastercard-that-adapts-rewards-to-spender-behavior/",
        "site": "pymnts.com",
        "time": 1746110995000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Canadian bank CIBC has teamed with Mastercard on a new credit card offering. The CIBC Adapta Mastercard, announced Thursday (May 1), is the first credit card in Canada to automatically determine a user’s top monthly spending categories based on where they spend the most, while also rewarding 50% more points on those categories. According to a Mastercard news release, the card […] The post CIBC Debuts Mastercard That Adapts Rewards to Spender Behavior appeared first on PYMNTS.com. Canadian bank CIBC has teamed with Mastercard on a new credit card offering. The CIBC Adapta Mastercard, announced Thursday (May 1), is the first credit card in Canada to automatically determine a user’s top monthly spending categories based on where they spend the most, while also rewarding 50% more points on those categories. According to a Mastercard news release, the card is also the first in Canada to include the company’s Touch Card design, an accessible feature that lets cardholders — including those with visual impairments — easily identify their credit card. “Our new CIBC Adapta Mastercard is a differentiator in the market as it delivers true flexibility to cardholders, putting control in their hands to help them realize their ambitions,” Diane Ferri, senior vice-president for day-to-day banking at CIBC, said in the announcement. “Adapta is a unique no annual fee card, offering flexibility to earn points on all purchases. The first of its kind, it’s the only credit card where cardholders earn bonus points on their personal top three spend categories each month, whether it be pet stores, clothing or important everyday essentials like groceries and gas.” As covered here in March, Research by PYMNTS Intelligence and Banyan has found cardholder engagement can hinge on the ease of accessing and the personalization of card-linked offers. The study, “Beyond Points and Perks: How Relevant Benefits Drive Cardholder Engagement,” spotlights an important shift in how card issuers can build loyalty and lead to more frequent card usage. “The report’s findings underscore that while many cardholders appreciate earning and redeeming loyalty rewards, the actual use of these benefits varies significantly,” PYMNTS wrote. “Notably, only 1 in 5 cardholders redeem credit rewards at least monthly, though frequent card users do so more regularly.” A key takeaway, that report added, is that active engagement with card-linked offers is likely to increase card usage, as long as these offers line up with consumers’ everyday needs. The relevance of these offers is chiefly determined by their ease of access and the level of personalization, with more 70% of users saying factors impact their appeal. Ease of access and personalization are crucial, with three-quarters of cardholders saying ease of access makes card-linked offers more appealing or relevant, with 74% saying the same about personalization factors. The post CIBC Debuts Mastercard That Adapts Rewards to Spender Behavior appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "2587300458158759539",
        "title": "Are consumers under spending pressure? Not according to Mastercard’s earnings.",
        "url": "https://www.marketwatch.com/story/are-consumers-under-spending-pressure-not-according-to-mastercards-earnings-d16b80f4?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1746106440000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard’s CEO noted weakening consumer sentiment but said “the fundamentals that support consumer spending have been solid.”",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2577844232045282872",
        "title": "Mastercard in charts: Worldwide purchase transactions up 9% in Q1",
        "url": "https://seekingalpha.com/news/4438934-mastercard-in-charts-worldwide-purchase-transactions-up-9-in-q1",
        "site": "seekingalpha.com",
        "time": 1746102023000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-3133206967283429965",
        "title": "Mastercard Earnings Top Estimates as Consumers Continue to Spend",
        "url": "https://www.bloomberg.com/news/articles/2025-05-01/mastercard-earnings-top-estimates-as-consumers-continue-to-spend",
        "site": "bloomberg.com",
        "time": 1746101579000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard Inc.’s first-quarter earnings topped expectations as consumers kept spending despite cloudy macroeconomic conditions spurred by President Donald Trump’s trade war. The Mastercard logo. Photographer: Amir Hamja/Bloomberg",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-1129087183085953096",
        "title": "Visa and Mastercard unveil AI-powered shopping",
        "url": "https://techcrunch.com/2025/04/30/visa-and-mastercard-unveil-ai-powered-shopping/?.tsrc=rss",
        "site": "techcrunch.com",
        "time": 1746049231000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Artificial intelligence is not just infiltrating the startup world. Now credit card giants Visa and Mastercard are getting into the AI game. Visa announced on Wednesday “Intelligent Commerce,” which it says enables AI “to find and buy.” AI agents will be able to shop and make purchases on behalf of consumers, based on preselected preferences. In a statement, Visa chief product and strategy officer Jack Forestell said: “Each consumer sets the limits, and Visa helps manage the rest.” Visa says tha",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2113850073298748012",
        "title": "The Digital Asset Primer: Stablecoin Staking for Payments Professionals",
        "url": "https://www.pymnts.com/cryptocurrency/2025/digital-asset-primer-stablecoin-staking-payments-professionals/",
        "site": "pymnts.com",
        "time": 1746026549000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "While cryptocurrency headlines often fixate on price swings and regulatory showdowns, a quieter revolution is happening under the surface: the rise of stablecoins as financial infrastructure. As evidenced by Mastercard’s crypto-driven partnerships with OKX and Nuvei announced this week, digital assets are increasingly being integrated into mainstream finance. Mastercard’s “360-degree approach” to stablecoin use includes […] The post The Digital Asset Primer: Stablecoin Staking for Payments Professionals appeared first on PYMNTS.com. While cryptocurrency headlines often fixate on price swings and regulatory showdowns, a quieter revolution is happening under the surface: the rise of stablecoins as financial infrastructure. As evidenced by Mastercard’s crypto-driven partnerships with OKX and Nuvei announced this week, digital assets are increasingly being integrated into mainstream finance. Mastercard’s “360-degree approach” to stablecoin use includes the merging of OKX’s expertise in crypto trading with Mastercard’s payment network, fostering broader adoption of stablecoins. At the same time, the company’s Nuvei initiative ensures that merchants can settle transactions in stablecoins, regardless of the payment method chosen by consumers. Not to be outdone, crypto exchange Kraken introduced a solution Wednesday (April 30) to help financial institutions give clients access to crypto. However, the story isn’t just about technology or economics. It’s also about design. How platforms use stablecoins — how they’re packaged, deployed and staked — is beginning to reshape how we interact with money itself. Crypto-native users are already familiar with staking. You lock up your tokens in a protocol in exchange for yield. Now, platforms are adapting the concept for a broader audience and using it as part of their user acquisition strategies. Read also: The Digital Asset Primer: Corporate Treasury Moves From HODL to Yield Staking as the New Onboarding Funnel Competition between stablecoin issuers such as Circle with USDC, Tether with USDT, PayPal with PYUSD and others is heating up, and staking helps create a financial incentive for people to hold and use a specific stablecoin instead of someone else’s. Unlike traditional banks, stablecoin issuers don’t only rely on brand trust or regulation; they need user engagement. Staking can help provide that hook. In contrast to their nominal crypto peers bitcoin or Ethereum, stablecoins aren’t bought to increase in value. Pegged to fiat currencies like the U.S. dollar, their worth is designed to stay exactly where it is. In doing so, they have become the connective tissue of the crypto economy, the infrastructure layer enabling trading, payments and real-world financial access. The Guiding and Establishing National Innovation for U.S. Stablecoins of 2025 (GENIUS) Act has emerged as a beacon of hope for crypto firms seeking clarity. If passed, it would be the first comprehensive framework in the United States for regulating stablecoins. “There’s certainly a change in how the administration views the digital assets industry,” Dan Boyle, partner at Boies Schiller Flexner, told PYMNTS this month. “This is not a confrontational posture.” Interest in stablecoins is rising as numerous federal agencies, including the Securities and Exchange Commission, Federal Deposit Insurance Corp. and the Federal Reserve, begin to clarify their positions, reversing or softening previous warnings and setting the stage for greater integration of crypto assets into the mainstream financial system. “I think the largest banks will succeed as stablecoin issuers,” former Assistant Secretary of the Treasury Amias Gerety told PYMNTS in March. See also: Keeping Stablecoins Stable is Complicated: Why CFOs Need to Pay Attention The Quiet Infrastructure Powering Crypto’s Real Economy Stablecoins can allow for rapid, borderless transfers of value without the friction of traditional banking rails. Want to move dollars from a trading desk in Singapore to one in London over the weekend? Good luck using SWIFT. With a stablecoin, it takes minutes. “This isn’t about replacing existing systems. It’s about providing an additional option,” FV Bank CEO Miles Paschini told PYMNTS in January. “Where stablecoins offer superior benefits, customers will naturally gravitate toward them.” As more banks integrate blockchain capabilities, customers will have greater choice in transferring value, he said However, regulation is fragmented. The Federal Reserve’s latest stability report calls out nonbank firms, private credit and stablecoins as increasing sources of risk to the traditional banking ecosystem and potential triggers for financial shocks and runs. Meanwhile, the British government reportedly plans to work with U.S. officials to regulate the cryptocurrency industry. As the future plays out, staking could have a key role in helping scale adoption while defining the benefits that crypto could potentially offer. Ultimately, as stablecoins work to shed their niche status and edge toward becoming standard financial infrastructure, the question may no longer be whether they will be used — but who controls the platforms on which they move. The post The Digital Asset Primer: Stablecoin Staking for Payments Professionals appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5019071569739904524",
        "title": "No more window switching: Mastercard’s Agent Pay transforms how enterprises use AI search",
        "url": "https://venturebeat.com/ai/no-more-window-switching-mastercards-agent-pay-transforms-how-enterprises-use-ai-search/",
        "site": "venturebeat.com",
        "time": 1745965492000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard is working with AI companies and banks to allow AI platforms and agents to facilitate transactions. Mastercard is working with AI companies and banks to allow AI platforms and agents to facilitate transactions.Read More",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "1362359637640320847",
        "title": "Mastercard Debuts Agent Pay to Promote ‘Agentic Commerce Future’",
        "url": "https://www.pymnts.com/mastercard/2025/mastercard-debuts-agent-pay-to-promote-agentic-commerce-future/",
        "site": "pymnts.com",
        "time": 1745947712000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "2093084462685007653",
            "7468041131039355486"
        ],
        "description": "Mastercard has launched Agent Pay, its agentic artificial intelligence (AI)-driven payments program. The new offering, announced Tuesday (April 29), introduces Mastercard’s Agentic Tokens, which the company said builds upon tokenization capabilities that power global commerce solutions like mobile contactless payments, along with programmable payments such as recurring expenses and subscriptions. “This helps unlock an agentic […] The post Mastercard Debuts Agent Pay to Promote ‘Agentic Commerce Future’ appeared first on PYMNTS.com. Mastercard has launched Agent Pay, its agentic artificial intelligence (AI)-driven payments program. The new offering, announced Tuesday (April 29), introduces Mastercard’s Agentic Tokens, which the company said builds upon tokenization capabilities that power global commerce solutions like mobile contactless payments, along with programmable payments such as recurring expenses and subscriptions. “This helps unlock an agentic commerce future where consumers and businesses can transact with trust, security, and control,” the company said in a news release. “Mastercard Agent Pay will enhance generative AI conversations for people and businesses alike by integrating trusted, seamless payments experiences into the tailored recommendations and insights already provided on conversational platforms.” That means, the company said, that someone planning a party could chat with an AI agent to curate outfits and accessories or plan a venue. The agent can then make purchases based on that customer’s preferences and feedback, while also recommending the best way to pay. According to the release, Mastercard plans to collaborate with a number of tech companies on the program: Microsoft on new use cases to scale agentic commerce, IBM to accelerate B2B use cases and companies like Braintree and Checkout.com to enhance tokenization capabilities already in use. “The launch of Mastercard Agent Pay marks our initial steps in redefining commerce in the AI era, including new merchant interfaces to distinguish trusted agents from bad actors using agentic technology,” said Jorn Lambert, Mastercard’s chief product officer. “Recognizing the seismic implications of this evolution, we are keen to collaborate with industry players to advance the standards for agentic payments, such as applying the Model Context Protocol to Secure Remote Commerce,” he added. “This lays the foundation for scale and builds trust in agentic commerce.” In other agentic AI news, PYMNTS explored the technology’s use in things like loan underwriting, fraud detection and cross-border payments in a recent interview with TerraPay Co-founder and Chief Operating Officer Ram Sundaram. He noted that while automated decision making and streamlined processes will continue to transform global money movement, there’s still a need for have some human interaction. “Obviously, in the best-case scenario, everything goes smoothly, but when things are not going smoothly, that’s when the customer queries come in,” Sundaram said. It’s not always easy to immediately determine where a transaction is, as company analysts and representatives have to examine logs and query partner systems. “A lot of that work is done manually,” Sundaram said, adding that the agents “know the corridors and the markets that they are working in, but it still takes some time.” The post Mastercard Debuts Agent Pay to Promote ‘Agentic Commerce Future’ appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "2140886814966339408",
        "title": "Mastercard Invests in 3% Stake in Corpay’s Cross-Border Business, Forms Exclusive Agreements",
        "url": "https://www.pymnts.com/partnerships/2025/mastercard-invests-in-3percent-stake-in-corpays-cross-border-business-forms-exclusive-agreements/",
        "site": "pymnts.com",
        "time": 1745936946000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard has invested in a 3% stake in Corpay’s cross-border business, and the two companies have formed exclusive agreements. These moves expand upon the companies’ decades-long collaboration, they said in a Tuesday (April 29) press release. Mastercard invested $300 million in Corpay for a 3% equity stake, resulting in an enterprise valuation of $10.7 billion, […] The post Mastercard Invests in 3% Stake in Corpay’s Cross-Border Business, Forms Exclusive Agreements appeared first on PYMNTS.com. Mastercard has invested in a 3% stake in Corpay’s cross-border business, and the two companies have formed exclusive agreements. These moves expand upon the companies’ decades-long collaboration, they said in a Tuesday (April 29) press release. Mastercard invested $300 million in Corpay for a 3% equity stake, resulting in an enterprise valuation of $10.7 billion, according to the release. In addition, Corpay will be the exclusive provider of currency risk management and integrated large-ticket cross-border payments solutions to Mastercard’s financial institution customers, Mastercard will be the exclusive provider of virtual card programs to Corpay’s customers, and Mastercard Move’s cross-border services will be offered to Corpay’s customers, per the release. Corpay’s cross-border business helps banks, institutional investors and businesses mitigate foreign exchange exposure, while the company’s payments platform and network enable customers to process large ticket and mass payments in more than 160 currencies, according to the release. Mastercard Move provides financial institutions and other customers with reach to more than 10 billion end points in 200 countries; supports delivery channels like bank accounts, mobile wallets, cash-out locations and cards; and supports a number of payment types, per the release. Mastercard Chief Commercial Payments Officer Raj Seshadri said in the release that the expanded partnership will extend the company’s commercial cross-border solutions. “Our work with Corpay expands our reach into the large and growing cross-border B2B payments space helping our financial institution partners deliver on the non-carded needs of their commercial customers, simply and efficiently,” Seshadri said. Corpay Chairman and CEO Ron Clarke said in the release: “We expect Mastercard’s sponsorship of our cross-border solutions will accelerate our financial institution revenue build.” Corpay said in February that its cross-border payments business’ revenue jumped 24% year over year, driven by 43% sales growth in the fourth quarter. The company said it is aggressively expanding its cross-border solutions, leveraging a proprietary network that allows it to compete effectively with banks. Mastercard introduced Mastercard Move Commercial Payments in October, saying this solution enables banks to facilitate commercial cross-border payments that are near real-time, predictable and transparent. The post Mastercard Invests in 3% Stake in Corpay’s Cross-Border Business, Forms Exclusive Agreements appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "8324395792387853341",
        "title": "Mastercard Gives AI Agents the Ability to Shop on Your Behalf",
        "url": "https://www.bloomberg.com/news/articles/2025-04-29/mastercard-gives-ai-agents-the-ability-to-shop-on-your-behalf",
        "site": "bloomberg.com",
        "time": 1745934382000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "-6000218806576075194",
            "-7742227486423189653"
        ],
        "description": "Mastercard Inc. is working with Microsoft Corp. and other leading artificial-intelligence companies to give AI agents the ability to shop online and make payments on behalf of consumers.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-7192465322860737497",
        "title": "Mastercard Stock Q1: Will Tariff Risks Dent Outlook?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/29/mastercard-stock-q1-will-tariff-risks-dent-outlook/",
        "site": "forbes.com",
        "time": 1745920818000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Consensus estimates indicate that revenues are expected to increase by approximately 12% year-over-year to $7.13 billion, while adjusted earnings are anticipated to... Consensus estimates indicate that revenues are expected to increase by approximately 12% year-over-year to $7.13 billion, while adjusted earnings are anticipated to...",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2806748748547963979",
        "title": "Mastercard Foundation to Spend $300 Million on Africa Refugees",
        "url": "https://www.bloomberg.com/news/articles/2025-04-29/mastercard-foundation-to-spend-300-million-on-africa-refugees",
        "site": "bloomberg.com",
        "time": 1745909059000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "The Mastercard Foundation will spend $300 million to help about 500,000 refugees in Africa complete their education, giving them a pathway to jobs. The Mastercard logo.. Photographer: Amir Hamja/Bloomberg",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2648122932722339452",
        "title": "Mastercard Partners With OKX and Nuvei to Power Stablecoin Transactions",
        "url": "https://www.pymnts.com/partnerships/2025/mastercard-partners-with-okx-and-nuvei-to-power-stablecoin-transactions/",
        "site": "pymnts.com",
        "time": 1745874005000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard has partnered with two more companies — OKX and Nuvei — to further its efforts to power stablecoin transactions for consumers and merchants. These partnerships will contribute to Mastercard’s “360-degree approach” to stablecoin use, the company said in a Monday (April 28) press release. In its collaboration with OKX, the two companies will launch […] The post Mastercard Partners With OKX and Nuvei to Power Stablecoin Transactions appeared first on PYMNTS.com. Mastercard has partnered with two more companies — OKX and Nuvei — to further its efforts to power stablecoin transactions for consumers and merchants. These partnerships will contribute to Mastercard’s “360-degree approach” to stablecoin use, the company said in a Monday (April 28) press release. In its collaboration with OKX, the two companies will launch the OKX Card, which will make it easier for users to access their funds, according to the release. They will also explore other opportunities to help people engage with digital assets. The partnership with Nuvei will give merchants the option to receive payments in stablecoins, per the release. “When it comes to blockchain and digital assets, the benefits for mainstream use cases are clear,” Mastercard Chief Product Officer Jorn Lambert said in the release. “To realize its potential, we need to make it as easy for merchants to receive stablecoin payments and for consumers to use them.” These two new partnerships join several others Mastercard has formed around stablecoin use, according to the release. Mastercard’s partnerships encompasses areas like wallet enablement, card issuing and acceptance; differentiated value through cards and beyond; merchant settlement; on-chain remittances; and powering more efficient payments and commerce applications, per the release. “We believe in the potential of stablecoins to streamline payments and commerce across the value chain,” Lambert said in the release. “Unlocking this is core to how we navigate the rapidly changing world, giving people and businesses the freedom they want by providing the choices they deserve.” Stablecoins are increasingly heralded as the bridge between traditional finance and the cryptocurrency world, PYMNTS reported in January. The Federal Reserve Bank of Atlanta said in a report: “The future of stablecoins as a payment method is still unfolding, but as digital assets gain wider acceptance, their adoption could grow, potentially rivaling credit or debit cards.” At the same time, merchant adoption of stablecoins is lagging. The reasons for this include regulatory uncertainty, concerns about fraud and reversibility, technical integration hurdles and the simple inertia of established payment methods. There’s also a user experience gap, as most people are not clamoring for change, especially if it’s more complicated than swiping a card. The post Mastercard Partners With OKX and Nuvei to Power Stablecoin Transactions appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "7784667701942932330",
        "title": "Mastercard Adds Stablecoin Settlement Support for Merchants",
        "url": "https://www.bloomberg.com/news/articles/2025-04-28/mastercard-adds-stablecoin-settlement-support-for-merchants",
        "site": "bloomberg.com",
        "time": 1745873054000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "5037988138376277158"
        ],
        "description": "Mastercard Inc. announced that it will give merchants the option to receive payments in stablecoins amid increasing global regulatory clarity on the digital assets that are usually pegged to fiat currencies. Signage for Mastercard during the Singapore FinTech Festival in Singapore, on Thursday, Nov. 3, 2022. The conference runs through Nov. 4. Photographer: Lionel Ng/Bloomberg",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-3809497897949187681",
        "title": "Visa, Mastercard earnings expected to show solid Y/Y growth amid tariff uncertainty",
        "url": "https://seekingalpha.com/news/4436353-visa-mastercard-earnings-expected-to-show-solid-yy-growth-amid-tariff-uncertainty",
        "site": "seekingalpha.com",
        "time": 1745862817000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "5037988138376277158",
        "title": "Mastercard unveils new stablecoin capability for merchant settlement",
        "url": "https://seekingalpha.com/news/4436386-mastercard-unveils-new-stablecoin-capability-for-merchant-settlement",
        "site": "seekingalpha.com",
        "time": 1745858648000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-8785596386619668677",
        "title": "Sam’s Club Picks Mastercard to Power Bonus Offers Program",
        "url": "https://www.pymnts.com/news/loyalty-and-rewards-news/2025/sams-club-picks-mastercard-power-bonus-offers-program/",
        "site": "pymnts.com",
        "time": 1745853684000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard teamed with Sam’s Club to power the retailer’s Cash Bonus Offers program. The collaboration employs Mastercard’s personalization technology to help Walmart-owned Sam’s Club better communicate appropriate rewards offers to its members, according to a Monday (April 28) press release. “Consumers today demand relevant, convenient and engaging experiences across channels,” Marie Elizabeth Aloisi, executive vice […] The post Sam’s Club Picks Mastercard to Power Bonus Offers Program appeared first on PYMNTS.com. Mastercard teamed with Sam’s Club to power the retailer’s Cash Bonus Offers program. The collaboration employs Mastercard’s personalization technology to help Walmart-owned Sam’s Club better communicate appropriate rewards offers to its members, according to a Monday (April 28) press release. “Consumers today demand relevant, convenient and engaging experiences across channels,” Marie Elizabeth Aloisi, executive vice president for U.S. market development at Mastercard, said in the release. “…With our advanced personalization technology, businesses can boost retention and revenue, while consumers get more value, more efficiently than ever.” Barb Berg, vice president of membership Sam’s Club, said in the release the program is “a perfect example of how we can expand our data-driven consumer engagement to provide relevant and valuable offers that benefit our members.” The partnership is happening as retailers embrace the power of personalization, as Narvar Chief Technology Officer Ram Ravichandran said in an interview with PYMNTS earlier this year. Consumers expect sophistication in their retail experiences, from intuitive chatbots to smart product recommendations to seamless support, Ravichandran said. “On one hand, meeting these lofty standards requires significant investment in data infrastructure, machine learning capabilities and personalization strategies,” he said. “On the other hand, when executed effectively, hyper-personalized experiences offer substantial benefits: higher customer satisfaction; increased average order values; and stronger brand loyalty over the long term.” By providing relevant content, tailored promotions and timely support, businesses can deepen customer trust while building a foundation for sustainable growth. “In essence, customers enjoy frictionless, rewarding interactions, while retailers gain a competitive edge that drives repeat business and positive word-of-mouth in an increasingly crowded marketplace,” Ravichandran said. Meanwhile, Sam’s Club plans to open 15 stores per year, saying its ability to save its members money is even more relevant in times of uncertainty. The chain expects to gain customers as they look to save money. It also plans to renovate all of its locations in the United States, which number about 600. The post Sam’s Club Picks Mastercard to Power Bonus Offers Program appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5294912393973700400",
        "title": "Mastercard CEO says consumers' fears about the economy haven't affected their spending yet: 'They still want to make that trip'",
        "url": "https://www.businessinsider.com/mastercard-ceo-consumer-spending-remains-strong-despite-economy-recession-fears-2025-4",
        "site": "businessinsider.com",
        "time": 1745515722000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Though consumers may have fears about economic uncertainty, they're still spending as usual, according to Mastercard's CEO.PeopleImages/Getty ImagesConsumer confidence levels may be dropping, but consumer spending doesn't reflect it.That's according to Mastercard CEO Michael Miebach, speaking at Semafor's World Economy Summit.\"The consumer today is an empowered consumer that will still stick to what they want to do,\" he said.Consumer confidence has taken a hit amid economic uncertainty, but you wouldn't know it based on current consumer spending figures at one major credit card.Mastercard CEO Michael Miebach said spending hasn't noticeably changed yet in spite of growing anxieties about shifting tariffs, a possible recession, and the weakening dollar.\"The consumer today is an empowered consumer that will still stick to what they want to do,\" Miebach said at Semafor's 2025 World Economy Summit on Wednesday. \"They still want to make that trip.\"Miebach said that while \"soft data\" like headlines and consumer confidence studies would suggest a pullback in consumer spending, there is currently no evidence of that in the real-time spending information that Mastercard monitors.\"The hard data is not reflecting yet where the consumer is,\" he said.In March, for example, he pointed out a 1.4% increase in consumer spending, which he said was \"nothing out of the ordinary.\"\"It's the most asked question that I get and then when I say what I just said. People say there must be something more,\" Miebach said about consumer spending. \"But right now there is not.\"Consumer confidence registered at 92.9 in March, dropping to its lowest level since 2021, according to the Conference Board's latest survey. Wall Street is keeping a watchful eye on consumer sentiment, as a weaker outlook on spending could put a dent in corporate earnings and impact the stock market.Read the original article on Business Insider Though consumers may have fears about economic uncertainty, they're still spending as usual, according to Mastercard's CEO.PeopleImages/Getty ImagesConsumer confidence levels may be dropping, but consumer spending doesn't reflect it.That's according to Mastercard CEO Michael Miebach, speaking at Semafor's World Economy Summit.\"The consumer today is an empowered consumer that will still stick to what they want to do,\" he said.Consumer confidence has taken a hit amid economic uncertainty, but you wouldn't know it based on current consumer spending figures at one major credit card.Mastercard CEO Michael Miebach said spending hasn't noticeably changed yet in spite of growing anxieties about shifting tariffs, a possible recession, and the weakening dollar.\"The consumer today is an empowered consumer that will still stick to what they want to do,\" Miebach said at Semafor's 2025 World Economy Summit on Wednesday. \"They still want to make that trip.\"Miebach said that while \"soft data\" like headlines and consumer confidence studies would suggest a pullback in consumer spending, there is currently no evidence of that in the real-time spending information that Mastercard monitors.\"The hard data is not reflecting yet where the consumer is,\" he said.In March, for example, he pointed out a 1.4% increase in consumer spending, which he said was \"nothing out of the ordinary.\"\"It's the most asked question that I get and then when I say what I just said. People say there must be something more,\" Miebach said about consumer spending. \"But right now there is not.\"Consumer confidence registered at 92.9 in March, dropping to its lowest level since 2021, according to the Conference Board's latest survey. Wall Street is keeping a watchful eye on consumer sentiment, as a weaker outlook on spending could put a dent in corporate earnings and impact the stock market.Read the original article on Business Insider",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "6767885537083963208",
        "title": "Mastercard CEO Sees No Sign of Consumer Spending Slowdown",
        "url": "https://www.pymnts.com/mastercard/2025/mastercard-ceo-sees-no-sign-of-consumer-spending-slowdown/",
        "site": "pymnts.com",
        "time": 1745455064000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "2267612015569932865",
            "6424885829997199345",
            "2587300458158759539",
            "-3133206967283429965"
        ],
        "description": "Mastercard CEO Michael Miebach said the payments giant is not seeing consumer spending slow down despite the consumer sentiment surveys indicating that people are worried about the economy. During a fireside chat at the Semafor World Economy Summit on Wednesday (April 23), he said that “hard data” from Mastercard’s Economics Institute tells a different story. […] The post Mastercard CEO Sees No Sign of Consumer Spending Slowdown appeared first on PYMNTS.com. Mastercard CEO Michael Miebach said the payments giant is not seeing consumer spending slow down despite the consumer sentiment surveys indicating that people are worried about the economy. During a fireside chat at the Semafor World Economy Summit on Wednesday (April 23), he said that “hard data” from Mastercard’s Economics Institute tells a different story. The payments giant, which tracks real-time spending across its network and the broader economy, said it saw a 1.4% increase in consumer spending for March, contrary to what consumer confidence surveys showed. The hard data “is not reflecting where the consumer is,” Miebach said. “The consumer today is an empowered consumer that will still stick to what they want to do.” While consumers may be paring down on how much they’re spending, “they still want to make that trip.” “We don’t see any change at this point,” he added. But if an economic slowdown does come, how will Mastercard cope? Miebach, who took the helm at Mastercard at the start of the pandemic in 2020, said the company’s diversification across services and geographies — it operates in 210 countries and territories — would be a buffer. While Mastercard is known for facilitating the purchasing of goods and services, less known is that it also provides a whole range of services that are “tied to powerful underlying secular trends that have nothing to do with the economy,” Miebach said. One example is cybersecurity, he said. Mastercard is one of the largest providers globally. “Our scenario planning isn’t one of dark clouds,” he added. “Right now, there isn’t a scenario … where this is a dramatic impact on us.” Read more: Report: Visa Offers $100 Million to Get Apple Credit Card Business That Rumor About Apple Pay Miebach was asked if reports that Visa might take over Apple Pay from Mastercard were true. Miebach said he has seen the headlines but flatly denied that Apple is ditching Mastercard: “It’s not happening.” Earlier this month, Visa offered Apple about $100 million to take over Apple Pay from Mastercard, which processed the Goldman Sachs’ Apple credit card. The paper said there is fierce competition not only to take over from Goldman Sachs — among big banks including JPMorgan Chase and Synchrony Financial — but also among the payment networks that process the transactions: Visa and American Express. As for how Mastercard differentiates itself in a crowded digital payments landscape, Miebach acknowledged the explosion of payment options available to consumers today — from cash and cards to stable coins and crypto balances. Miebach said people should think of Mastercard in a different way, not as a business-to-consumer provider. “We power the Sonys and Walmarts with our solutions on the backside,” he explained, claiming, “We love the competition. We love the choices that are now on the market.” Miebach said Mastercard focuses on solving customer problems rather than fixating on competition. For example, for retailers, one pain point is the checkout experience. “Who wants to stand in line, or who wants to have a complicated checkout page on the web?” he asked. Mastercard’s answer to this challenge is biometrics. “If that can work on your phone [and] if that can work on anything, wouldn’t that be wonderful? We created that standard,” Miebach said. By 2030, Mastercard plans to phase out the need to enter card numbers, static passwords and one-time codes for online purchases. It will replace the process with a new one enabled by a combination of tokenization and biometric authentication, to make checkout smoother and more secure. Currently, Mastercard is further retooling its customer experience by leveraging generative artificial intelligence (GenAI). Adding GenAI It had been using machine learning and rules-based AI to process 160 billion transactions through its system. Now, the company is leveraging GenAI for what Miebach calls “agentic commerce” — smart AI agents that know the customer and simplifies things like gathering reward points and applying them to travel planning. The agents will even book the trip. “In the world of agentic commerce, you have a smart agent that knows all your preferences, all of your (credit, debit and loyalty) card balances,” he said. “We enable travel, we enable commerce, and we have a lot of data.” When asked where AI has delivered the most financial impact for Mastercard, Miebach pointed to cybersecurity and fraud management. “Since 2018, we’ve invested $11 billion in keeping our own four walls safe and putting out safety and security products for our customers,” he said. Mastercard’s goal is to save $120 billion in fraud by 2030, in part by using GenAI to scan the dark web for compromised card data and alert banks in real time, analyzing 1 trillion data points. Photo: Mastercard CEO Michael Miebach from livestream The post Mastercard CEO Sees No Sign of Consumer Spending Slowdown appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "3505906297788897142",
        "title": "Vamsy Anne Receives a 2025 Global Recognition Award for Excellence in Cybersecurity and IAM",
        "url": "https://markets.businessinsider.com/news/stocks/vamsy-anne-receives-a-2025-global-recognition-award-for-excellence-in-cybersecurity-and-iam-1034599570",
        "site": "businessinsider.com",
        "time": 1745120424000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Vamsy Anne, a cybersecurity strategist, received a 2025 Global Recognition Award for impactful contributions to IAM and Cybersecurity Governance. His expertise in SailPoint IdentityIQ and Saviynt, combined with a customer-first approach, drove innovation and success at Mastercard, Cigna, Warner Brothers, and Xerox.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-1074733935012714607",
        "title": "Capital One and Discover Can Merge, Regulators Say",
        "url": "https://www.nytimes.com/2025/04/18/business/capital-one-discover-merger.html",
        "site": "nytimes.com",
        "time": 1744998194000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Two regulators signed off on the $35 billion deal, which the banks say will create a competitor to Visa and Mastercard. But consumer advocates warn that the deal may raise costs. The Federal Reserve Board and the Office of the Comptroller of the Currency allowed Capital One to acquire Discover Financial Services in a deal announced in February 2024.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "2104339011676176105",
        "title": "Mastercard and Kraken Team to Promote Crypto Payments in the EU and UK",
        "url": "https://www.pymnts.com/cryptocurrency/2025/mastercard-kraken-team-promote-crypto-payments-europe-united-kingdom/",
        "site": "pymnts.com",
        "time": 1744212760000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "-2758127207196532583",
            "-5637389127424433907"
        ],
        "description": "Cryptocurrency platform Kraken launched a payments-focused partnership with Mastercard. The collaboration will allow Kraken customers in the United Kingdom and Europe to spend crypto assets at more than 150 million merchants that accept Mastercard, according to a Tuesday (April 8) press release. “Crypto is transforming the payments industry, and we envision a future where global […] The post Mastercard and Kraken Team to Promote Crypto Payments in the EU and UK appeared first on PYMNTS.com. Cryptocurrency platform Kraken launched a payments-focused partnership with Mastercard. The collaboration will allow Kraken customers in the United Kingdom and Europe to spend crypto assets at more than 150 million merchants that accept Mastercard, according to a Tuesday (April 8) press release. “Crypto is transforming the payments industry, and we envision a future where global commerce and everyday payments are powered by crypto assets,” Kraken co-CEO David Ripley said in the news release. “Our customers want to be able to easily pay for real-world goods and services with their cryptocurrencies or stablecoins. Our partnership with Mastercard is a major step in realizing this vision. Together, we will unlock the full potential of crypto assets in everyday life, ensuring their long-term relevance and utility.” The partnership follows the January launch of Kraken Pay, a feature that allows for instant, borderless payments in more than 300 cryptocurrencies and fiat currencies, per the release. More than 200,000 Kraken customers use the service. Via its partnership with Mastercard, Kraken will expand its payment offering with the launch of physical and digital debit cards in the weeks ahead, “to bridge the gap between the crypto economy and everyday spending,” the release said. Last month, the Securities and Exchange Commission decided to dismiss its lawsuit against Kraken. The SEC in 2023 had charged Kraken with running an unregistered securities exchange, broker, dealer and clearing agency, while also accusing the company of depriving its investors of “significant protections.” Kraken attributed the move to a change in leadership at the White House and the SEC and said the suit was always without merit. “Instead of engaging in that hard but necessary work, prior leadership at the SEC and throughout the government took a regulation-by-enforcement approach that stifled progress and disadvantaged the U.S. against other countries who fostered innovation through fair and transparent digital asset regulatory regimes,” Kraken said March 3. Meanwhile, PYMNTS wrote Wednesday (April 9) about the importance of added security protocols for the crypto space amid the rise of artificial intelligence agents. The post Mastercard and Kraken Team to Promote Crypto Payments in the EU and UK appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-4919406648969439816",
        "title": "Mastercard and Unipaas Partner on Embedded Payments for Vertical SaaS Platforms",
        "url": "https://www.pymnts.com/partnerships/2025/mastercard-unipaas-partner-embedded-payments-vertical-saas-platforms/",
        "site": "pymnts.com",
        "time": 1743775596000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard and Unipaas partnered to help the providers of vertical software-as-a-service (SaaS) platforms embed modern card processing capabilities. The collaboration aims to digitize and streamline transactions in industries where digital payments remain underused, including health services, education, field services and professional training, the companies said in a Thursday (April 3) press release. “Many [small- to […] The post Mastercard and Unipaas Partner on Embedded Payments for Vertical SaaS Platforms appeared first on PYMNTS.com. Mastercard and Unipaas partnered to help the providers of vertical software-as-a-service (SaaS) platforms embed modern card processing capabilities. The collaboration aims to digitize and streamline transactions in industries where digital payments remain underused, including health services, education, field services and professional training, the companies said in a Thursday (April 3) press release. “Many [small- to medium-sized businesses (SMBs)] using vertical SaaS platforms today still rely on manual, offline payment methods, causing inefficiencies, poor user experiences and lost revenue opportunities,” Unipaas founder and CEO David Avgi said in the release. “Our partnership with Mastercard is about changing that.” By embedding modern card processing capabilities into the platforms used by these SMBs, this partnership will help providers transition their platforms’ users from manual invoicing and bank transfers to card-based payments, improve acceptance rates and transaction speed, reduce operational complexity and overhead, and offer payment options that are more convenient, secure and user-friendly, according to the release. The collaboration brings together Unipaas’ fully embedded, compliant payment infrastructure and Mastercard’s global payment network and fraud protection, per the release. “By leveraging our extensive global network and advanced fraud protection, we are enabling [SMBs] using SaaS platforms to enhance their payment experiences, improve acceptance rates and unlock new opportunities,” George Simon, executive vice president of market development at Mastercard, said in the release. “Together with Unipaas, we are empowering [SMBs] using software providers to scale their operations and drive business growth with confidence.” Embedded finance creates a more streamlined, user-friendly experience and makes payments smooth and accessible, Jennifer Marriner, executive vice president of global acceptance solutions at Mastercard, told PYMNTS in an interview posted in July. “The future of commerce is at the intersection of new technology and digitization,” Marriner said. Optimizing the payment process ensures a streamlined experience for platforms, vendors and customers, and opens up a new revenue stream for the businesses that want to own the payment experience, Avgi told PYMNTS in an interview posted in 2021. “Companies will be the owner of the payment experience,” Avgi said. “They control the flow of funds, and they can monetize payments.” For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Mastercard and Unipaas Partner on Embedded Payments for Vertical SaaS Platforms appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "4329972749184513945",
        "title": "U.S. Transaction Shares for Visa, Mastercard, and Amex",
        "url": "https://www.wsj.com/finance/banking/visa-wanted-a-vast-empire-first-it-had-to-beat-back-its-foes-3b3067f3?mod=article_inline",
        "site": "wsj.com",
        "time": 1743723302000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Following up on the previous item, here’s a WSJ report from October on Visa’s dominant position in the payments industry: Visa, based in San Francisco, has built its network over more than 60 years — going back to clunky manual credit-card readers and carbon-paper copies of receipts. It accounts for around 60% of the total dollar amount of U.S. debit-card purchases and about 50% of U.S. credit-card purchases, according to the Nilson Report, a trade publication. Its closest competitor, Mastercard, accounts for around 22% and 23%, respectively. Visa’s profit totaled $17.3 billion in its 2023 fiscal year, after more than tripling in the last decade. Amex accounts for about 19% of U.S. credit card transactions (and doesn’t support debit), and Discover is down around 3 or 4%. I really thought Visa and Mastercard had comparable market share, but it turns out Visa is far bigger, and it’s Mastercard and Amex that are around the same size. ★ Following up on the previous item, here’s a WSJ report from October on Visa’s dominant position in the payments industry: Visa, based in San Francisco, has built its network over more than 60 years — going back to clunky manual credit-card readers and carbon-paper copies of receipts. It accounts for around 60% of the total dollar amount of U.S. debit-card purchases and about 50% of U.S. credit-card purchases, according to the Nilson Report, a trade publication. Its closest competitor, Mastercard, accounts for around 22% and 23%, respectively. Visa’s profit totaled $17.3 billion in its 2023 fiscal year, after more than tripling in the last decade. Amex accounts for about 19% of U.S. credit card transactions (and doesn’t support debit), and Discover is down around 3 or 4%. I really thought Visa and Mastercard had comparable market share, but it turns out Visa is far bigger, and it’s Mastercard and Amex that are around the same size. ★",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "5217812379060387531",
        "title": "Mastercard and MoneyGram in pact for domestic, cross-border money movement",
        "url": "https://seekingalpha.com/news/4428131-mastercard-and-moneygram-in-pact-for-domestic-cross-border-money-movement",
        "site": "seekingalpha.com",
        "time": 1743610589000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "3855083576030912548",
        "title": "MoneyGram Implements Mastercard Move to Facilitate Digital Money Movement",
        "url": "https://www.pymnts.com/news/cross-border-commerce/cross-border-payments/2025/moneygram-implements-mastercard-move-to-facilitate-digital-money-movement/",
        "site": "pymnts.com",
        "time": 1743559013000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "5217812379060387531"
        ],
        "description": "MoneyGram has implemented Mastercard Move, a portfolio of money transfer solutions, to facilitate digital money movement domestically and across borders. With this integration, MoneyGram customers can use any U.S.-issued Mastercard card to send funds to 38 eligible receiving markets and receive money through nearly 10 billion additional endpoints around the world, the companies said in […] The post MoneyGram Implements Mastercard Move to Facilitate Digital Money Movement appeared first on PYMNTS.com. MoneyGram has implemented Mastercard Move, a portfolio of money transfer solutions, to facilitate digital money movement domestically and across borders. With this integration, MoneyGram customers can use any U.S.-issued Mastercard card to send funds to 38 eligible receiving markets and receive money through nearly 10 billion additional endpoints around the world, the companies said in a Wednesday (April 2) press release emailed to PYMNTS. MoneyGram and Mastercard plan to increase the number of receiving markets and add more cross-border payment capabilities for MoneyGram customers throughout the year, according to the release. “Our expanding global network, present in nearly every country, is one of our most valuable assets,” MoneyGram CEO Anthony Soohoo said in the release. “Through strategic alliances like this, we continue to grow our network, advancing MoneyGram’s mission to make cross-border payments seamless, affordable and secure for everyone.” This combination will provide MoneyGram customers with access to near real-time funding from any U.S.-issued Mastercard; the ability to send funds across borders to bank accounts, mobile wallets, Mastercard cards and cash pickup endpoints; the security of the two companies’ networks; low transaction fees; and greater access to payouts, per the release. “Unlocking more efficient and secure ways to send and receive money is critical for fueling entry into the digital economy,” Chiro Aikat, co-president, United States at Mastercard, said in the release. “By integrating Mastercard Move into MoneyGram’s extensive network, we’re building in speed and added peace of mind into every transaction so that critical funds can get into hands when and where it’s needed.” Mastercard reported during a January earnings call that Mastercard Move transactions leaped 40% year over year in the fourth quarter. The company said March 17 that it began offering its money transfer solutions through Jack Henry’s Rapid Transfers service, allowing for near real-time money movement via Mastercard Move. Alan Marquard, head of transfer solutions at Mastercard, told PYMNTS in an interview posted in March 2024 that in building out Mastercard Move, “We want it to be a comprehensive money transfer offering,” that can be tied to things like payroll cross borders, gaming payments and B2B transactions. The post MoneyGram Implements Mastercard Move to Facilitate Digital Money Movement appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5009251728145831628",
        "title": "Report: Visa Offers $100 Million to Get Apple Credit Card Business",
        "url": "https://www.pymnts.com/credit-cards/2025/report-visa-offers-100-million-to-get-apple-credit-card-business/",
        "site": "pymnts.com",
        "time": 1743556243000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Visa reportedly offered Apple about $100 million to get the tech giant’s credit card business, which is held by Mastercard. The offer came as the payment network and rival American Express are trying to win the Apple card business, and Mastercard is fighting to keep it, The Wall Street Journal (WSJ) reported Tuesday (April 1), […] The post Report: Visa Offers $100 Million to Get Apple Credit Card Business appeared first on PYMNTS.com. Visa reportedly offered Apple about $100 million to get the tech giant’s credit card business, which is held by Mastercard. The offer came as the payment network and rival American Express are trying to win the Apple card business, and Mastercard is fighting to keep it, The Wall Street Journal (WSJ) reported Tuesday (April 1), citing unnamed sources. Reached by PYMNTS, a Visa spokesperson said the company does not comment on rumors or speculation. The Apple card business is in play because the bank behind it, Goldman Sachs, is exiting the consumer lending sector, according to the WSJ report. While Apple is looking for a new bank, it plans to select a payment network first, the report said. The payment networks are competing for the business because not only is Apple one of the biggest co-branded credit card programs — with about $20 billion in balances — but the company plays a growing role in many consumers’ payments and other financial needs, per the report. Apple debuted its credit card in 2019 in conjunction with Goldman Sachs and Mastercard, PYMNTS reported at the time. At launch, key features of the card included no fees, daily cash-back rewards, and the ability to sign up for the card with an iPhone in the Wallet app and get the card within minutes, issued straight to the phone. It was reported in July 2023 that Goldman Sachs’ credit card partnership with Apple could be nearing an end, and that the banking giant was in discussions with American Express to take over the credit card and other collaborations between Goldman and Apple. Goldman had announced plans in late 2022 to scale back its consumer banking offerings, though its agreement with Apple remained untouched at the time. In January, it was reported that Apple was in talks with Barclays and credit card issuer Synchrony Financial to replace Goldman Sachs. Goldman Sachs CEO David Solomon said at the time that while the bank had a contract with Apple to run the partnership until 2030, there was a possibility that it could end before then. The bank was narrowing its strategic focus and exiting some businesses. The post Report: Visa Offers $100 Million to Get Apple Credit Card Business appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-913378975066164833",
        "title": "Sources: Visa has offered Apple ~$100M to become the network for the Apple Card; Amex is also competing, while Mastercard tries to keep its role as the network (AnnaMaria Andriotis/Wall Street Journal)",
        "url": "http://www.techmeme.com/250401/p34#a250401p34",
        "site": "techmeme.com",
        "time": 1743539656000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ma"
        ],
        "similar_stories": [
            "-5009251728145831628",
            "7601480423194153701"
        ],
        "description": "AnnaMaria Andriotis / Wall Street Journal: Sources: Visa has offered Apple ~$100M to become the network for the Apple Card; Amex is also competing, while Mastercard tries to keep its role as the network — Visa, Amex and Mastercard are all competing to be the network for Apple's credit card — Visa has offered Apple …",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "7601480423194153701",
        "title": "Visa, American Express seek to swipe Apple credit card from Mastercard - report",
        "url": "https://seekingalpha.com/news/4427715-visa-american-express-seek-to-swipe-apple-credit-card-from-mastercard---report",
        "site": "seekingalpha.com",
        "time": 1743538675000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "196815625132421694",
        "title": "How Mastercard is building the Venmo of crypto",
        "url": "https://www.businessinsider.com/mastercard-building-venmo-crypto-blockchain-digital-assets-2025-3",
        "site": "businessinsider.com",
        "time": 1743499741000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ma"
        ],
        "description": "From JPMorgan to the everyday American, here's how Mastercard wants to build the payments network of the future. Mastercard is building its next-generation payments network on blockchain.Getty/Hannah Smith/ESPAT MediaMastercard is building out its blockchain and crypto capabilities for consumers and finance firms.Recent regulatory shifts and Wall Street warming up to the space have given the industry momentum.Mastercard's blockchain leader walks us through his playbook for seizing the moment.As political tailwinds lift the crypto industry, Mastercard hopes to cash in on a bet it started years ago.The payments giant is looking to replicate its massive card network for the blockchain world to create a way for consumers, merchants, and financial institutions to transact digital assets. Doing so will require engineering leg work, regulatory support, key partnerships, and getting Wall Street buy-in. It would also insert Mastercard as a critical digital-asset infrastructure provider for the growing industry, creating a competitive moat similar to what it has built in the payments space over the past 60 years.\"We bring the scale and reach that we have to the space for the money to flow between the two worlds in a simple way,\" Raj Dhamodharan, Mastercard's executive vice president of blockchain and digital assets, said of traditional finance and decentralized finance.\"What is missing in this is a fully compliant framework and consumer experience offered on chain, like how you do Venmo and Zelle today in the US domestically,\" he added.Raj Dhamodharan, Mastercard's executive vice president of blockchain and digital assets.MastercardBringing a Venmo-like experience to moving money and other assets via blockchain won't be easy, and financial institution adoption will be critical. As with any network, the value of the network increases as more users join. Mastercard, for its part, is targeting banks to join its crypto-focused network, the Multi-Token Network, to expand its functionality. So far, Mastercard has made in-roads with JPMorgan and Standard Chartered to develop new use cases, like cross-border payments and tokenizing deposits and carbon credits.\"Some of the players in the traditional financial world are interested in moving into this base because of the benefits the technology offers and the new business models it can create,\" Dhamodharan said.A two-pronged crypto playbookFor consumers, the payments giant wants to enable its 3.5 billion cardholders worldwide to move money and transact between the fiat and crypto worlds. Mastercard has introduced more than 100 different crypto-focused card programs globally, such as credit cards, prepaid cards, and rewards cards, where users get crypto instead of cashback.\"This flow of capital and spending power from the consumer side is essential to the success of this entire sector,\" Dhamodharan said.Traditional Wall Street firms represent another opportunity for Mastercard, especially as real-world assets increasingly become tokenized or represented digitally on blockchain. Dhamodharan said he wants to provide a way to process blockchain-based transactions for trade finance and cross-border payments.Digital assets, such as cryptocurrencies, NFTs, and tokenized assets, require a different set of back-end tooling than traditional assets. Digital assets use a decentralized, public ledger that sits across a network rather than the centralized private ledger most banks use to keep track of money movement.Historically, this infrastructure disconnect and regulatory uncertainty made it tricky for traditional financial firms to access crypto, which presented business opportunities in custody, trading, and wealth management. For banks and asset managers, crypto offered some upside in round-the-clock transaction settlements, simplifying the escrow process for home buyers and streamlining money movements between accounts.\"Mastercard has made a sizable bet on this,\" Dhamodharan said of Mastercard's research and development and startup-focused efforts.Since 2015, the payments firm has filed more than 250 unique patents related to blockchain and digital-asset technology, an effort that involves filing and maintenance fees and employing specialized legal and R&D teams. It also has supported 43 blockchain startups since 2021 through its startup accelerator program. While the firm declined to share how much its digital-asset team has grown over the years, it is growing. Mastercard has eight open roles, some fetching as much as $348,000 in annual pay, geared to blockchain across software engineering, product, legal, and regulatory disciplines.Building the next foundationMastercard's multi-token network, which launched in 2023 and is the foundation of its strategy, will enable financial institutions to access and build on the chain.A November 2024 integration with JPMorgan's blockchain business unit improved the speed of settling cross-border transactions by making it available 24/7, streamlining a process that typically takes days to coordinate across time zones. Last year Mastercard also worked with Standard Chartered Bank in Hong Kong to test paying for carbon credits in a tokenized form. A February partnership with Ondo Finance, a fintech that tokenizes money market funds and treasuries on-chain, is helping Mastercard to make institutional financial assets available digitally.It's a fast-moving and dynamic time to be in crypto, Dhamodharan said. That's a change of pace from the retreat the industry saw in 2022, when a few high-profile crypto blowups — like the stunning collapse of trading platform FTX, the wipeout of the algorithmic stablecoin TerraUSD, and the fallout of the overleveraged hedge fund Three Arrows Capital — threw cold water on the industry.Tailwinds are coming from Washington, DC in the form of regulatory clarity, the lack of which largely held back traditional financial institutions from going all in on crypto. Regulators under the new administration are paving the way for crypto players, from the SEC to the OCC. The crypto ecosystem has been busy building more public blockchains, developing more protocols to run on those chains, and tokenizing more assets to be traded on-chain, Dhamodharan said.Read the original article on Business Insider",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-6046441340816925779",
        "title": "Mastercard Sets Sights Beyond Retail as It Embeds BNPL Into Network",
        "url": "https://www.pymnts.com/buy-now-pay-later/2025/mastercard-sets-sights-beyond-retail-as-it-embeds-bnpl-into-network/",
        "site": "pymnts.com",
        "time": 1743494578000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "The buy now, pay later pure plays like Klarna and Affirm might get a lot of attention these days. However, card networks have a piece of the BNPL pie as well. From apparel to electronics to medical bills, today’s shoppers increasingly expect a flexible payment solution at checkout, and for that, no company worth its […] The post Mastercard Sets Sights Beyond Retail as It Embeds BNPL Into Network appeared first on PYMNTS.com. The buy now, pay later pure plays like Klarna and Affirm might get a lot of attention these days. However, card networks have a piece of the BNPL pie as well. From apparel to electronics to medical bills, today’s shoppers increasingly expect a flexible payment solution at checkout, and for that, no company worth its salt can afford to miss out on the revenue and the customer experience. The trend certainly has attracted attention at Mastercard. As part of the “Pay Later Unpacked” virtual event at PYMNTS, Seema Chibber, executive vice president of Core Products for the Americas, shared insights into how Mastercard aims to integrate installment and BNPL features more deeply into its network infrastructure, the company’s partnership-driven approach, and the potential to expand BNPL into verticals beyond retail. Asked about Mastercard’s overarching vision for installments and how it supports the company’s network role, Chibber underscored the need for versatile solutions that fit a rapidly changing ecosystem. “We’ve literally seen an explosion in the preference for installments,” she said. “And when you put it all together — people seeking expanded buying power, control and financial management, and the flexibility and convenience of a digital experience — we had to be ahead of this trend. That is why we’ve been investing in capabilities that are versatile, so whether it’s a buy now, pay later option offered by a FinTech, a traditional issuer’s credit program or a debit-based solution, Mastercard is embedding installments right into the payments experience.” Following the Consumer Central to this approach is Mastercard’s commitment to evolving its payments infrastructure to accommodate shifting consumer tastes. The company’s installments strategy is not a side project or temporary add-on, Chibber said. Rather, it is a suite of capabilities woven into the broader network, offering seamless integration for businesses and consistent, familiar experiences for end users. Mastercard has worked to ensure that its rules, franchise governance, security protocols and settlement guarantees fully align with installment-based transactions, she said. By providing a unified ecosystem that can accept, process and secure installment payments, Mastercard aims to alleviate technical hurdles for merchants and financial institutions. Partnerships are key to achieving this scale. Whether the company works with Affirm or established financial institutions like J.P. Morgan, Galileo and other acquirers, Mastercard’s guiding principle is a “partner-first” framework, Chibber said. Because “no one size fits all” in BNPL, Mastercard has built a broad set of tools — APIs, rule frameworks and security protocols — that can be adapted to each partner’s unique requirements. The goal is to provide universal acceptance of BNPL while respecting that a global retailer’s priorities may be different from those of a local healthcare provider and that a large financial institution’s requirements differ from a technology startup’s. Mastercard’s emphasis on partnership also informs how it plans to expand BNPL into new verticals. Although many consumers first encountered installments at retail checkouts for electronics or clothing, the company sees strong potential for growth in areas like healthcare, professional services and B2B transactions, Chibber said. Large-ticket items — like hospital bills or small business expenses — are prime candidates for installment plans. However, bringing BNPL to these “alternate industries” can introduce new challenges around acceptance infrastructure and technology integration, she said. Mastercard’s tactic is to use the foundation of its payment franchise: secure interoperability, guaranteed settlement and robust rules. These features give verticals such as healthcare and professional services “comfort to embark on building out their acceptance infrastructures, riding off of the promise of the franchise of Mastercard,” Chibber said. Responsible Growth Amid industry discussions about credit risk and rising scrutiny of BNPL offerings, Mastercard’s philosophy is to grow responsibly, she said. The company has historically adhered to regulatory requirements in every region where it operates. Its BNPL product suite is no exception. Mastercard must conform to local lending and credit regulations, and it sets franchise rules that establish baseline standards for safety, transparency and consumer protection. “We strictly comply with regulatory requirements,” Chibber said, acknowledging that some partners may be more conservative in risk management than others. “But the credibility of the Mastercard promise is critical. And as the regulatory landscape evolves, we’ll continue to honor these obligations.” Looking ahead, Chibber said she sees the future of BNPL, installments and payments more broadly converging into a seamless, embedded experience — one that removes friction for users and merchants. In describing a blueprint for the next generation of payment flexibility, she highlighted Mastercard’s move toward innovations such as tokenization, biometric authentication and, in particular, the Mastercard One Credential. This new offering could let a single credential link to multiple payment options — credit, debit, BNPL — giving consumers a unified profile at checkout and minimizing the need to toggle between different accounts or financing offers. “Embedded is the way to go,” she said. “The consumer won’t accept friction or separate siloed journeys. It’s going to be more connected, more invisible, more convenient.” Chibber’s perspective reveals a network embracing a fluid ecosystem in which digital commerce blends with embedded finance. As BNPL matures and seeks opportunities beyond consumer retail, Mastercard’s unified approach — folding installments into the core network, using franchise rules, emphasizing partner collaboration and adopting emerging technologies — aims to meet the demand for flexible, transparent payments. Companies in industries from healthcare to home improvement to B2B distribution — the thinking goes — may soon view BNPL as standard rather than novel, just another payment option with the safety net of a major network behind it. The post Mastercard Sets Sights Beyond Retail as It Embeds BNPL Into Network appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "6089512516863899453",
        "title": "Mastercard Launches Program to Fuel Greater Adoption of Virtual Cards",
        "url": "https://www.pymnts.com/news/b2b-payments/2025/mastercard-launches-program-to-fuel-greater-adoption-of-virtual-cards/",
        "site": "pymnts.com",
        "time": 1743444594000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard says it has launched a program to boost the adoption of virtual cards. The effort, announced in a news release Monday (March 31), is powered by the company’s advances in virtual card number (VCN) technology, aimed at “delivering seamless and consumer-like commercial payments.” The release notes that Mastercard is already working with enterprise resource planning (ERP) platforms […] The post Mastercard Launches Program to Fuel Greater Adoption of Virtual Cards appeared first on PYMNTS.com. Mastercard says it has launched a program to boost the adoption of virtual cards. The effort, announced in a news release Monday (March 31), is powered by the company’s advances in virtual card number (VCN) technology, aimed at “delivering seamless and consumer-like commercial payments.” The release notes that Mastercard is already working with enterprise resource planning (ERP) platforms to automate end-corporate users’ workflows with VCNs. “Other platform-partners range from working capital providers to expense tools, meeting and events technology providers, and hotel booking platforms,” the release added. “This has streamlined the implementation of virtual cards into corporate workflows.” Starting April 1, the company said, banks using Mastercard’s VCN technology can enable their platform-partners that have enrolled in a new program to fuel the use of embedded consumer-like experiences in commercial payments. “Banks will benefit from scalability and have access to more embedded payments opportunities,” the company said, while their platform partners will be able to offer embedded payments “with reduced integration effort.” Corporate users, Mastercard said, will get a chance to provide “an easier, consumer-like payment experience with fewer clicks.” The company’s effort comes amid a surge in virtual card issuance, and a corresponding effort by banks, FinTechs, companies and brands to get those cards into the market. As PYMNTS wrote last month, this trend illustrates the way these cards are helping build new eCommerce ecosystems for businesses and consumers. “The purely digital flow, from card design to issuance to use, underpins new payment experiences,” that report said. “For the banks and the brands launching card products, the platform approach shortens the time to market to introduce, say, a BNPL card or a B2B-focused instrument that tailors spend management across a supply chain.” The ongoing embrace of credentials and program management that platforms use to manage compliance and risk remains a growth engine for the enablers, as cards and credentials are offered in real time. And the benefits of these cards gaining wider recognition. “In just one example, PYMNTS Intelligence found in December that, among middle-market companies — defined as firms with annual sales of between $50 million to $1 billion — 56% of executives using virtual cards have cited the improvements in working capital management as among the key advantages of using those cards,” the report added. “Yet the market is virtually untapped, as the data shows that just 3.3% of North American Growth Corporates use virtual cards.” For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Mastercard Launches Program to Fuel Greater Adoption of Virtual Cards appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-85753407713112472",
        "title": "Will Mastercard Stock Fall To $320 On Recession Concerns?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/03/27/will-mastercard-stock-fall-to-320-on-recession-concerns/",
        "site": "forbes.com",
        "time": 1743069600000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ma"
        ],
        "description": "This strong showing was fueled by better-than-expected Q4 2024 results, driven by increased payment and cross-border volumes. This strong showing was fueled by better-than-expected Q4 2024 results, driven by increased payment and cross-border volumes.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "7575558995828377756",
        "title": "Mastercard Teams With Jack Henry to Speed Money Transfers",
        "url": "https://www.pymnts.com/partnerships/2025/mastercard-teams-with-jack-henry-to-speed-money-transfers/",
        "site": "pymnts.com",
        "time": 1742239669000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard has begun offering its money transfer solutions through Jack Henry’s Rapid Transfers service. The partnership, announced Monday (March 17) is designed to allow for “near-real time” money movement via Mastercard Move. By “near-real time,” the companies mean that transaction approvals will depend on the payment and receiving financial networks in question, and that actual fund availability will depend […] The post Mastercard Teams With Jack Henry to Speed Money Transfers appeared first on PYMNTS.com. Mastercard has begun offering its money transfer solutions through Jack Henry’s Rapid Transfers service. The partnership, announced Monday (March 17) is designed to allow for “near-real time” money movement via Mastercard Move. By “near-real time,” the companies mean that transaction approvals will depend on the payment and receiving financial networks in question, and that actual fund availability will depend on the receiving financial institution. The partnership comes on the heels of Jack Henry’s digital payment partnership with Moov, focused on banks and credit union services to consumers and small and medium-sized businesses (SMBs). “Integrating Mastercard Move into Jack Henry Rapid Transfers is an important step in our efforts to modernize digital payments,” Jack Henry President and CEO Greg Adelson said in the announcement. “We are committed to empower banks and credit unions with innovative technologies that enable them to serve at the center of their relationships with account holders.” According to the release, Jack Henry Rapid Transfers will have benefits that include the ability to move money between accounts at different financial institutions without delays. Jack Henry announced a similar partnership with Visa’s Visa Direct last month. “The near-real time availability of funds will also lend itself to account opening capabilities, as well as offer a variety of payment options for Jack Henry’s commercial customers,” said Chiro Aikat, Mastercard’s U.S. co-president. “Together, we’re creating a two-way street, allowing customers to both send and receive money — ultimately facilitating greater access to the digital economy.” In other real-time payments news, PYMNTS spoke recently with Daniel Stanton, managing director and global head of Transactional FX at Bank of America. He said that as banks shift to real-time payment networks, bringing faster payments capabilities to corporate clients will be a long-term project. “It’s a journey that we’re undertaking, and not only from the standpoint of a financial institution but in the FinTech arena as well,” he said in an interview published Monday. “It’s a joint journey toward building out our capabilities and enhancing or even redesigning our infrastructures … to get out of the thought process of ‘9 to 5’ and to operate on a 24/7 wavelength.” For businesses working with Bank of America, said Stanton, the advantages of real-time payments lie in greater control over when their beneficiary is paid — and how they’re paid, which in turn means that the sender can have an easier time managing their working capital. The post Mastercard Teams With Jack Henry to Speed Money Transfers appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-8585145820608958230",
        "title": "Mastercard and ICBA Team to Strengthen Community Bank Card Programs",
        "url": "https://www.pymnts.com/news/banking/2025/mastercard-and-icba-team-to-strengthen-community-bank-card-programs/",
        "site": "pymnts.com",
        "time": 1742233440000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard has teamed with ICBA Payments, payments subsidiary of the Independent Community Bankers of America. The alliance is designed to help community banks modernize their card programs and offer enhanced payment services, according to a Monday (March 17) news release. “Today, we’re not only upgrading payments but also investing in the future of our local communities,” ICBA Payments CEO Jacob […] The post Mastercard and ICBA Team to Strengthen Community Bank Card Programs appeared first on PYMNTS.com. Mastercard has teamed with ICBA Payments, payments subsidiary of the Independent Community Bankers of America. The alliance is designed to help community banks modernize their card programs and offer enhanced payment services, according to a Monday (March 17) news release. “Today, we’re not only upgrading payments but also investing in the future of our local communities,” ICBA Payments CEO Jacob Eisen said in the release. “By partnering with Mastercard, we’re equipping our member banks with innovative, secure, and cost-effective solutions that empower them to support and grow the neighborhoods they serve. Together, we are paving the way for stronger local economies and enduring customer relationships.” According to the release, Mastercard will handle all cardholder communication and marketing, providing “custom-curated joint marketing assets” to help improve cardholder activity for ICBA Payments’ member banks. For its part, ICBA will upgrade its sponsored card programs to Mastercard and “feature contactless plastics, tokenization to digital wallets, and industry standard 8-digit BINs and business BIN optimization,” the release added. “At Mastercard, we believe that the heart of economic progress lies in the strength of local communities,” Marie Elizabeth Aloisi, executive vice president, U.S. Market Development, Mastercard, said in the release. “This is where we share like-minded values with ICBA Payments, working to bring more people and businesses into the digital economy.” The partnership comes at a time when small to medium-sized businesses (SMBs) are increasingly turning to community banks and credit unions (CUs). Research by PYMNTS Intelligence shows that 23% of SMBs choose local banks or CUs, compared to 58% who went with larger national banks. This trend shifts, however, for rural and lower-revenue businesses. Rural SMBs, for example, were more likely to choose local institutions (49%), with just a quarter of these businesses banking with national banks. As PYMNTS wrote earlier this month, these financial institutions are making the switch for greater personalized service and local engagement, but find that community banks and credit unions’ digital offerings fall short compared to national banks. Many SMBs report higher satisfaction with features like fraud prevention and customer service from smaller FIs, yet the digital experience remains an area of concern. “Local banks’ digital platforms often do not meet the same standards as those of larger banks, leaving SMBs less satisfied with online banking services,” PYMNTS wrote. “To compete more effectively, community banks and CUs will need to enhance their digital platforms to match the expectations of SMBs, especially those with higher revenue or growing digital needs.” The post Mastercard and ICBA Team to Strengthen Community Bank Card Programs appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "3148915473225905030",
        "title": "Mastercard and Virgin Money Team to Expand UK Open Banking",
        "url": "https://www.pymnts.com/news/banking/2025/mastercard-and-virgin-money-team-to-expand-uk-open-banking/",
        "site": "pymnts.com",
        "time": 1742209125000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "British bank Virgin Money has launched an open banking-focused partnership with Mastercard. The collaboration will let Virgin Money customers view all their credit card and current account balances and transactions from any provider on the company’s credit card app, Virgin Money said in a news release provided to PYMNTS Monday (March 17). The solution, powered […] The post Mastercard and Virgin Money Team to Expand UK Open Banking appeared first on PYMNTS.com. British bank Virgin Money has launched an open banking-focused partnership with Mastercard. The collaboration will let Virgin Money customers view all their credit card and current account balances and transactions from any provider on the company’s credit card app, Virgin Money said in a news release provided to PYMNTS Monday (March 17). The solution, powered by Mastercard’s open banking technology, lets Virgin Money’s 6.6 million U.K. customers manage their accounts in a single and convenient place, the release added. “Open banking is an exciting opportunity to make it easier for people to manage their finances, and we’re delighted to work with Mastercard to introduce and evolve this feature for over two million credit card customers who interact with us digitally every month,” said Katherine Lovell, head of unsecured lending at Virgin Money. Virgin Money, one of England’s largest retail banks, was acquired last year by the country’s Nationwide Building Society in a $2.7 billion deal. In other open banking news, PYMNTS wrote last week about the rise of pay by bank as a payment method in consumer-facing sectors. It’s a method that — while in its early stages — is already helping merchants reduce cart abandonment, bolster their data security and lower transaction costs. The PYMNTS Intelligence report “Cost Concerns Hinder Merchants’ Pay-by-Bank Adoption — but Current Payments Could Cost More” found that in spite of worries about cost and complexity, pay by bank could be more cost-effective than traditional payment methods such as credit and debit cards. “Consumer-facing companies that have adopted pay by bank are seeing advantages, according to the report,” PYMNTS wrote. “All the companies surveyed reported lower cart abandonment rates, highlighting their effectiveness in keeping customers engaged. Additionally, 80% of businesses using pay by bank said enhanced data security for their customers was a benefit.” Ease of use for customers — something noted by 80% of respondents — was another critical factor in boosting pay by bank’s popularity. These benefits are particularly key in sectors like retail, grocery, betting, ridesharing, telecommunications and utilities, where user experience and security are high priorities. “Despite the benefits, cost concerns remain a barrier to the wider adoption of pay by bank,” PYMNTS added. “According to the report, 78% of companies that have yet to implement pay by bank expressed worries about the potential costs involved. This concern is valid, given the upfront expenses required for system integration and customer education. However, many businesses may not fully realize that the cost of continuing with traditional card-based payment methods can be substantial.” The post Mastercard and Virgin Money Team to Expand UK Open Banking appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-3798919316807124051",
        "title": "Mastercard on track to end its six-session decline",
        "url": "https://seekingalpha.com/news/4420844-mastercard-on-track-to-end-its-six-session-decline",
        "site": "seekingalpha.com",
        "time": 1741980143000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ma"
        ],
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-1755811301573501826",
        "title": "CredibleX to Integrate Mastercard’s Small Business Credit Analytics",
        "url": "https://www.pymnts.com/smbs/2025/crediblex-to-integrate-mastercards-small-business-credit-analytics/",
        "site": "pymnts.com",
        "time": 1741896237000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "CredibleX said Wednesday (March 12) that it will integrate Mastercard’s Small Business Credit Analytics (SBCA) into its embedded financing platform. This integration will enable CredibleX to improve financial inclusion for small to medium-sized businesses (SMBs) across the United Arab Emirates (UAE), the companies said in a Wednesday press release. SBCA can provide performance data about […] The post CredibleX to Integrate Mastercard’s Small Business Credit Analytics appeared first on PYMNTS.com. CredibleX said Wednesday (March 12) that it will integrate Mastercard’s Small Business Credit Analytics (SBCA) into its embedded financing platform. This integration will enable CredibleX to improve financial inclusion for small to medium-sized businesses (SMBs) across the United Arab Emirates (UAE), the companies said in a Wednesday press release. SBCA can provide performance data about a small business, with the consent of the business, to lenders to help them assess the business’s financial performance and retail sales, according to the release. For CredibleX, this data will help it make more informed lending decisions, reduce underwriting time and enhance risk management, the release said. With a more comprehensive evaluation of a business’s financial health at its disposal, the firm will be able to help SMBs secure better loan terms and access higher credit amounts. For small businesses, the partnership of CredibleX and Mastercard will enhance and simplify their access to financing, helping them overcome the barriers they often face because of a limited credit history or lack of formal documentation, per the release. “By combining CredibleX’s expertise in lending with Mastercard’s advanced analytics, we are setting a new benchmark for data-driven [SMB] financing in the region,” CredibleX Co-founder and Chief Product Officer Hassan Reda said in the release. Selin Bahadirli, executive vice president, services, EEMEA at Mastercard, said in the release: “Together, we aim to empower [SMBs] with better credit access, improved loan terms and enhanced opportunities for growth.” CredibleX raised $55 million in a seed round in December, saying it aims to grow and broaden it embedded finance solutions for SMBs. The company’s solutions are designed for the UAE’s SMB sector and integrate into the SMBs’ daily operations. At the time, CredibleX had 37 embedded partners as well as debt/securitization providers. In August, CredibleX partnered with Fracxn to provide SMBs with access to a variety of financing solutions. The companies said at the time that Fracxn’s instant financing solutions for SMBs would be added to the financial solutions offered by CredibleX. Solutions enabled by the collaboration of CredibleX and Fracxn include receivables financing, revenue-based financing, payables financing, and buy now, pay later (BNPL) for business. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post CredibleX to Integrate Mastercard’s Small Business Credit Analytics appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "5671336409709973703",
        "title": "Mastercard and Visa Pledge Vigilance Following Gambling Investigation",
        "url": "https://www.pymnts.com/credit-cards/2025/mastercard-visa-pledge-vigilance-following-gambling-investigation/",
        "site": "pymnts.com",
        "time": 1741618217000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Mastercard and Visa are probing claims that illegal gambling websites facilitated deposits through their networks. An investigation into the sites found that Mastercard and Visa were failing to prevent their networks from being used for those transactions, The Guardian reported last week. The investigation — by the group Investigate Europe — found that Mastercard was […] The post Mastercard and Visa Pledge Vigilance Following Gambling Investigation appeared first on PYMNTS.com. Mastercard and Visa are probing claims that illegal gambling websites facilitated deposits through their networks. An investigation into the sites found that Mastercard and Visa were failing to prevent their networks from being used for those transactions, The Guardian reported last week. The investigation — by the group Investigate Europe — found that Mastercard was offered as a payment method on nine casino and live sports betting websites targeting customers in the United Kingdom, while Visa was listed on two, per the report. The findings were part of a broader examination of a network of gambling sites operating in Europe despite being outlawed. A spokesperson for Mastercard told PYMNTS the company has “zero tolerance” for illegal activity on its network and is investigating the sites in question. Mastercard has no direct relationship with the merchants, and the payments were made via an acquirer. “Acquirers are responsible for performing due diligence on their customers and ensuring the merchant is properly registered on our network, and acts lawfully, including obtaining and maintaining the required regulatory licenses to operate in all jurisdictions they do business,” the spokesperson said. “Acquirers also must ensure their customers fully comply with Mastercard rules and to never use the network for transactions prohibited by applicable law.” Visa did not reply to PYMNTS’ request for comment. A Visa spokesperson told The Guardian the company would also be investigating the reports, adding that it has “no direct relationship with merchants” but works with partners to terminate merchants offering illegal services, and “constantly invests” in “best-in-class technology” to ensure compliance. Meanwhile, the gambling sector is getting a payments-centric makeover as sportsbooks and online gaming platforms compete for player loyalty. After sports betting was legalized throughout the United States, payments remained a hurdle, as issuing banks tended to block gambling-related transactions, Zak Cutler, president of global gaming at Paysafe, told PYMNTS last month. Even after gaming was legalized, approval rates remained low. Over time, however, major financial institutions began to recognize the legitimacy of online sports betting, bringing transaction approval rates from single digits to more than 90% at major banks at current rates. “Fast forward five years, and we’ve gone from very few ways to pay — with a ton of friction — to a well-optimized space with a variety of payment methods,” Cutler said. The post Mastercard and Visa Pledge Vigilance Following Gambling Investigation appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-2275594754413610350",
        "title": "Mastercard’s Haque on Women in Entrepreneurship Trends",
        "url": "https://www.bloomberg.com/news/videos/2025-03-07/mastercard-s-haque-on-women-in-entrepreneurship-trends-video",
        "site": "bloomberg.com",
        "time": 1741336977000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Khatija Haque, Mastercard’s Chief Economist for Eastern Europe, Middle East and Africa, speaks with Bloomberg TV’s Paul Allen on the Horizons Middle East and Africa show about the appetite, barriers and opportunities for women business leaders across Eastern Europe, MENA and the African continent. (Source: Bloomberg)",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "-5017742347533279480",
        "title": "Visa and Mastercard Accused of Card Monopoly by UK Watchdog",
        "url": "https://www.pymnts.com/antitrust/2025/visa-mastercard-accused-card-monopoly-united-kingdom-payment-systems-regulator/",
        "site": "pymnts.com",
        "time": 1741272081000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "Visa and Mastercard face regulatory action in the United Kingdom following a payments watchdog’s investigation. The Payment Systems Regulator (PSR) is considering “remedies” for the two companies after uncovering a lack of competition in the card payment market, according to a Thursday (March 6) press release. “Cards are a popular and convenient way to make […] The post Visa and Mastercard Accused of Card Monopoly by UK Watchdog appeared first on PYMNTS.com. Visa and Mastercard face regulatory action in the United Kingdom following a payments watchdog’s investigation. The Payment Systems Regulator (PSR) is considering “remedies” for the two companies after uncovering a lack of competition in the card payment market, according to a Thursday (March 6) press release. “Cards are a popular and convenient way to make payments in the U.K., so any issues in the card market can have a negative impact on … businesses and ultimately consumers,” PSR Managing Director David Geale said in the release. “We have found that there is a lack of competition in the market and evidence that Mastercard and Visa might have been able to charge U.K. businesses millions of pounds more than they would in a properly competitive market, impacting on their ability to invest and grow.” The findings showed that Visa and Mastercard face “ineffective competitive constraints” in supplying scheme and processing services to acquirers and merchants, the release said. Fees have jumped by at least 25% since 2017, costing U.K. businesses at least an extra 170 million pounds (about $219 million) per year. The companies have not offered “sufficiently clear and detailed information” on fees, leading to worsening outcomes for merchants and acquirers, especially in terms of raising their costs, per the release. “They then have little choice but to either pass these increased costs onto consumers or incur the costs themselves, impacting their ability to invest,” the release said. Reached for comment by PYMNTS, a Visa spokesperson said the company’s fees reflect the “immense value” the company provides merchants, consumers and financial institutions. “This includes extremely high levels of security and fraud prevention, near-perfect operational resilience and reliability, and a wide range of consumer protections and high-quality products and services that serve consumer and merchant needs,” the company said. “Through our investments, the U.K. has been a global pioneer in payments technology.” Mastercard did not reply to PYMNTS’ request for comment. The PSR’s action came as Mastercard’s and Visa’s place in the marketplace is being called into question elsewhere. For example, November brought a report that the European Commission was investigating whether the companies’ “scheme fees” were harming retailers. Also in November, the Senate Judiciary Committee convened a hearing on Visa’s and Mastercard’s fees, with Sen. Dick Durbin of Illinois, then-chair of the committee, accusing the companies of having a “stranglehold” on the credit card market. The post Visa and Mastercard Accused of Card Monopoly by UK Watchdog appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "4079606004434902958",
        "title": "Visa and Mastercard face regulatory ‘remedies’ over lack of competition",
        "url": "https://www.ft.com/content/a6145cab-3af5-42f6-83e0-6718d6563abd",
        "site": "ft.com",
        "time": 1741250820000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "ma"
        ],
        "description": "UK payments regulator says card duopoly’s sharp fee increases are costing businesses £170mn",
        "tickers": [
            "ma"
        ]
    },
    {
        "id": "3317121044040596989",
        "title": "Mastercard Ramps Up AI-Driven Offensive Against Scams",
        "url": "https://www.pymnts.com/news/security-and-risk/2025/mastercard-ramps-up-ai-driven-offensive-against-scams/",
        "site": "pymnts.com",
        "time": 1741078940000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ma"
        ],
        "description": "A chain is only as strong as its weakest link. The bigger the chain, the more important its security becomes. The adage has taken a new meaning in 21st-century payments innovation, where forward-thinking financial players are leaning into advanced cybersecurity measures to protect consumers and drive financial inclusion. Collaborations that enhance security and accessibility are […] The post Mastercard Ramps Up AI-Driven Offensive Against Scams appeared first on PYMNTS.com. A chain is only as strong as its weakest link. The bigger the chain, the more important its security becomes. The adage has taken a new meaning in 21st-century payments innovation, where forward-thinking financial players are leaning into advanced cybersecurity measures to protect consumers and drive financial inclusion. Collaborations that enhance security and accessibility are likely to set new industry standards, particularly within security-critical areas like digital transactions. “The world is expanding so rapidly from a digital point of view,” Johan Gerber, executive vice president and head of security solutions at Mastercard, told PYMNTS. “There is this massive opportunity in the digitization of economies and what that could mean for financial inclusion by bringing more and more people into the digital economy.” “But we can only do so if we make sure your first interaction on a digital platform is not one where you get abused or scammed,” Gerber added. “That first experience can’t be a bad one. It has to be good and secure.” Cybercriminals often target vulnerable users who may not be digitally literate, and for financial inclusion to be successful, trust is critical. Financial institutions are responding by investing heavily in cybersecurity technologies, with artificial intelligence-driven solutions gaining traction for their predictive and adaptive capabilities. Financial Inclusion Requires Cybersecurity As digital financial services become increasingly prevalent, from mobile banking to digital wallets, ensuring the security and integrity of these systems is paramount. As payments continue to evolve, so too will threats. This drive for inclusion is at the heart of Mastercard’s mission to bring 1 billion people into the digital economy, Gerber said, adding that Mastercard’s partnership with Feedzai, announced Feb. 18, introduces AI-driven, real-time analytics into the equation and allows for immediate action when consumers make transactions, offering an added layer of protection against scams. “We have intelligence from our network,” he said. “This is a huge amount of data of all the known frauds. We work with banks to understand fraud patterns, see the transactions.” One of the unique advantages of the Feedzai partnership is the ability to connect the dots between different financial institutions, Gerber said. Traditional fraud detection systems often operate in isolation, limiting their effectiveness when transactions occur across multiple banks. “If I combine my broad network view with your deep customer view, we can be way more intelligent,” he said. “And now we can provide decisions not just to the bank who’s sending money, but also the bank who’s receiving money.” The Future of Fraud Defense Is Global and Collective For consumers, the promise of safer transactions and increased access to financial services marks a step forward, Gerber said. For Mastercard and Feedzai, the partnership represents an opportunity to drive innovation while contributing to a more inclusive financial ecosystem. This holistic approach is particularly critical as fraud tactics vary by geography. In the United Kingdom, authorized push payment (APP) fraud is an issue, while in Southeast Asia, SMS phishing scams are more prevalent. Feedzai’s localized implementation model enables Mastercard to tailor its cybersecurity strategies to regional threats, enhancing their effectiveness. “Fraud scams specifically, we talk about it being a $1 trillion problem,” Gerber said. A standout aspect of the partnership is its potential to address emerging threats like deepfakes and AI-driven scams. As cybercriminals use technology to create more sophisticated scams, Mastercard aims to stay ahead by integrating innovative solutions into its platform, he said. “What we want to do with this platform is start inviting players to come talk to us,” Gerber said. “If you’ve got a really good solution to help fight deepfakes, we want to build that intelligence into the platform and make it accessible.” The partnership also reflects a broader shift toward a multilayered approach to combating fraud. By collaborating with social media platforms, telco providers and other industry players, Mastercard is building a resilient ecosystem capable of responding to a wide array of threats, he said. “This is going to be multiple layers of things over time,” Gerber said. “But creating these infrastructure plays where everybody can benefit, I think it’s helping to create real scale alongside so many other different players who are all focused on solving this problem.” For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. The post Mastercard Ramps Up AI-Driven Offensive Against Scams appeared first on PYMNTS.com.",
        "tickers": [
            "ma"
        ]
    }
]