[
    {
        "id": "-134545605665259475",
        "title": "Sunoco's offer for Parkland backed by proxy advisory firms ISS, Glass Lewis",
        "url": "https://seekingalpha.com/news/4458471-sunocos-offer-for-parkland-backed-by-proxy-advisory-firms-iss-glass-lewis",
        "site": "seekingalpha.com",
        "time": 1750088602000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1835660661230818715",
        "title": "IBM, Goldman Sachs, Nike and Cisco lead way as Dow runs up 300-point gain",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=bafde220-a349-4134-88e5-d901ee466045&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1750081803000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2299587540302819460",
        "title": "IBM's new quantum supercomputer just sent its stock to an all-time high",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=321d3f3a-12a7-4272-9ea7-c2423d11ee00&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1749591373000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "414698244537618972",
        "title": "IBM’s stock set a new all-time high. This was the latest spark.",
        "url": "https://www.marketwatch.com/story/ibms-stock-set-a-new-all-time-high-this-was-the-latest-spark-0c88f76b?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1749590460000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "The tech company’s shares were up 1.5% at the closing bell Tuesday after it unveiled plans for a large-scale, fault-tolerant quantum computer.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1865946147567577936",
        "title": "10 dividend stocks to watch ahead of this week's inflation reports | $DVY $IBM $CSCO $PEP $TXN",
        "url": "https://seekingalpha.com/news/4456967-10-dividend-stocks-to-watch-ahead-of-this-weeks-inflation-reports",
        "site": "seekingalpha.com",
        "time": 1749578069000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-27468376251030609",
        "title": "Quantum computing stocks mixed after IBM unveils plans to make new quantum computer",
        "url": "https://seekingalpha.com/news/4456943-quantum-computing-stocks-mixed-after-ibm-unveils-plans-to-make-new-quantum-computer",
        "site": "seekingalpha.com",
        "time": 1749571742000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2386660281597101700",
        "title": "IBM announces new quantum processor, plan for Starling supercomputer by 2029",
        "url": "https://www.cnbc.com/2025/06/10/ibm-quantum-processor-starling-supercomputer.html",
        "site": "cnbc.com",
        "time": 1749570456000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Part of the company's plan involves the new IBM Quantum Nighthawk processor, which is set to release later this year.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2415981445330674912",
        "title": "IBM hits record high as company shows off new quantum computer",
        "url": "https://seekingalpha.com/news/4456923-ibm-hits-record-high-as-company-shows-off-new-quantum-computer",
        "site": "seekingalpha.com",
        "time": 1749565392000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-842459737228480454",
        "title": "IBM Starling: 20,000X Faster Than Today’s Quantum Computers",
        "url": "https://www.forbes.com/sites/johnkoetsier/2025/06/10/ibm-starling-20000x-faster-than-todays-quantum-computers/",
        "site": "forbes.com",
        "time": 1749560997000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "“We really have a path to make this viable in this timescale.\" IBM will have a fully fault tolerant large-scale quantum computer by 2029 ... “We really have a path to make this viable in this timescale.\" IBM will have a fully fault tolerant large-scale quantum computer by 2029 ...",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2138863052327826735",
        "title": "IBM is now detailing what its first quantum compute system will look like",
        "url": "https://arstechnica.com/science/2025/06/ibm-is-now-detailing-what-its-first-quantum-compute-system-will-look-like/",
        "site": "arstechnica.com",
        "time": 1749559863000,
        "favicon_url": "https://static.tickertick.com/website_icons/arstechnica.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Company is moving past focus on qubits, shifting to functional compute units. On Tuesday, IBM released its plans for building a system that should push quantum computing into entirely new territory: a system that can both perform useful calculations while catching and fixing errors and be utterly impossible to model using classical computing methods. The hardware, which will be called Starling, is expected to be able to perform 100 million operations without error on a collection of 200 logical qubits. And the company expects to have it available for use in 2029. Perhaps just as significant, IBM is also committing to a detailed description of the intermediate steps to Starling. These include a number of processors that will be configured to host a collection of error-corrected qubits, essentially forming a functional compute unit. This marks a major transition for the company, as it involves moving away from talking about collections of individual hardware qubits and focusing instead on units of functional computational hardware. If all goes well, it should be possible to build Starling by chaining a sufficient number of these compute units together. \"We're updating [our roadmap] now with a series of deliverables that are very precise,\" IBM VP Jay Gambetta told Ars, \"because we feel that we've now answered basically all the science questions associated with error correction and it's becoming more of a path towards an engineering problem.\"Read full article Comments",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4154758719860922777",
        "title": "The Download: IBM’s quantum computer, and cuts to military AI testing",
        "url": "https://www.technologyreview.com/2025/06/10/1118372/the-download-ibms-quantum-computer-and-cuts-to-military-ai-testing/",
        "site": "technologyreview.com",
        "time": 1749557400000,
        "favicon_url": "https://static.tickertick.com/website_icons/technologyreview.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "4945865202586182723",
            "-27468376251030609",
            "-2415981445330674912",
            "-842459737228480454"
        ],
        "description": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. IBM aims to build the world’s first large-scale, error-corrected quantum computer by 2028 The news: IBM announced detailed plans today to build an error-corrected quantum computer with significantly more computational capability than existing… This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. IBM aims to build the world’s first large-scale, error-corrected quantum computer by 2028 The news: IBM announced detailed plans today to build an error-corrected quantum computer with significantly more computational capability than existing machines by 2028. It hopes to make the computer available to users via the cloud by 2029. What is it? The proposed machine, named Starling, will consist of a network of modules, each of which contains a set of chips, housed within a new data center in Poughkeepsie, New York.Why it matters: IBM claims Starling will be a leap forward in quantum computing. In particular, the company aims for it to be the first large-scale machine to implement error correction. If Starling achieves this, IBM will have solved arguably the biggest technical hurdle facing the industry today. Read the full story. —Sophia Chen The Pentagon is gutting the team that tests AI and weapons systems The Trump administration’s chainsaw approach to federal spending lives on, even as Elon Musk turns on the president. As part of a string of moves, Secretary of Defense Pete Hegseth has cut the size of the Office of the Director of Operational Test and Evaluation in half. The group was established in the 1980s after criticisms that the Pentagon was fielding weapons and systems that didn’t perform as safely or effectively as advertised. Hegseth is reducing the agency’s staff to about 45, down from 94, and firing and replacing its director. It is a significant overhaul of a department that in 40 years has never before been placed so squarely on the chopping block. Here’s how defense tech companies stand to gain (and the rest of us may stand to lose). —James O’Donnell This story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here. The must-reads I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology. 1 Conspiracy theories are spreading about the LA protestsMisleading photos and videos are circulating on social media. (NYT $)+ Donald Trump has vowed to send 700 Marines to the city. (The Guardian)+ Waymo has paused its service in downtown LA after its vehicles were set alight. (LA Times $) 2 RFK Jr has fired an entire CDC panel of vaccine expertsThe anti-vaccine advocate accused them of conflicts of interest. (Ars Technica)+ He claims that their replacements will “exercise independent judgment.” (WSJ $)+ RFK Jr is interested in using a toxic bleach solution to treat ailments. (Wired $)+ How measuring vaccine hesitancy could help health professionals tackle it. (MIT Technology Review) 3 A new covid variant is spreading across Europe and the USWhile it’s considered low risk, ‘Nimbus’ appears to be more infectious. (Wired $) 4 White House security cautioned against installing Starlink internetBut Elon Musk’s team ignored them and fitted the service in the complex anyway. (WP $)+ Trump isn’t planning on getting rid of it, though. (Bloomberg $) 5 Developers are underwhelmed by Apple’s AI effortsIts WWDC announcements haven’t been met with much enthusiasm. (WSJ $)+ The company is opening up its AI models to developers for the first time. (FT $)+ Where’s the overhauled, AI-powered Siri we were promised? (TechCrunch) 6 Meta is assembling a new AI research labResearchers will be tasked with beating its rivals to achieve superintelligence. (Bloomberg $)+ There’s no doubt that Meta is feeling the heat right now. (The Information $) 7 Vulnerable minors are increasingly becoming radicalized onlineThe sad case of Rhianan Rudd illustrates the ease of access to extremist material. (FT $) 8 Our nerves may play a central role in how cancer spreadsResearchers believe they may help tumors to grow. (New Scientist $)+ Why it’s so hard to use AI to diagnose cancer. (MIT Technology Review) 9 An end is in sight for the video game actors’ strikeMajor labels have reached a tentative deal with the SAG-AFTRA. (Variety $)+ How Meta and AI companies recruited striking actors to train AI. (MIT Technology Review) 10 The UK is planning a robotaxi trial next nextMany years behind other countries. (FT $) Quote of the day “At the end of the day, what they need to do is deliver on what they presented a year ago.” —Bob O’Donnell, chief analyst at Technalysis Research, tells Reuters where Apple went wrong with its lacklustre WWDC announcements. One more thing The great AI consciousness conundrumAI consciousness isn’t just a devilishly tricky intellectual puzzle; it’s a morally weighty problem with potentially dire consequences that philosophers, cognitive scientists, and engineers alike are currently grappling with.Fail to identify a conscious AI, and you might unintentionally subjugate a being whose interests ought to matter. Mistake an unconscious AI for a conscious one, and you risk compromising human safety and happiness for the sake of an unthinking, unfeeling hunk of silicon and code.Over the past few decades, a small research community has doggedly attacked the question of what consciousness is and how it works. The effort has yielded real progress. And now, with the rapid advance of AI technology, these insights could offer our only guide to the untested, morally fraught waters of artificial consciousness. Read the full story. —Grace Huckins We can still have nice things A place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet ’em at me.) + Rest in power Sly Stone, truly one of the funky greats.+ Did you know there’s an Olympics for scaffolding? Well, you do now.+ Just one man is responsible for some of the greatest film artwork of all time—Drew Struzan.+ That’s one dramatic pizza maker.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "6961447391413383060",
        "title": "IBM plans to build IBM Quantum Starling, a \"fault-tolerant\" quantum computer with 20,000x the power of today's quantum computers, in New York state by 2029 (Wall Street Journal)",
        "url": "http://www.techmeme.com/250610/p9#a250610p9",
        "site": "techmeme.com",
        "time": 1749552301000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Wall Street Journal: IBM plans to build IBM Quantum Starling, a “fault-tolerant” quantum computer with 20,000x the power of today's quantum computers, in New York state by 2029 — The powerhouse computers can be sensitive and error-prone. Now, IBM is offering some details on how it will overcome …",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1520358308821806667",
        "title": "IBM sets path to build fault-tolerant quantum computer by 2029",
        "url": "https://seekingalpha.com/news/4456771-ibm-sets-path-to-build-fault-tolerant-quantum-computer-by-2029",
        "site": "seekingalpha.com",
        "time": 1749551100000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6680314865055995470",
        "title": "IBM discloses plans to build first large-scale fault-tolerant quantum computer",
        "url": "https://venturebeat.com/business/ibm-discloses-plans-to-build-first-large-scale-fault-tolerant-quantum-computer/",
        "site": "venturebeat.com",
        "time": 1749549600000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM unveiled plans for the world’s first large-scale, fault-tolerant quantum computer, with scalable quantum computing. IBM unveiled plans for the world’s first large-scale, fault-tolerant quantum computer, with scalable quantum computing.Read More",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "605663828513574087",
        "title": "IBM aims to build the world’s first large-scale, error-corrected quantum computer by 2028",
        "url": "https://www.technologyreview.com/2025/06/10/1118297/ibm-large-scale-error-corrected-quantum-computer-by-2028/",
        "site": "technologyreview.com",
        "time": 1749549600000,
        "favicon_url": "https://static.tickertick.com/website_icons/technologyreview.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "5798458041240077431",
            "2299587540302819460",
            "-2531305492141798044",
            "2386660281597101700",
            "-94500911619514951",
            "2138863052327826735",
            "-9042770773102366999",
            "-1520358308821806667",
            "-6680314865055995470"
        ],
        "description": "IBM announced detailed plans today to build an error-corrected quantum computer with significantly more computational capability than existing machines by 2028. It hopes to make the computer available to users via the cloud by 2029. The proposed machine, named Starling, will consist of a network of modules, each of which contains a set of chips,… IBM announced detailed plans today to build an error-corrected quantum computer with significantly more computational capability than existing machines by 2028. It hopes to make the computer available to users via the cloud by 2029. The proposed machine, named Starling, will consist of a network of modules, each of which contains a set of chips, housed within a new data center in Poughkeepsie, New York. “We’ve already started building the space,” says Jay Gambetta, vice president of IBM’s quantum initiative. IBM claims Starling will be a leap forward in quantum computing. In particular, the company aims for it to be the first large-scale machine to implement error correction. If Starling achieves this, IBM will have solved arguably the biggest technical hurdle facing the industry today to beat competitors including Google, Amazon Web Services, and smaller startups such as Boston-based QuEra and PsiQuantum of Palo Alto, California. IBM, along with the rest of the industry, has years of work ahead. But Gambetta thinks it has an edge because it has all the building blocks to build error correction capabilities in a large-scale machine. That means improvements in everything from algorithm development to chip packaging. “We’ve cracked the code for quantum error correction, and now we’ve moved from science to engineering,” he says. Correcting errors in a quantum computer has been an engineering challenge, owing to the unique way the machines crunch numbers. Whereas classical computers encode information in the form of bits, or binary 1 and 0, quantum computers instead use qubits, which can represent “superpositions” of both values at once. IBM builds qubits made of tiny superconducting circuits, kept near absolute zero, in an interconnected layout on chips. Other companies have built qubits out of other materials, including neutral atoms, ions, and photons. Quantum computers sometimes commit errors, such as when the hardware operates on one qubit but accidentally also alters a neighboring qubit that should not be involved in the computation. These errors add up over time. Without error correction, quantum computers cannot accurately perform the complex algorithms that are expected to be the source of their scientific or commercial value, such as extremely precise chemistry simulations for discovering new materials and pharmaceutical drugs. But error correction requires significant hardware overhead. Instead of encoding a single unit of information in a single “physical” qubit, error correction algorithms encode a unit of information in a constellation of physical qubits, referred to collectively as a “logical qubit.” Currently, quantum computing researchers are competing to develop the best error correction scheme. Google’s surface code algorithm, while effective at correcting errors, requires on the order of 100 qubits to store a single logical qubit in memory. AWS’s Ocelot quantum computer uses a more efficient error correction scheme that requires nine physical qubits per logical qubit in memory. (The overhead is higher for qubits performing computations for storing data.) IBM’s error correction algorithm, known as a low-density parity check code, will make it possible to use 12 physical qubits per logical qubit in memory, a ratio comparable to AWS’s. One distinguishing characteristic of Starling’s design will be its anticipated ability to diagnose errors, known as decoding, in real time. Decoding involves determining whether a measured signal from the quantum computer corresponds to an error. IBM has developed a decoding algorithm that can be quickly executed by a type of conventional chip known as an FPGA. This work bolsters the “credibility” of IBM’s error correction method, says Neil Gillespie of the UK-based quantum computing startup Riverlane. However, other error correction schemes and hardware designs aren’t out of the running yet. “It’s still not clear what the winning architecture is going to be,” says Gillespie. IBM intends Starling to be able to perform computational tasks beyond the capability of classical computers. Starling will have 200 logical qubits, which will be constructed using the company’s chips. It should be able to perform 100 million logical operations consecutively with accuracy; existing quantum computers can do so for only a few thousand. The system will demonstrate error correction at a much larger scale than anything done before, claims Gambetta. Previous error correction demonstrations, such as those done by Google and Amazon, involve a single logical qubit, built from a single chip. Gambetta calls them “gadget experiments,” saying “They’re small-scale.” Still, it’s unclear whether Starling will be able to solve practical problems. Some experts think that you need a billion error-corrected logical operations to execute any useful algorithm. Starling represents “an interesting stepping-stone regime,” says Wolfgang Pfaff, a physicist at the University of Illinois Urbana-Champaign. “But it’s unlikely that this will generate economic value.” (Pfaff, who studies quantum computing hardware, has received research funding from IBM but is not involved with Starling.) The timeline for Starling looks feasible, according to Pfaff. The design is “based in experimental and engineering reality,” he says. “They’ve come up with something that looks pretty compelling.” But building a quantum computer is hard, and it’s possible that IBM will encounter delays due to unforeseen technical complications. “This is the first time someone’s doing this,” he says of making a large-scale error-corrected quantum computer. IBM’s road map involves first building smaller machines before Starling. This year, it plans to demonstrate that error-corrected information can be stored robustly in a chip called Loon. Next year the company will build Kookaburra, a module that can both store information and perform computations. By the end of 2027, it plans to connect two Kookaburra-type modules together into a larger quantum computer, Cockatoo. After demonstrating that successfully, the next step is to scale up and connect around 100 modules to create Starling. This strategy, says Pfaff, reflects the industry’s recent embrace of “modularity” when scaling up quantum computers—networking multiple modules together to create a larger quantum computer rather than laying out qubits on a single chip, as researchers did in earlier designs. IBM is also looking beyond 2029. After Starling, it plans to build another, Blue Jay. (“I like birds,” says Gambetta.) Blue Jay will contain 2000 logical qubits and is expected to be capable of a billion logical operations.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5638557541229439610",
        "title": "AI has these founders in a New York state of mind",
        "url": "https://www.businessinsider.com/nyc-tech-week-ai-openai-thriving-2025-6",
        "site": "businessinsider.com",
        "time": 1749546001000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "A panel on AI and quantum startup investing in New York at IBM's office in Manhattan.Samantha Stokes/BINew York City is emerging as a major player in AI and tech innovation, rivaling San Francisco.The city's tech ecosystem spans fintech, healthtech, legal tech, and consumer startups.State support includes AI training for employees and a $16.5 million AI supercomputer.Move over, San Francisco.The West Coast city has long reigned supreme in tech innovation — and that's certainly been true during the AI transformation that's overtaken the industry over the last few years. But this year at New York Tech Week, the city's startup and tech community had a message to deliver: New York isn't just ready to get in on the game when it comes to AI. It's already a big player.\"When it comes to New York, you have the whole spectrum to invest in. You have ecosystems, agents, and apps,\" said Emily Fontaine, IBM's global head of venture capital, speaking on a panel discussion about venture capital investing in AI and quantum startups in New York on June 2.While many big AI companies like OpenAI and Anthropic are headquartered in San Francisco, OpenAI has a new NYC outpost, and the city is already a stronghold when it comes to fintech, healthtech, legal tech, and consumer startups, all of which AI innovations are transforming. These signs show the city is already in the big leagues when it comes to developing and retaining AI talent, those in the NYC tech community say.Fontaine added that not only does the NYC tech community include the entire AI tech ecosystem, but it's also home to founders and startups laser-focused on their product and working hard to get to the revenue stage — something she's excited about as an investor and that she doesn't always see when comparing AI startups in San Francisco.Fontaine said she was especially interested in New York entrepreneurs taking on AI apps, AI legal and contracts, and AI security startups.One of her co-panelists at the IBM event, president and CEO of Tech:NYC Julie Samuels, said that she was excited about AI infrastructure and AI healthcare startups coming out of New York.\"People don't come to New York to live in a group house and code all night and never see anyone else,\" Samuels said in a nod to San Francisco's famous \"Hacker Houses.\"She added that the New York tech community was special because people participate in various arts and culture invites unrelated to their companies.\"New Yorkers hire,\" she said. \"People want to live here, have always wanted and will continue to want to live here.\"Tech Week participants were similarly excited about the Big Apple's push into AI. Throughout the week, multiple event attendees told BI reporters either that they had relocated from San Francisco to New York or that they preferred NYC.\"I want to make it the biggest startup ecosystem in the world,\" Somya Gupta, who cofounded an AI education startup Context, said of NYC. \"SF, we're coming for you!\"State and local governments are supporting New York's AI push. New York Gov. Kathy Hochul, at an Axios panel, announced plans to use AI to train 100,000 state employees in offices such as the DMV. Additionally, New York is building a $16.5 million AI supercomputer at the University at Albany.Many AI startups are also headquartered in New York.Affiniti, which is building AI agents that act like CFOs for small businesses, announced a $17 million Series A in May. Healthcare AI copilot Navina announced it raised $55 million in March. Legora, which uses AI to help lawyers draft and review contracts, announced it raised $80 million in May. And Series, an AI social network for young professionals, announced it landed a $3.1 pre-seed round in April.Read the original article on Business Insider A panel on AI and quantum startup investing in New York at IBM's office in Manhattan.Samantha Stokes/BINew York City is emerging as a major player in AI and tech innovation, rivaling San Francisco.The city's tech ecosystem spans fintech, healthtech, legal tech, and consumer startups.State support includes AI training for employees and a $16.5 million AI supercomputer.Move over, San Francisco.The West Coast city has long reigned supreme in tech innovation — and that's certainly been true during the AI transformation that's overtaken the industry over the last few years. But this year at New York Tech Week, the city's startup and tech community had a message to deliver: New York isn't just ready to get in on the game when it comes to AI. It's already a big player.\"When it comes to New York, you have the whole spectrum to invest in. You have ecosystems, agents, and apps,\" said Emily Fontaine, IBM's global head of venture capital, speaking on a panel discussion about venture capital investing in AI and quantum startups in New York on June 2.While many big AI companies like OpenAI and Anthropic are headquartered in San Francisco, OpenAI has a new NYC outpost, and the city is already a stronghold when it comes to fintech, healthtech, legal tech, and consumer startups, all of which AI innovations are transforming. These signs show the city is already in the big leagues when it comes to developing and retaining AI talent, those in the NYC tech community say.Fontaine added that not only does the NYC tech community include the entire AI tech ecosystem, but it's also home to founders and startups laser-focused on their product and working hard to get to the revenue stage — something she's excited about as an investor and that she doesn't always see when comparing AI startups in San Francisco.Fontaine said she was especially interested in New York entrepreneurs taking on AI apps, AI legal and contracts, and AI security startups.One of her co-panelists at the IBM event, president and CEO of Tech:NYC Julie Samuels, said that she was excited about AI infrastructure and AI healthcare startups coming out of New York.\"People don't come to New York to live in a group house and code all night and never see anyone else,\" Samuels said in a nod to San Francisco's famous \"Hacker Houses.\"She added that the New York tech community was special because people participate in various arts and culture invites unrelated to their companies.\"New Yorkers hire,\" she said. \"People want to live here, have always wanted and will continue to want to live here.\"Tech Week participants were similarly excited about the Big Apple's push into AI. Throughout the week, multiple event attendees told BI reporters either that they had relocated from San Francisco to New York or that they preferred NYC.\"I want to make it the biggest startup ecosystem in the world,\" Somya Gupta, who cofounded an AI education startup Context, said of NYC. \"SF, we're coming for you!\"State and local governments are supporting New York's AI push. New York Gov. Kathy Hochul, at an Axios panel, announced plans to use AI to train 100,000 state employees in offices such as the DMV. Additionally, New York is building a $16.5 million AI supercomputer at the University at Albany.Many AI startups are also headquartered in New York.Affiniti, which is building AI agents that act like CFOs for small businesses, announced a $17 million Series A in May. Healthcare AI copilot Navina announced it raised $55 million in March. Legora, which uses AI to help lawyers draft and review contracts, announced it raised $80 million in May. And Series, an AI social network for young professionals, announced it landed a $3.1 pre-seed round in April.Read the original article on Business Insider",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8487627087087716967",
        "title": "IBM on track to end seventh straight session in the green",
        "url": "https://seekingalpha.com/news/4456624-ibm-on-track-to-end-seventh-straight-session-in-the-green",
        "site": "seekingalpha.com",
        "time": 1749495250000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7126265343753574972",
        "title": "Red Hat Taps APAC with Open-Source AI, Hybrid Cloud",
        "url": "https://www.eetimes.com/red-hat-taps-apac-with-open-source-ai-hybrid-cloud/",
        "site": "eetimes.com",
        "time": 1749492040000,
        "favicon_url": "https://static.tickertick.com/website_icons/eetimes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Red Hat launches AI Inference Server, enhancing hybrid cloud flexibility in APAC. The post Red Hat Taps APAC with Open-Source AI, Hybrid Cloud appeared first on EE Times. Red Hat",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5336725534965365005",
        "title": "Famed Short Seller Jim Chanos Is Betting Against Used Car Retailer Carvana And AI Losers Like IBM",
        "url": "https://www.forbes.com/sites/sergeiklebnikov/2025/06/05/short-seller-jim-chanos-is-betting-against-used-car-retailer-carvana-and-ai-losers-like-ibm/",
        "site": "forbes.com",
        "time": 1749158113000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "The most successful short seller on the planet has new targets in his sights that he says are massively overvalued. The most successful short seller on the planet has new targets in his sights that he says are massively overvalued.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-9098583254478728677",
        "title": "Quanex Building Products Non-GAAP EPS of $0.60 beats by $0.13, revenue of $452.48M beats by $13.18M",
        "url": "https://seekingalpha.com/news/4455991-quanex-building-products-non-gaap-eps-of-0_60-beats-by-0_13-revenue-of-452_48m-beats-by",
        "site": "seekingalpha.com",
        "time": 1749154821000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4236218079578049480",
        "title": "BitMine Immersion prices $18M stock offering, uplists on NYSE American",
        "url": "https://seekingalpha.com/news/4455750-bitmine-immersion-prices-18m-stock-offering-uplists-on-nyse-american",
        "site": "seekingalpha.com",
        "time": 1749120748000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4121920442134247362",
        "title": "IBM Said to Have Pursued Informatica Ahead of Salesforce Deal",
        "url": "https://www.bloomberg.com/news/articles/2025-06-05/ibm-said-to-have-pursued-informatica-ahead-of-salesforce-deal",
        "site": "bloomberg.com",
        "time": 1749084819000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "International Business Machines Corp. pursued Informatica Inc. before Salesforce Inc. bought the software company for $8 billion last month, according to people familiar with the matter. The Informatica headquarters in Redwood City, California, US, on Monday, April 29, 2024. Informatica Inc. is scheduled to release earrings figures on May 1. Photographer David Paul Morris/Bloomberg Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3485117014025320247",
        "title": "Customizing An LLM Tailored Specifically For VHDL Code And Design Of High Performance Processors (IBM)",
        "url": "https://semiengineering.com/customizing-an-llm-tailored-specifically-for-vhdl-code-and-design-ibm/",
        "site": "semiengineering.com",
        "time": 1748985014000,
        "favicon_url": "https://static.tickertick.com/website_icons/semiengineering.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "A new technical paper titled “Customizing a Large Language Model for VHDL Design of High-Performance Microprocessors” was published by researchers at IBM. Abstract “The use of Large Language Models (LLMs) in hardware design has taken off in recent years, principally through its incorporation in tools that increase chip designer productivity. There has been considerable discussion... » read more The post Customizing An LLM Tailored Specifically For VHDL Code And Design Of High Performance Processors (IBM) appeared first on Semiconductor Engineering. A new technical paper titled “Customizing a Large Language Model for VHDL Design of High-Performance Microprocessors” was published by researchers at IBM. Abstract “The use of Large Language Models (LLMs) in hardware design has taken off in recent years, principally through its incorporation in tools that increase chip designer productivity. There has been considerable discussion about the use of LLMs in RTL specifications of chip designs, for which the two most popular languages are Verilog and VHDL. LLMs and their use in Verilog design has received significant attention due to the higher popularity of the language, but little attention so far has been given to VHDL despite its continued popularity in the industry. There has also been little discussion about the unique needs of organizations that engage in high-performance processor design, and techniques to deploy AI solutions in these settings. In this paper, we describe our journey in developing a Large Language Model (LLM) specifically for the purpose of explaining VHDL code, a task that has particular importance in an organization with decades of experience and assets in high-performance processor design. We show how we developed test sets specific to our needs and used them for evaluating models as we performed extended pretraining (EPT) of a base LLM. Expert evaluation of the code explanations produced by the EPT model increased to 69% compared to a base model rating of 43%. We further show how we developed an LLM-as-a-judge to gauge models similar to expert evaluators. This led us to deriving and evaluating a host of new models, including an instruction-tuned version of the EPT model with an expected expert evaluator rating of 71%. Our experiments also indicate that with the potential use of newer base models, this rating can be pushed to 85% and beyond. We conclude with a discussion on further improving the quality of hardware design LLMs using exciting new developments in the Generative AI world.” Find the technical paper here. May 2025. Dupuis, Nicolas, Ravi Nair, Shyam Ramji, Sean McClintock, Nishant Chauhan, Priyanka Nagpal, Bart Blaner, Ken Valk, Leon Stok, and Ruchir Puri. “Customizing a Large Language Model for VHDL Design of High-Performance Microprocessors.” arXiv preprint arXiv:2505.09610 (2025). The post Customizing An LLM Tailored Specifically For VHDL Code And Design Of High Performance Processors (IBM) appeared first on Semiconductor Engineering.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1589977493029525368",
        "title": "IBM acquires data analysis startup Seek AI, opens AI accelerator in NYC",
        "url": "https://techcrunch.com/2025/06/02/ibm-acquires-data-analysis-startup-seek-ai-opens-ai-accelerator-in-nyc/",
        "site": "techcrunch.com",
        "time": 1748887581000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM on Monday said that it has acquired Seek AI, an AI platform that allows users to ask questions about enterprise data using natural language, for an undisclosed sum. Seek CEO and founder Sarah Nagy said that the startup’s technology will be a key part of Watsonx AI Labs, IBM’s new NYC-based AI accelerator, which […]",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7065683798893284396",
        "title": "IBM unveils developer-focused innovation lab in New York City",
        "url": "https://seekingalpha.com/news/4454432-ibm-unveils-developer-focused-innovation-lab-in-new-york-city",
        "site": "seekingalpha.com",
        "time": 1748880837000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7162805706631521514",
        "title": "Kadant awarded $18M in orders for wood processing systems",
        "url": "https://seekingalpha.com/news/4453210-kadant-awarded-18m-in-orders-for-wood-processing-systems",
        "site": "seekingalpha.com",
        "time": 1748466178000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "541497380443812945",
        "title": "CEOs who aren't yet preparing for the quantum revolution are 'already too late,' IBM exec says",
        "url": "https://www.businessinsider.com/future-proofing-technology-systems-executives-prepare-quantum-revolution-2025-5",
        "site": "businessinsider.com",
        "time": 1748426281000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Ready or not, the quantum revolution is nearly here. Executives from IBM, Microsoft, IonQ and D-Wave told BI how corporate leaders should prepare. Quantum computing will change the tech landscape as much as artificial intelligence has. Execs from IBM, Microsoft, IonQ, PsiQuantum, and D-Wave told BI that corporate leaders should be preparing now.D-WaveReady or not, the quantum computing revolution is nearly here.Companies that don't evolve with the changing tech landscape risk falling behind their competitors.Execs from IBM, Microsoft, IonQ, PsiQuantum, and D-Wave say corporate leaders should prepare now.You'd be hard pressed to find a company out there that's not using some form of AI at this point. In just a few years, tech leaders say the same will be true of quantum computing. \"It's equivalent to the exact thing that you're seeing with classical computing and AI, but it's going to happen at a much larger scale,\" Jay Gambetta, the vice president in charge of IBM's quantum initiative, told Business Insider.Researchers are optimistic about coming breakthroughs in quantum computing, a field that leverages quantum physics and mechanics to solve complex problems faster than is possible using classical computers.When the final engineering problems are solved and the technology scales up, quantum tech promises to revolutionize medicine, data privacy, and more.Industry insiders say it's just a matter of time before quantum computing changes the tech landscape as much as artificial intelligence has, so corporate leaders had better start getting ready.\"If you're not paying attention and you're not dedicating people to quantum computing, I think it's probably already too late,\" Gambetta said.'Future-proof' computing is hybridAI and quantum computing are not interchangeable tools — each has its own very different strengths. Artificial intelligence is especially good at searching through existing data to make predictions about future outcomes, and is helpful in areas like image recognition, e-commerce recommendation engines, and fraud detection.A utility-scale quantum computer doesn't predict using data from the past, Stratton Sclavos, PsiQuantum's Chief Business Officer, told Business Insider. Instead, it calculates the exact answer from first principles, from scratch, \"to solve problems that no conventional computer or AI will ever be able to solve.\"\"If you're currently using or ramping up your use of AI, keep going,\" Sclavos said. But, he said, corporate leaders should be \"preparing now for how quantum computing will transform how your business operates.\"Aseem Datar, Microsoft's vice president of product innovation, strategic missions, and technologies, told Business Insider that, given the rapid pace of innovation, \"it's critical that organizations start exploring, identifying, and building an application road map that sets them up for success in a quantum future.\"For instance, Microsoft recently released Discovery, an agentic AI platform for scientific research and development built on top of its Azure cloud computing program. Datar said the technology was designed to be as \"future-proof\" as possible so that when quantum technology advances, it will be readily incorporated into the existing technology, and users \"will get the benefits of quantum underneath the platform.\"While Microsoft Discovery is geared toward the scientific community, Datar said future-looking tech solutions across industries will share similar characteristics. Hybrid computing integration, which combines the strengths of classical computing power with those of quantum systems, is particularly important, he said, so corporate leaders don't have to rip and replace their systems once quantum technology reaches its potential.Murray Thom, D-Wave's vice president of quantum technology evangelism, agreed, telling Business Insider: \"Hybrid quantum-classical solutions are what's going to give them the resiliency that they're looking for in their businesses.\"Thom added that organizations need to be aware of and ready for the speed of change that the tech landscape will undergo as quantum technology scales up, \"so that they can take advantage of the technology and not be at a competitive disadvantage if they miss what the newest capabilities are.\"\"When you're evaluating a new technology, you have to keep in mind that there's the information you have about what's possible today, and then there's what I call a cone of uncertainty that projects into the future,\" Thom said. \"You're looking to gain information that allows you to narrow that cone of uncertainty so that you can make better business decisions about what to do today to take advantage of that in the future — and particularly in a way that gives you robustness to those future outcomes.\"'The toothpaste is not going back in the tube.'It's not just private industry that's getting ready for the quantum revolution. Tim Kelly, the mayor of Chattanooga, Tennessee, told Business Insider he's investing heavily in his city's ability to lean into a quantum future, with hopes it can become a hot spot for development of the technology.\"We intend to try to make the most of it from an economic development perspective,\" Kelly said. \"I think we're right at the leading edge of this, and the toothpaste is not going back in the tube, and so even though it's very early innings yet, this will change the world in a very fundamental way.\"Other cities, including Chicago, Boston, and Boulder, Colorado, are also investing in quantum research and industrial hubs to ensure they can capitalize on the economic growth the burgeoning industry is expected to usher in.As the quantum snowball keeps rolling downhill for both the public and private sectors, Niccolo de Masi, CEO of IonQ, told Business Insider that early adopters will gain a massive advantage if they start now to identify the best use cases for their industries, developing and optimizing hybrid algorithms ahead of time so they're ready when the first utility-scale quantum computers turn on.Those that don't start now, he said, risk becoming obsolete.\"This might sound extreme, but as the joke always goes, CEOs have made plenty of decisions over the past 10,000 years that they've gotten fired for — for making the wrong decision,\" de Masi said. \"I think CEOs are going to get fired if they're not up on the quantum revolution in a lot of industries, because they're just going to be so far behind.\"Read the original article on Business Insider",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8579882893405107845",
        "title": "Systems Development Lab Designs AI Compute Engines in India",
        "url": "https://www.eetimes.com/systems-development-lab-designs-ai-compute-engines-in-india/",
        "site": "eetimes.com",
        "time": 1748242800000,
        "favicon_url": "https://static.tickertick.com/website_icons/eetimes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM's ISDL hopes to pioneer AI compute design, redefining India's role in global semiconductor innovation. The post Systems Development Lab Designs AI Compute Engines in India appeared first on EE Times. When we think about the latest developments in semiconductor innovation, our mind might first jump to labs in the Silicon Valley or research parks in Europe. Let me bring you in on a secret: inside a buzzing",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7309367257239735632",
        "title": "ISS Recommends Akio Toyoda’s Reappointment After Prior Concerns Over Governance",
        "url": "https://www.bloomberg.com/news/articles/2025-05-23/akio-toyoda-wins-iss-support-for-board-seat-despite-past-governance-issues",
        "site": "bloomberg.com",
        "time": 1747962062000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "A firm that advises large investors backed the reappointment of Chairman Akio Toyoda to Toyota Motor Corp.’s board, reversing its position from a year ago.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-255299443013815560",
        "title": "David Lazer, Executive Who Joined the World of Muppets, Dies at 89",
        "url": "https://www.nytimes.com/2025/05/21/movies/david-lazer-dead.html",
        "site": "nytimes.com",
        "time": 1747862416000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "At IBM, he hired a young Jim Henson to make humorous corporate films using his puppet creations. Mr. Henson later hired Mr. Lazer to help run his company.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7689699110191189800",
        "title": "Red Hat Summit 2025: Execs Tout Opportunities In Open-Source AI, Virtualization Migration",
        "url": "https://www.crn.com/news/ai/2025/red-hat-summit-2025-execs-tout-opportunities-in-open-source-ai-virtualization-migration",
        "site": "crn.com",
        "time": 1747835160000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Red Hat executives revealed updates to OpenShift, RHEL, virtualization and AI products during Summit 2025.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-385543253637187562",
        "title": "Enterprise AI is Hard, But is There an Easy Button?",
        "url": "https://www.eetimes.com/enterprise-ai-is-hard-but-is-there-an-easy-button/",
        "site": "eetimes.com",
        "time": 1747764000000,
        "favicon_url": "https://static.tickertick.com/website_icons/eetimes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Discover how IBM is aiding enterprise AI adoption amid unique challenges in a discussion by TIRIAS Research experts. The post Enterprise AI is Hard, But is There an Easy Button? appeared first on EE Times. The next major phase in AI value creation is being driven by enterprise adoption. Given the unique and often highly regulated requirements that enterprises must meet, this is not an easy task—not to",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4519305964810697785",
        "title": "Red Hat Unveils AI Inference Server in Latest Product Expansion",
        "url": "https://www.datacenterknowledge.com/data-center-software/red-hat-unveils-ai-inference-server-in-latest-product-expansion",
        "site": "datacenterknowledge.com",
        "time": 1747761530000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterknowledge.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "At Red Hat Summit, the company also announced new cloud partnerships and the release of Red Hat Linux Enterprise 10.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "6937231448879752471",
        "title": "Catena Labs, co-founded by Circle co-founder Sean Neville to build an \"AI-native bank\", emerges from stealth with an $18M seed led by a16z (Ben Weiss/Fortune)",
        "url": "http://www.techmeme.com/250520/p25#a250520p25",
        "site": "techmeme.com",
        "time": 1747761301000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Ben Weiss / Fortune: Catena Labs, co-founded by Circle co-founder Sean Neville to build an “AI-native bank”, emerges from stealth with an $18M seed led by a16z — Sean Neville, cofounder and CEO of Catena Labs. — Courtesy of Catena Labs — Sean Neville has a knack for finding opportunities amid tech booms.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2863302128949758281",
        "title": "Open-Source And Royalty-Free Confidential Computing For Embedded RISC-V Systems (IBM, Max Planck)",
        "url": "https://semiengineering.com/open-source-and-royalty-free-confidential-computing-for-embedded-risc-v-systems-ibm-max-planck/",
        "site": "semiengineering.com",
        "time": 1747759886000,
        "favicon_url": "https://static.tickertick.com/website_icons/semiengineering.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "A new technical paper titled “ACE: Confidential Computing for Embedded RISC-V Systems” was published by researchers at IBM Research, IBM T.J. Watson Research Center, Max Planck Institute for Software Systems (MPI-SWS). Abstract “Confidential computing plays an important role in isolating sensitive applications from the vast amount of untrusted code commonly found in the modern cloud.... » read more The post Open-Source And Royalty-Free Confidential Computing For Embedded RISC-V Systems (IBM, Max Planck) appeared first on Semiconductor Engineering. A new technical paper titled “ACE: Confidential Computing for Embedded RISC-V Systems” was published by researchers at IBM Research, IBM T.J. Watson Research Center, Max Planck Institute for Software Systems (MPI-SWS). Abstract “Confidential computing plays an important role in isolating sensitive applications from the vast amount of untrusted code commonly found in the modern cloud. We argue that it can also be leveraged to build safer and more secure mission-critical embedded systems. In this paper, we introduce the Assured Confidential Execution (ACE), an open-source and royalty-free confidential computing technology targeted for embedded RISC-V systems. We present a set of principles and a methodology that we used to build ACE and that might be applied for developing other embedded systems that require formal verification. An evaluation of our prototype on the first available RISC-V hardware supporting virtualization indicates that ACE is a viable candidate for our target systems.” Find the technical paper here. May 2025. arXiv:2505.12995. Authors: Wojciech Ozga, Guerney D.H. Hunt, Michael V. Le, Lennard Gäher, Avraham Shinnar, Elaine R. Palmer, Hani Jamjoom, Silvio Dragone The post Open-Source And Royalty-Free Confidential Computing For Embedded RISC-V Systems (IBM, Max Planck) appeared first on Semiconductor Engineering.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3260148618777457571",
        "title": "University of Tokyo to upgrade its IBM quantum computer with 156-qubit Heron QPU",
        "url": "https://www.datacenterdynamics.com/en/news/university-of-tokyo-to-upgrade-its-ibm-quantum-computer-with-156-qubit-heron-qpu/",
        "site": "datacenterdynamics.com",
        "time": 1747749604000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "University will link quantum computer with Miyabi supercomputer later this year",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1053530656485878563",
        "title": "Red Hat Launches RHEL 10 With New Capabilities For Hybrid Cloud And AI Systems",
        "url": "https://www.crn.com/news/software/2025/red-hat-launches-rhel-10-with-new-capabilities-for-hybrid-cloud-and-ai-systems",
        "site": "crn.com",
        "time": 1747742400000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "7126265343753574972",
            "-5861997085758758369",
            "8582663103639764726"
        ],
        "description": "Red Hat launched Red Hat Enterprise Linux 10 at the Red Hat Summit for hybrid cloud and AI tasks.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2134466230248819947",
        "title": "Eagle Materials Non-GAAP EPS of $2.08 misses by $0.35, revenue of $470.18M misses by $8.77M",
        "url": "https://seekingalpha.com/news/4450377-eagle-materials-non-gaap-eps-of-2_08-misses-by-0_35-revenue-of-470_18m-misses-by-8_77m",
        "site": "seekingalpha.com",
        "time": 1747737083000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3719033800784744920",
        "title": "How the UK's Met Office, alongside Google DeepMind, Nvidia, Microsoft, IBM, and others, are leveraging AI to enhance weather forecasting accuracy and detail (Financial Times)",
        "url": "http://www.techmeme.com/250519/p6#a250519p6",
        "site": "techmeme.com",
        "time": 1747649701000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Financial Times: How the UK's Met Office, alongside Google DeepMind, Nvidia, Microsoft, IBM, and others, are leveraging AI to enhance weather forecasting accuracy and detail — Rapidly advancing technology is helping meteorologists to make more accurate and detailed forecasts even further into the future",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3326129252186021657",
        "title": "Customizing A LLM Model For VHDL Design of High-Performance MPUs (IBM)",
        "url": "https://semiengineering.com/customizing-a-llm-model-for-vhdl-design-of-high-performance-mpus-ibm/",
        "site": "semiengineering.com",
        "time": 1747599697000,
        "favicon_url": "https://static.tickertick.com/website_icons/semiengineering.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-3485117014025320247"
        ],
        "description": "A new technical paper titled “Customizing a Large Language Model for VHDL Design of High-Performance Microprocessors” was published by researchers at IBM. Abstract “The use of Large Language Models (LLMs) in hardware design has taken off in recent years, principally through its incorporation in tools that increase chip designer productivity. There has been considerable discussion... » read more The post Customizing A LLM Model For VHDL Design of High-Performance MPUs (IBM) appeared first on Semiconductor Engineering. A new technical paper titled “Customizing a Large Language Model for VHDL Design of High-Performance Microprocessors” was published by researchers at IBM. Abstract “The use of Large Language Models (LLMs) in hardware design has taken off in recent years, principally through its incorporation in tools that increase chip designer productivity. There has been considerable discussion about the use of LLMs in RTL specifications of chip designs, for which the two most popular languages are Verilog and VHDL. LLMs and their use in Verilog design has received significant attention due to the higher popularity of the language, but little attention so far has been given to VHDL despite its continued popularity in the industry. There has also been little discussion about the unique needs of organizations that engage in high-performance processor design, and techniques to deploy AI solutions in these settings. In this paper, we describe our journey in developing a Large Language Model (LLM) specifically for the purpose of explaining VHDL code, a task that has particular importance in an organization with decades of experience and assets in high-performance processor design. We show how we developed test sets specific to our needs and used them for evaluating models as we performed extended pretraining (EPT) of a base LLM. Expert evaluation of the code explanations produced by the EPT model increased to 69% compared to a base model rating of 43%. We further show how we developed an LLM-as-a-judge to gauge models similar to expert evaluators. This led us to deriving and evaluating a host of new models, including an instruction-tuned version of the EPT model with an expected expert evaluator rating of 71%. Our experiments also indicate that with the potential use of newer base models, this rating can be pushed to 85% and beyond. We conclude with a discussion on further improving the quality of hardware design LLMs using exciting new developments in the Generative AI world.” Find the technical paper here. May 2025. Dupuis, Nicolas, Ravi Nair, Shyam Ramji, Sean McClintock, Nishant Chauhan, Priyanka Nagpal, Bart Blaner, Ken Valk, Leon Stok, and Ruchir Puri. “Customizing a Large Language Model for VHDL Design of High-Performance Microprocessors.” arXiv preprint arXiv:2505.09610 (2025). The post Customizing A LLM Model For VHDL Design of High-Performance MPUs (IBM) appeared first on Semiconductor Engineering.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4632371595629388157",
        "title": "Vivos Therapeutics GAAP EPS of -$0.45 misses by $0.10, revenue of $3.02M misses by $1.18M",
        "url": "https://seekingalpha.com/news/4449416-vivos-therapeutics-gaap-eps-of--045-misses-by-010-revenue-of-302m-misses-by-118m",
        "site": "seekingalpha.com",
        "time": 1747382634000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-638642687484434641",
        "title": "IFI Claims: Google passes IBM to lead in generative AI-related patent applications in the US; Google and Nvidia lead agentic AI patent filings globally (Ina Fried/Axios)",
        "url": "http://www.techmeme.com/250515/p18#a250515p18",
        "site": "techmeme.com",
        "time": 1747308901000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Ina Fried / Axios: IFI Claims: Google passes IBM to lead in generative AI-related patent applications in the US; Google and Nvidia lead agentic AI patent filings globally — Google has overtaken IBM to become the leader in generative AI-related patents and also leads in the emerging area of agentic AI …",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8028397471833009552",
        "title": "Google dominates AI patent applications",
        "url": "https://www.axios.com/2025/05/15/ai-patents-google-agents",
        "site": "axios.com",
        "time": 1747299600000,
        "favicon_url": "https://static.tickertick.com/website_icons/axios.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Data: IFI Claims; Chart: Axios VisualsGoogle has overtaken IBM to become the leader in generative AI-related patents and also leads in the emerging area of agentic AI, according to data from IFI Claims shared first with Axios.Why it matters: Patent filings, though they're not a direct proxy for innovation, indicate areas of keen research interest — and generative AI patent applications in the U.S. have risen by more than 50 percent in recent months.\"The surge in applications for AI related patents is a sign companies are actively seeking protection for their AI technologies, leading to an increase in grants as well,\" IFI Claims spokesperson Lily Iacurci said in a statement to Axios.In the patents-for-agents U.S. rankings, Google and Nvidia top the list, followed by IBM, Intel and Microsoft, according to an analysis released Thursday.Globally, Google and Nvidia also led the agentic patents list, but three Chinese universities also make the top 10, highlighting China's place as the U.S.'s chief rival in the field. In global rankings for generative AI, Google was also the leader — but six of the top 10 global spots were held by Chinese companies or universities. Microsoft was No. 3, with Nvidia and IBM also in the top 10.IFI Claims identified only a single patent tied to China's DeepSeek, one for a method of constructing training data.In U.S. rankings for generative AI, Google and Microsoft topped the list of U.S. patent applications, surpassing previous leader IBM.Also in the top 10 were Nvidia, Capital One, Samsung, Adobe, Intel and Qualcomm.Many of the same names cropped up in the list of overall AI-related U.S. patent applications, with Google in the top spot, followed by Microsoft, IBM, Samsung and Capital One. Globally, Google topped the list, followed by Huawei and Samsung.Neither Meta nor OpenAI ranked in the top 10, though OpenAI has stepped up its patent efforts over the past year, IFI's analysis found.Meta has concentrated efforts on open source development, and OpenAI says it intends to use its patents only \"defensively.\"By the numbers: Overall, the number of U.S. patent applications related to generative AI surged 56% last year, to 51,487. Granted patents in the U.S. also rose 32%.Generative AI made up 17% of AI-related U.S. patent applications, while agentic AI accounted for 7%. Globally, 23% of patent applications were related to generative AI and 5% to agentic AI.The study covers the 14-month period from Feb. 2024 to April 2025. Data: IFI Claims; Chart: Axios VisualsGoogle has overtaken IBM to become the leader in generative AI-related patents and also leads in the emerging area of agentic AI, according to data from IFI Claims shared first with Axios.Why it matters: Patent filings, though they're not a direct proxy for innovation, indicate areas of keen research interest — and generative AI patent applications in the U.S. have risen by more than 50 percent in recent months.\"The surge in applications for AI related patents is a sign companies are actively seeking protection for their AI technologies, leading to an increase in grants as well,\" IFI Claims spokesperson Lily Iacurci said in a statement to Axios.In the patents-for-agents U.S. rankings, Google and Nvidia top the list, followed by IBM, Intel and Microsoft, according to an analysis released Thursday.Globally, Google and Nvidia also led the agentic patents list, but three Chinese universities also make the top 10, highlighting China's place as the U.S.'s chief rival in the field. In global rankings for generative AI, Google was also the leader — but six of the top 10 global spots were held by Chinese companies or universities. Microsoft was No. 3, with Nvidia and IBM also in the top 10.IFI Claims identified only a single patent tied to China's DeepSeek, one for a method of constructing training data.In U.S. rankings for generative AI, Google and Microsoft topped the list of U.S. patent applications, surpassing previous leader IBM.Also in the top 10 were Nvidia, Capital One, Samsung, Adobe, Intel and Qualcomm.Many of the same names cropped up in the list of overall AI-related U.S. patent applications, with Google in the top spot, followed by Microsoft, IBM, Samsung and Capital One. Globally, Google topped the list, followed by Huawei and Samsung.Neither Meta nor OpenAI ranked in the top 10, though OpenAI has stepped up its patent efforts over the past year, IFI's analysis found.Meta has concentrated efforts on open source development, and OpenAI says it intends to use its patents only \"defensively.\"By the numbers: Overall, the number of U.S. patent applications related to generative AI surged 56% last year, to 51,487. Granted patents in the U.S. also rose 32%.Generative AI made up 17% of AI-related U.S. patent applications, while agentic AI accounted for 7%. Globally, 23% of patent applications were related to generative AI and 5% to agentic AI.The study covers the 14-month period from Feb. 2024 to April 2025.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8790019113731677904",
        "title": "Biodesix GAAP EPS of -$0.08 misses by $0.02, revenue of $18M misses by $3.23M | $BDSX",
        "url": "https://seekingalpha.com/news/4448145-biodesix-gaap-eps-of-0_08-misses-by-0_02-revenue-of-18m-misses-by-3_23m",
        "site": "seekingalpha.com",
        "time": 1747240761000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2284460976042354215",
        "title": "AuthID targets $18M in 2025 bookings amid surge in enterprise demand and strategic partnerships",
        "url": "https://seekingalpha.com/news/4447666-authid-targets-18m-in-2025-bookings-amid-surge-in-enterprise-demand-and-strategic",
        "site": "seekingalpha.com",
        "time": 1747185150000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1365392885252561294",
        "title": "Seer reiterates $17M–$18M 2025 revenue guidance amid strong Q1 instrument demand and large-scale study momentum | $SEER",
        "url": "https://seekingalpha.com/news/4447645-seer-reiterates-17m-18m-2025-revenue-guidance-amid-strong-q1-instrument-demand-and-large",
        "site": "seekingalpha.com",
        "time": 1747176481000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3135194990269170341",
        "title": "Reed's GAAP EPS of -$0.04 misses by $0.01, revenue of $10.03M beats by $0.18M",
        "url": "https://seekingalpha.com/news/4447629-reeds-gaap-eps-of-0_04-misses-by-0_01-revenue-of-10_03m-beats-by-0_18m",
        "site": "seekingalpha.com",
        "time": 1747173431000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "6716218402721807565",
        "title": "Absci GAAP EPS of -$0.21 beats by $0.02, revenue of $1.18M beats by $0.11M | $ABSI",
        "url": "https://seekingalpha.com/news/4447490-absci-gaap-eps-of-0_21-beats-by-0_02-revenue-of-1_18m-beats-by-0_11m",
        "site": "seekingalpha.com",
        "time": 1747167130000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7791825897069886380",
        "title": "Phillips 66 shareholders are advised to vote for 4 Elliott nominees, ISS says",
        "url": "https://seekingalpha.com/news/4446838-phillips-66-are-advised-to-vote-for-4-elliott-nominees-iss-says",
        "site": "seekingalpha.com",
        "time": 1747091832000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6637147709539160721",
        "title": "Proxy adviser ISS backs Elliott in fight against Phillips 66",
        "url": "https://www.ft.com/content/f77cb835-b107-47ba-a987-f0e758529590",
        "site": "ft.com",
        "time": 1747090012000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Endorsement gives hedge fund a leg-up in campaign to overhaul refiner’s board",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5338734911148350095",
        "title": "Phillips 66 Holders Should Vote for Four Elliott Nominees, ISS Says",
        "url": "https://www.bloomberg.com/news/articles/2025-05-12/phillips-66-holders-should-vote-for-4-elliott-nominees-iss-says",
        "site": "bloomberg.com",
        "time": 1747088790000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-7791825897069886380"
        ],
        "description": "Shareholders of Phillips 66 should vote for all four board candidates nominated by activist investor Elliott Investment Management in its upcoming annual meeting, said proxy advisory firm Institutional Shareholder Services Inc. The Phillips 66 Los Angeles refinery in Wilmington, California, US, on Thursday, March 21, 2024. Phillips 66 is scheduled to release earnings figures on April 26.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3187445172899721275",
        "title": "Vital Energy Non-GAAP EPS of $2.37 beats by $0.25, revenue of $512.18M misses by $18.2M",
        "url": "https://seekingalpha.com/news/4446824-vital-energy-non-gaap-eps-of-2_37-beats-by-0_25-revenue-of-512_18m-misses-by-18_2m",
        "site": "seekingalpha.com",
        "time": 1747087112000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-9098583254478728677",
            "2134466230248819947",
            "4632371595629388157",
            "-8790019113731677904",
            "3135194990269170341",
            "6716218402721807565"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "6550002495422299773",
        "title": "Harvard Bioscience outlines Q2 revenue target of $18M–$20M amid product launches and cost actions",
        "url": "https://seekingalpha.com/news/4446563-harvard-bioscience-outlines-q2-revenue-target-of-18m-20m-amid-product-launches-and-cost",
        "site": "seekingalpha.com",
        "time": 1747068134000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2217029752200238932",
        "title": "BioXcel Therapeutics GAAP EPS of -$1.50 beats by $1.54, revenue of $0.17M misses by $0.18M | $BTAI",
        "url": "https://seekingalpha.com/news/4446318-bioxcel-therapeutics-gaap-eps-of-1_50-beats-by-1_54-revenue-of-0_17m-misses-by-0_18m",
        "site": "seekingalpha.com",
        "time": 1747048649000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2644858920787347389",
        "title": "Caledonia Mining GAAP EPS of $0.59, revenue of $56.18M; reaffirms FY25 production outlook",
        "url": "https://seekingalpha.com/news/4446198-caledonia-mining-gaap-eps-of-059-revenue-of-5618m-reaffirms-fy25-production-outlook",
        "site": "seekingalpha.com",
        "time": 1747029912000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4780174724663494523",
        "title": "Lotus Cars Are Driving on Fumes in the Trade War",
        "url": "https://www.bloomberg.com/opinion/articles/2025-05-12/trade-war-has-lotus-sportscars-driving-on-fumes",
        "site": "bloomberg.com",
        "time": 1747022428000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "The Chinese-controlled automaker’s balance sheet is too lightweight for the daunting environment it faces. This picture shows a Lotus Evija during a car festival in Beijing on October 19, 2024. (Photo by ADEK BERRY / AFP) (Photo by ADEK BERRY/AFP via Getty Images)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3752632378259126049",
        "title": "Red Hat CEO Hicks Calls AI Costs ‘The Competition’ Over Next Few Years",
        "url": "https://www.crn.com/news/ai/2025/red-hat-ceo-hicks-calls-ai-costs-the-competition-over-next-few-years",
        "site": "crn.com",
        "time": 1746822840000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Red Hat CEO Matt Hicks presented on AI, GenAI, OpenShift and more at IBM Think 2025 in Boston.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1172742696129702750",
        "title": "CEOs Struggle with AI Integration: 68% Seek Data Frameworks, 59% Face Funding Challenges",
        "url": "https://www.digitalinformationworld.com/2025/05/ceos-struggle-with-ai-integration-68.html",
        "site": "digitalinformationworld.com",
        "time": 1746810000000,
        "favicon_url": "https://static.tickertick.com/website_icons/digitalinformationworld.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "A new survey from IBM, which interviewed 2,000 CEOs globally, sheds light on the mixed results of AI investments in the business world. The findings reveal that while AI holds significant promise, it is far from a guaranteed success. Only 25% of AI projects have delivered the expected return on investment, despite widespread interest in the technology.One key takeaway from the survey is that while 61% of CEOs are already using AI agents and planning to scale their efforts, a significant challenge remains: many organizations are still grappling with disconnected technology. Half of the CEOs surveyed noted that their fast-tracked AI adoption has left them with fragmented systems that don’t communicate effectively. This struggle is compounded by the fact that 68% of CEOs see a strong, integrated data framework as essential for cross-functional collaboration, but building such systems remains a daunting task.Interestingly, more than half (52%) of executives said they were seeing value from generative AI investments beyond cost reductions, but much of this drive is fueled by the fear of falling behind. About 64% of CEOs admitted they are jumping into AI projects before fully understanding their value. However, 37% of respondents said they prefer fast action, even if it means making mistakes along the way, rather than taking their time.Funding AI initiatives is also a challenge. With 59% of CEOs admitting they struggle to balance investments in ongoing operations with long-term innovation, the pressure is mounting to make smarter decisions. Nearly 67% say their organizations need more flexibility in their budgets to seize digital opportunities and spur growth.Workforce challenges are also a concern, with 31% of the global workforce expected to need retraining or reskilling in the next three years. To meet the demands of the growing AI field, 54% of CEOs are hiring for positions related to AI that didn’t even exist a year ago. This highlights a rapidly evolving job market where new expertise is essential for staying competitive.Despite these hurdles, CEOs are optimistic. By 2027, 85% expect a positive return on investment from their AI efficiency and cost-saving efforts, and 77% believe their AI investments will lead to substantial growth and expansion.IBM’s study paints a picture of an ambitious but challenging journey ahead for many businesses as they try to harness the potential of AI. While the short-term results may be mixed, executives are betting on AI’s long-term benefits, with strategic leadership and a well-trained workforce seen as key ingredients for success.Image: DIW-AigenRead next: AI’s Data Growth Drains Water Supplies, as 70% More Centers Emerge",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7818297939899972070",
        "title": "IBM Think 2025: HashiCorp Co-Founder, CTO Touts Benefits Of Acquisition",
        "url": "https://www.crn.com/news/ai/2025/ibm-think-2025-hashicorp-co-founder-touts-benefits-of-acquisition",
        "site": "crn.com",
        "time": 1746797700000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "HashiCorp CTO Armon Dadgar highlighted ways his vendor will work well within IBM on security, cloud, multi-cloud, hybrid cloud and app life cycle use cases.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2597140180393738711",
        "title": "Starwood Property Trust Non-GAAP EPS of $0.45 in-line, revenue of $418.18M misses by $60.6M",
        "url": "https://seekingalpha.com/news/4445635-starwood-property-trust-non-gaap-eps-of-045-in-line-revenue-of-41818m-misses-by-606m",
        "site": "seekingalpha.com",
        "time": 1746788573000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-767290097338812961",
        "title": "IBM Think 2025: CEO Krishna Says Customer AI Success Rate Can Triple With Big Blue Approach",
        "url": "https://www.crn.com/news/ai/2025/ibm-think-2025-ceo-krishna-says-customer-ai-success-rate-can-triple-with-big-blue-approach",
        "site": "crn.com",
        "time": 1746740820000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM CEO Arvind Krishna talked about AI, GenAI, agents, quantum computing and more at Think 2025 in Boston.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2703519258439393967",
        "title": "IBM launches new LinuxONE server with Telum II chips",
        "url": "https://www.datacenterdynamics.com/en/news/ibm-launches-new-linuxone-server-with-telum-ii-chips/",
        "site": "datacenterdynamics.com",
        "time": 1746708304000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "And more news from IBM",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-5842810882306409731",
        "title": "Wave Life Sciences GAAP EPS of -$0.29 misses by $0.03, revenue of $9.18M misses by $2.16M | $WVE",
        "url": "https://seekingalpha.com/news/4444406-wave-life-sciences-gaap-eps-of-0_29-misses-by-0_03-revenue-of-9_18m-misses-by-2_16m",
        "site": "seekingalpha.com",
        "time": 1746704279000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7093267976153218783",
        "title": "An IBM survey of 2,000 CEOs finds that only 25% of AI initiatives have delivered expected ROI over the last few years, and only 16% have scaled enterprise wide (Tobias Mann/The Register)",
        "url": "http://www.techmeme.com/250508/p10#a250508p10",
        "site": "techmeme.com",
        "time": 1746689701000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Tobias Mann / The Register: An IBM survey of 2,000 CEOs finds that only 25% of AI initiatives have delivered expected ROI over the last few years, and only 16% have scaled enterprise wide — Just 1 in 4 bets paying off so far — Only a quarter of AI initiatives have delivered the expected return on investment, according to an IBM survey of 2,000 CEOs.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4022085039289633230",
        "title": "Root expands partnerships and reports $18M net income in Q1 2025",
        "url": "https://seekingalpha.com/news/4444049-root-expands-partnerships-and-reports-18m-net-income-in-q1-2025",
        "site": "seekingalpha.com",
        "time": 1746664494000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1965666196585295991",
        "title": "IonQ targets $16M-$18M Q2 2025 revenue amid networking expansion",
        "url": "https://seekingalpha.com/news/4444035-ionq-targets-16m-18m-q2-2025-revenue-amid-networking-expansion",
        "site": "seekingalpha.com",
        "time": 1746661146000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8765528174538500048",
        "title": "Green Thumb Industries GAAP EPS of $0.04 in-line, revenue of $279.54M misses by $4.18M | $GTBIF",
        "url": "https://seekingalpha.com/news/4443812-green-thumb-industries-gaap-eps-of-004-in-line-revenue-of-27954m-misses-by-418m",
        "site": "seekingalpha.com",
        "time": 1746651077000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8111425155814318931",
        "title": "How tech stalwart IBM is turning into an AI darling",
        "url": "https://www.businessinsider.com/ibm-stock-price-ai-arvind-krishna-wall-street-ives-wedbush-2025-5",
        "site": "businessinsider.com",
        "time": 1746633627000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM wasn't often mentioned in the same breath as other AI titans, but the company has slowly morphed into one of the darlings of Wall Street's top trade. illustration by Cheng Xin/Getty ImagesIBM's shift to an AI company is starting to pay off big time.The company is doubling down on its AI strategy, unveiling new products at its Think conference on Tuesday.\"It's still the first inning in a nine-inning game,\" Wedbush analyst Dan Ives told BI.IBM's identity is shifting from boring mainframe computers to fast-growing artificial intelligence as the 113-year-old company doubles down on AI.At its IBM Think conference on Tuesday, CEO Arvind Krishna unveiled a host of new AI products and services in a bid to grow its generative AI business, which he said has turned into a $6 billion business.At its core, IBM helps companies adopt AI technologies, create their own agents based on proprietary data, and link together various AI agents from other software providers.And analysts think they're just getting started.\"Arvind, he's in the process of doing a Microsoft-like transformation,\" Wedbush analyst Dan Ives told BI on Wednesday. \"It's still the first inning in a nine-inning game.\"Ives said IBM's transformation into an AI company is rooted in its $34 billion acquisition of cloud services provider Red Hat in 2019, but it wasn't until Krishna took over as CEO in 2020 that IBM jump-started its AI efforts.\"It was really once Arvin took over as CEO that started, that got the engine started, and I think especially the last year, you've seen acceleration,\" Ives added. IBM's shift to AI is paying off. The stock is up 14% year-to-date, significantly outperforming the Nasdaq 100's decline of 5%.Ives said that part of IBM's strength is that it has built an open-sourced foundation for its AI efforts, which allows it to be flexible in integrating different AI solutions for its customer base.In addition to growing its revenue, AI is also helping grow IBM's profits due to significant cost savings, amounting to $3.5 billion annually over the last two years.Ives highlighted that IBM's increase in productivity, unlocked by AI, has helped the company increase its profit margins by 5 percentage points.\"The company has saved 250k+ hours due to its AI investments,\" Ives said, adding that he is turning \"incrementally more bullish\" on the stock going forward.Wedbush rates IBM at \"Outperform\" with a $300 price target, representing potential upside of 20% from current levels.Read the original article on Business Insider",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8827565719558698096",
        "title": "Analysis: 75%+ of the top 220 holders of President Trump's memecoin likely reside outside the US, ahead of a May 22 dinner; Justin Sun is likely to hold $18M (Bloomberg)",
        "url": "http://www.techmeme.com/250507/p24#a250507p24",
        "site": "techmeme.com",
        "time": 1746622205000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Bloomberg: Analysis: 75%+ of the top 220 holders of President Trump's memecoin likely reside outside the US, ahead of a May 22 dinner; Justin Sun is likely to hold $18M — The majority of top holders of Donald Trump's memecoin have used foreign exchanges that say they ban US users, suggesting many purchasers are based abroad",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6568926649185747274",
        "title": "Amerigo Resources GAAP EPS of $0.02, revenue of $44.18M",
        "url": "https://seekingalpha.com/news/4443025-amerigo-resources-gaap-eps-of-0_02-revenue-of-44_18m",
        "site": "seekingalpha.com",
        "time": 1746620582000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "6130565920520027840",
        "title": "IBM Think conference shows 'doubling down' on AI vision: Wedbush",
        "url": "https://seekingalpha.com/news/4442970-ibm-think-conference-shows-doubling-down-on-ai-vision-wedbush",
        "site": "seekingalpha.com",
        "time": 1746618238000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5408368763175291261",
        "title": "IBM CEO Arvind Krishna says the company used AI agents to replace the work of 200+ HR employees and, as a result, hired more programmers and salespeople (Belle Lin/Wall Street Journal)",
        "url": "http://www.techmeme.com/250507/p11#a250507p11",
        "site": "techmeme.com",
        "time": 1746611701000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Belle Lin / Wall Street Journal: IBM CEO Arvind Krishna says the company used AI agents to replace the work of 200+ HR employees and, as a result, hired more programmers and salespeople — The tech company promises higher total employment as it reinvests resources toward roles like software development",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5632670615747405010",
        "title": "Lyra Therapeutics GAAP EPS of -$0.13 beats by $0.01, revenue of $0.18M beats by $0.02M | $LYRA",
        "url": "https://seekingalpha.com/news/4442622-lyra-therapeutics-gaap-eps-of-0_13-beats-by-0_01-revenue-of-0_18m-beats-by-0_02m",
        "site": "seekingalpha.com",
        "time": 1746566036000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6162763641784199988",
        "title": "IBM CEO: HR Layoffs Due to AI Led to ‘More Investment’ in Other Roles",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/ibm-ceo-hr-layoffs-due-to-ai-led-to-more-investment-in-other-roles/",
        "site": "pymnts.com",
        "time": 1746565911000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Arvind Krishna, the CEO of IBM, said his company’s investment in artificial intelligence (AI) has ultimately led to a rise in employment in the firm. According to a Tuesday (May 6) report from The Wall Street Journal (WSJ), IBM replaced a few hundred human resources staffers with AI agents, bots that can perform tasks like […] The post IBM CEO: HR Layoffs Due to AI Led to ‘More Investment’ in Other Roles appeared first on PYMNTS.com. Arvind Krishna, the CEO of IBM, said his company’s investment in artificial intelligence (AI) has ultimately led to a rise in employment in the firm. According to a Tuesday (May 6) report from The Wall Street Journal (WSJ), IBM replaced a few hundred human resources staffers with AI agents, bots that can perform tasks like analyze spreadsheets, conduct research and draft emails autonomously. Consequently, IBM hired more programmers and salespeople. “While we have done a huge amount of work inside IBM on leveraging AI and automation on certain enterprise workflows, our total employment has actually gone up, because what it does is it gives you more investment to put into other areas,” Krishna told WSJ. Krishna called these areas — such as software engineering, sales and marketing — “critical thinking” focused domains, where people need to do things that “face up or against other humans, as opposed to just doing rote process work,” according to the report. WSJ noted that IBM didn’t say over what period its job reductions happened. The CEO also noted that the impact of President Donald Trump’s tariffs on IBM’s bottom line was “very limited,” given that most of its mainframe computer and quantum systems are built domestically. However, he expressed caution about a possible reduction in demand due to tariffs, which could hit discretionary spending in the company’s consulting business. “If the impact is within 3 to 4%, you actually can grit and manage through it,” Krishna said. “If the impact is going to be more like 10%, then that requires a lot more hardheaded management decisions.” Krishna — along with the CEOs of Intel, Qualcomm and HP — met with Trump on March 10 to discuss the impact of tariffs on the industry. “Some of the topics top-of-mind for our leadership team are trade policy and U.S. manufacturing,” that spokesperson said. In February, Krishna argued that a drop in AI costs will drive demand for the technology. “We will find that the usage will explode as costs come down,” Krishna told Bloomberg Television, according to a Feb. 11 report from PYMNTS. The post IBM CEO: HR Layoffs Due to AI Led to ‘More Investment’ in Other Roles appeared first on PYMNTS.com.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "391965897045724022",
        "title": "Angi GAAP EPS of $0.30 beats by $0.36, revenue of $245.91M beats by $6.18M",
        "url": "https://seekingalpha.com/news/4442541-angi-gaap-eps-of-0_30-beats-by-0_36-revenue-of-245_91m-beats-by-6_18m",
        "site": "seekingalpha.com",
        "time": 1746564468000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-886319533740724767",
        "title": "IBM Doubles Down on AI, Palantir Falls Short | Bloomberg Technology",
        "url": "https://www.bloomberg.com/news/videos/2025-05-06/bloomberg-technology-05-06-2025-video",
        "site": "bloomberg.com",
        "time": 1746563975000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Bloomberg’s Caroline Hyde speaks with IBM CEO Arvind Krishna about the company’s new product designed to help enterprises manage the growing number of AI agents. Plus, Janet Mui, head of market analysis at RBC Brewin Dolphin, reacts to Treasury Secretary Scott Bessent's testimony where he said that there is no sign of a recession in the US. And a leader in Palantir’s army of loyal retail investors discusses why he isn't concerned about the company’s slow global growth. (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-974807913418277293",
        "title": "IBM CEO urges the Trump Administration to increase — not cut — federal AI R&D funding",
        "url": "https://techcrunch.com/2025/05/06/ibm-ceo-urges-the-trump-administration-to-increase-not-cut-federal-ai-rd-funding/?.tsrc=rss",
        "site": "techcrunch.com",
        "time": 1746562487000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Like many leaders in tech, Arvind Krishna, the CEO of IBM, thinks federal R&D funding for AI and related technologies should be increased — not the other way around. \"We have been an extremely strong advocate — and this is both the company and me personally — on that federally funded R&D should be increased,\" Kirshna said in an interview with TechCrunch. \"That's the position, which is unequivocal, and we strongly believe in that.\" President Donald Trump and his cabinet have sought to make deep c",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2021828951231803384",
        "title": "IBM CEO Says He's Not Worried About DOGE",
        "url": "https://www.bloomberg.com/news/videos/2025-05-06/ibm-ceo-says-he-s-not-worried-about-doge-video",
        "site": "bloomberg.com",
        "time": 1746558883000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM CEO Arvind Krishna says he isn’t worried about government contract cuts and explains why the company is doubling down on AI to help clients manage the growing number of agents. Krishna joins Caroline Hyde on “Bloomberg Technology.\" (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2257842513228743168",
        "title": "Bloomberg Talks: Arvind Krishna (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-06/bloomberg-talks-arvind-krishna-podcast",
        "site": "bloomberg.com",
        "time": 1746555598000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Source: Bloomberg, 9:33",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4873525114884706513",
        "title": "Bloomberg Technology: IBM Doubles Down on AI (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-05-06/bloomberg-technology-ibm-doubles-down-on-ai-podcast",
        "site": "bloomberg.com",
        "time": 1746555529000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Source: Bloomberg, 36:30 International Business Machines Corp Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3682855782757134350",
        "title": "IBM and TCS to deploy IBM Quantum System Two at Quantum Valley Tech Park in India",
        "url": "https://www.datacenterdynamics.com/en/news/ibm-and-tcs-to-deploy-ibm-quantum-system-two-at-quantum-valley-tech-park-in-india/",
        "site": "datacenterdynamics.com",
        "time": 1746546604000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "System will contain a 156-qubit Heron quantum processor",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6520576621646939184",
        "title": "IBM Think 2025: The Biggest News In AI, Linux",
        "url": "https://www.crn.com/news/ai/2025/ibm-think-2025-the-biggest-news-in-ai-linux",
        "site": "crn.com",
        "time": 1746541200000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM executives showcased advancements in AI, GenAI, LinuxOne and Watsonx during IBM Think 2025 in Boston.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1192610657841898520",
        "title": "Krystal Biotech GAAP EPS of $1.20 misses by $0.17, revenue of $88.18M misses by $8.03M",
        "url": "https://seekingalpha.com/news/4441808-krystal-biotech-gaap-eps-of-1_20-misses-by-0_17-revenue-of-88_18m-misses-by-8_03m",
        "site": "seekingalpha.com",
        "time": 1746533419000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8338932674760437811",
        "title": "Talkspace GAAP EPS of $0.00, revenue of $52.18M beats by $0.11M | $TALK",
        "url": "https://seekingalpha.com/news/4441804-talkspace-gaap-eps-of-0_00-revenue-of-52_18m-beats-by-0_11m",
        "site": "seekingalpha.com",
        "time": 1746533281000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2437798209134261355",
        "title": "CEO: Lumen Technologies’ Network ‘Muscle,’ IBM’s GenAI ‘Brain Power’ Will Unleash AI For Enterprises",
        "url": "https://www.crn.com/news/networking/2025/ceo-lumen-technologies-network-muscle-ibm-s-genai-brain-power-will-unleash-ai-for-enterprises",
        "site": "crn.com",
        "time": 1746525600000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Lumen Technologies and IBM are bringing AI inferencing closer to where data is generated by combining watsonx, IBM’s commercial generative AI platform, with Lumen’s own Edge Cloud infrastructure and network, Lumen President and CEO Kate Johnson told CRN in an exclusive interview.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-920368092776499225",
        "title": "IBM pushes for tools to manage numerous AI agents and more U.S. investment",
        "url": "https://seekingalpha.com/news/4441529-ibm-pushes-for-tools-to-manage-numerous-ai-agents-and-more-us-investment",
        "site": "seekingalpha.com",
        "time": 1746513165000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8966064477225790967",
        "title": "IBM thinks that over a billion new applications will be built with gen AI : Here’s how they’re going to help that happen with agentic AI",
        "url": "https://venturebeat.com/ai/agents-are-key-to-enterprise-ai-success-heres-ibms-plan-on-how-to-make-it-happen/",
        "site": "venturebeat.com",
        "time": 1746504060000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM details its plans to help enterprises to actually do more with AI, with an expanded set of agentic AI capabilities. IBM details its plans to help enterprises to actually do more with AI, with an expanded set of agentic AI capabilities.Read More",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2890796143384716744",
        "title": "Catalyst Watch: Powell presser, AMD earnings, IBM event, and Lions Gate splits in two",
        "url": "https://seekingalpha.com/news/4440401-catalyst-watch-powell-presser-amd-earnings-ibm-event-and-lions-gate-splits-in-two",
        "site": "seekingalpha.com",
        "time": 1746212452000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7818704082338861903",
        "title": "Alphatec GAAP EPS of -$0.35 misses by $0.11, revenue of $169.18M beats by $1M",
        "url": "https://seekingalpha.com/news/4439638-alphatec-gaap-eps-of-0_35-misses-by-0_11-revenue-of-169_18m-beats-by-1m",
        "site": "seekingalpha.com",
        "time": 1746133026000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "6125237739078325955",
        "title": "Tandem Diabetes Care GAAP EPS of -$1.97 misses by $1.35, revenue of $234.4M beats by $14.18M | $TNDM",
        "url": "https://seekingalpha.com/news/4438443-tandem-diabetes-care-gaap-eps-of-1_97-misses-by-1_35-revenue-of-234_4m-beats-by-14_18m",
        "site": "seekingalpha.com",
        "time": 1746045491000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1547582193274088870",
        "title": "Premium Global Income Split raises $35.18M in preferred, Class A shares offering",
        "url": "https://seekingalpha.com/news/4437888-premium-global-income-split-raises-3518m-in-preferred-class-a-shares-offering",
        "site": "seekingalpha.com",
        "time": 1746023146000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7728948682668978036",
        "title": "Kintsugi, which uses AI to help companies automate their sales tax compliance, raised $18M at a $150M post-money valuation, up from $80M in November 2024 (Jagmeet Singh/TechCrunch)",
        "url": "http://www.techmeme.com/250430/p25#a250430p25",
        "site": "techmeme.com",
        "time": 1746021300000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Jagmeet Singh / TechCrunch: Kintsugi, which uses AI to help companies automate their sales tax compliance, raised $18M at a $150M post-money valuation, up from $80M in November 2024 — Kintsugi, a Silicon Valley-based startup that helps companies offload and automate their sales tax compliance, has raised $18 million …",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3003593580752076764",
        "title": "Evercore Non-GAAP EPS of $3.49 beats by $1.95, revenue of $699.9M beats by $99.18M",
        "url": "https://seekingalpha.com/news/4437643-evercore-non-gaap-eps-of-3_49-beats-by-1_95-revenue-of-699_9m-beats-by-99_18m",
        "site": "seekingalpha.com",
        "time": 1746010055000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4762319547782651966",
        "title": "Generac Non-GAAP EPS of $1.26 beats by $0.29, revenue of $942M beats by $23.18M",
        "url": "https://seekingalpha.com/news/4437623-generac-non-gaap-eps-of-1_26-beats-by-0_29-revenue-of-942m-beats-by-23_18m",
        "site": "seekingalpha.com",
        "time": 1746007513000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7017971653065096192",
        "title": "AMERISAFE Non-GAAP EPS of $0.60 in-line, revenue of $72.6M misses by $4.18M",
        "url": "https://seekingalpha.com/news/4437455-amerisafe-non-gaap-eps-of-0_60-in-line-revenue-of-72_6m-misses-by-4_18m",
        "site": "seekingalpha.com",
        "time": 1745960596000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1046152720772090463",
        "title": "WesBanco Non-GAAP EPS of $0.66 beats by $0.09, revenue of $193.18M misses by $4.35M",
        "url": "https://seekingalpha.com/news/4437436-wesbanco-non-gaap-eps-of-0_66-beats-by-0_09-revenue-of-193_18m-misses-by-4_35m",
        "site": "seekingalpha.com",
        "time": 1745960038000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3550254460051296912",
        "title": "IBM lifts dividend to $1.68/share",
        "url": "https://seekingalpha.com/news/4436995-ibm-lifts-dividend-to-168share",
        "site": "seekingalpha.com",
        "time": 1745937385000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-912954725263804260",
        "title": "IBM to spend $30bn on quantum, mainframe, as part of $150bn US investment pledge",
        "url": "https://www.datacenterdynamics.com/en/news/ibm-to-spend-30bn-on-quantum-mainframe-as-part-of-150bn-us-investment-pledge/",
        "site": "datacenterdynamics.com",
        "time": 1745929803000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Will investment pledge appease President Trump?",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8871907094930918812",
        "title": "IBM takes a cue from Apple with $150 billion investment — but here’s the twist",
        "url": "https://www.marketwatch.com/story/ibm-takes-a-cue-from-apple-with-150-billion-investment-but-heres-the-twist-8de9f2bb?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1745872620000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM doesn’t do much overseas manufacturing but may be trying to protect some of its consulting contracts with the U.S. government.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4397272010118918629",
        "title": "IBM Pledges $150B US Investment, Apple Shakes Up AI Unit | Bloomberg Technology",
        "url": "https://www.bloomberg.com/news/videos/2025-04-28/bloomberg-technology-04-28-2025-video",
        "site": "bloomberg.com",
        "time": 1745871022000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Bloomberg’s Caroline Hyde discusses IBM's plans to invest $150 billion over the next five years in the US. Plus, Palo Alto Networks’ CEO joins on the company's latest acquisition. And FPV managing partners, Pegah Ebrahimi and Wesley Chan, talk about finding startups that outlive the AI hype and withstand an economic downturn. (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-94243725223101536",
        "title": "IBM is supercharging its quantum computer efforts as part of a major five-year investment in U.S. tech",
        "url": "https://www.fastcompany.com/91324495/ibm-quantum-computing-major-push-as-part-of-us-investment",
        "site": "fastcompany.com",
        "time": 1745869500000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM plans to invest $150 billion in tech manufacturing, research, and development in the United States over the next five years. The technology giant announced this commitment in a news release on Monday. IBM says the investment will accelerate American production of quantum computers and fuel the economy. The $150 billion investment includes more than $30 billion to fund research and development to advance American manufacturing of mainframe and quantum computers. IBM is one of the largest technology employers in the U.S. The company currently has manufacturing facilities in Poughkeepsie, New York. “We have been focused on American jobs and manufacturing since our founding 114 years ago, and with this investment and manufacturing commitment, we are ensuring that IBM remains the epicenter of the world’s most advanced computing and AI capabilities,” IBM CEO Arvind Krishna said in a statement. Largest fleet of quantum computer systems According to the company, IBM’s advancement of quantum computer systems “will not only help us better understand the fundamentals of how the world works but are projected to transform American competitiveness, jobs, and national security.” The tech giant says it operates the largest fleet of quantum computer systems and will continue to design, build, and assemble quantum computers in the United States. Earlier this month, IBM announced the z17, its next-generation mainframe, which is fully engineered with AI capabilities. IBM is the latest company to announce U.S.-based manufacturing commitments following the Trump administration’s push to increase American manufacturing. Other companies that have pledged similar initiatives include Apple, GE Aerospace, and Nvidia. Last week, IBM announced that it had lost 15 government contracts due to the cost-cutting initiatives of the Trump administration. This impacts about $100 million in future revenue.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-5503223579974286307",
        "title": "Bloomberg Technology: IBM Pledges $150B US Investment (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-28/bloomberg-technology-ibm-pledges-150b-us-investment-podcast",
        "site": "bloomberg.com",
        "time": 1745868896000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Source: Bloomberg, 41:15 International Business Machines Corp Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1295683169504085614",
        "title": "IBM's Plans to Invest Billions in the US",
        "url": "https://www.bloomberg.com/news/videos/2025-04-28/ibm-s-plans-to-invest-billions-in-the-us-video",
        "site": "bloomberg.com",
        "time": 1745864842000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM has joined the list of companies pledging to invest billions in the US following President Donald Trump’s election and tariff threats. Bloomberg’s Brody Ford discusses Big Blue’s plans with Caroline Hyde on “Bloomberg Technology.” (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6523940020982825766",
        "title": "Traders Brace for Busy Earnings Week | Bloomberg Open Interest 04/28/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-04-28/bloomberg-open-interest-04-28-2025-video",
        "site": "bloomberg.com",
        "time": 1745860722000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "It's the busiest week for S&P 500 earnings with companies worth $20 trillion dollars set to report results. IBM plans to invest $150 billion dollars in America over the next five years; Domino's misses its estimates; German pharma company Merck is buying US biotech SpringWorks; We discuss market appetite for M&A with Rithm Capital CEO Michael Nierenberg. And small businesses ask for tariff relief. The CEO of Babylist joins our C-Suite to talk about her appeals to the administration. (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6669763938265558432",
        "title": "IBM CEO: $150B Investment Ensures IBM ‘Remains The Epicenter’ Of AI And Innovation",
        "url": "https://www.crn.com/news/computing/2025/ibm-ceo-150b-investment-ensures-ibm-remains-the-epicenter-of-ai-and-innovation",
        "site": "crn.com",
        "time": 1745858700000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM’s $150 billion investment in American manufacturing in the US for mainframes, quantum computing and AI ensures IBM remains a leader, CEO Arvind Krishna says.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7601703910544498491",
        "title": "IBM Plans to Invest $150 Billion Domestically in Latest Tech Sector Pledge",
        "url": "https://www.nytimes.com/2025/04/28/us/politics/ibm-investment-manufacturing.html",
        "site": "nytimes.com",
        "time": 1745855991000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "The announcement comes as the Trump administration pressures firms to expand their U.S. manufacturing. IBM said it would invest $150 billion in the United States over the next five years.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1504785426318018462",
        "title": "These Stocks Are Moving the Most Today: Tesla, Nvidia, Domino’s, Spirit AeroSystems, IBM, Novavax, and More",
        "url": "https://www.barrons.com/articles/stock-market-movers-720b3d28?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1745851500000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "946396015618737437",
        "title": "IBM to Invest $150 Billion in US Over Next Five Years",
        "url": "https://www.bloomberg.com/news/videos/2025-04-28/ibm-to-invest-150-billion-in-us-over-next-five-years-video",
        "site": "bloomberg.com",
        "time": 1745850405000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM plans to invest $150 billion in the US over the next five years, joining a cohort of companies that have announced spending commitments following President Donald Trump’s election and tariff threats. Mandeep Singh has more on “Bloomberg Open Interest.”",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3418473178256414020",
        "title": "IBM Vows to Make Quantum Computers in U.S. and Plans $150 Billion in Domestic Investment",
        "url": "https://www.barrons.com/articles/ibm-stock-price-quantum-computer-news-a9aadb9e?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1745849100000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3039448133426354208",
        "title": "BlackRock shareholders urged to vote against Larry Fink’s pay by ISS",
        "url": "https://www.ft.com/content/dab284d5-9c39-4ed6-912c-8ac65cc40569",
        "site": "ft.com",
        "time": 1745848645000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Recommendation comes as another difficult vote on CEO’s remuneration package looms",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8977332055686313847",
        "title": "IBM pledges to spend $150B in the US over the next few years",
        "url": "https://techcrunch.com/2025/04/28/ibm-pledges-to-spend-150b-in-the-u-s-over-the-next-few-years/",
        "site": "techcrunch.com",
        "time": 1745846556000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-540752687906635360",
            "-912954725263804260",
            "2268087938227442255",
            "-94243725223101536",
            "7601703910544498491",
            "-370914149143445944",
            "946396015618737437",
            "-832995909809010429",
            "3418473178256414020",
            "5324908496229089120",
            "-4809618249005765295"
        ],
        "description": "Enterprise tech giant IBM says that it plans to invest $150 billion in the U.S. over the next five years, which will include a “more than” $30 billion investment in mainframe and quantum computing research. The goal is to fuel the economy and “accelerate [IBM’s] role as the global leader in computing,” the company said in a press release Monday. […]",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4809618249005765295",
        "title": "IBM pledges $150 billion to boost U.S. tech growth, computer manufacturing",
        "url": "https://www.cnbc.com/2025/04/28/ibm-to-invest-150-billion-to-boost-us-tech-growth-computer-manufacturing.html",
        "site": "cnbc.com",
        "time": 1745844981000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3548982329211741155",
        "title": "IBM plans to invest $150B in the US over the next five years, including in R&D, to fuel the economy and \"accelerate its role as the global leader in computing\" (Brody Ford/Bloomberg)",
        "url": "http://www.techmeme.com/250428/p10#a250428p10",
        "site": "techmeme.com",
        "time": 1745844917000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Brody Ford / Bloomberg: IBM plans to invest $150B in the US over the next five years, including in R&D, to fuel the economy and “accelerate its role as the global leader in computing” — IBM plans to invest $150 billion in the US over the next five years, including funds for research and development …",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1593931313239290535",
        "title": "US consumers will start feeling the pain of tariffs in stores by the end of May, Trump's ex-top economic advisor says",
        "url": "https://www.businessinsider.com/us-shoppers-face-tariff-pain-may-end-former-trump-advisor-2025-4",
        "site": "businessinsider.com",
        "time": 1745835481000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM's vice chairman, Gary Cohn, said US consumers will feel the tariffs' effects in \"the last couple of weeks of May.\"Jemal Countess/Getty Images for Fortune MediaPresident Donald Trump's tariffs will hit US store prices by late May, a one-time advisor said.Gary Cohn, a key advisor in Trump's first presidency, said US consumers are scrambling to avoid price hikes.Logistics experts and shipping industry insiders told BI the effects of tariffs will only intensify.American consumers are just weeks away from feeling the major impacts of President Donald Trump's tariffs at the cash register, according to former Trump chief economic advisor Gary Cohn.In a CBS interview, Cohn forecast that the effects of newly imposed tariffs on China will start rippling through the US economy by late May.\"The cycle from a good being sold in China, loaded on a vessel, sailed across the ocean, unloaded in the United States, put in a factory, and distributed to a shelf is about eight weeks in the United States,\" he told CBS' Face The Nation on Sunday.Cohn, who led the National Economic Council for a year during the first Trump administration, now serves as IBM's vice chairman, having previously been Goldman Sachs' chief operating officer.He said that with tariffs on China coming into force on April 2, the real pain point for consumers is expected to emerge around \"the last couple weeks of May.\"Already, US shoppers have been scrambling to avoid potential price hikes by front-loading purchases of big-ticket items like automobiles, washing machines, and electronics.\"We've seen automobile sales almost all-time record highs,\" Cohn said, \"because they're trying to avoid tariffs.\"Trump's tariffs will hit US consumers fully in the coming weeks, Cohn said.Andrew Thomas/Middle East Images via AFPWhile recent hard data, like earnings reports for the first quarter, have so far shown strength, Cohn emphasized that softer data, like consumer confidence surveys, are beginning to flash warning signs.\"You start to see much more weakness in the polling data,\" Cohn said, noting that major consumer brands, including Chipotle, PepsiCo, and luxury giant LVMH, have warned of slowing sales in the second quarter.The tariffs are expected to hit small businesses especially hard. Toy retailers, for example, are already struggling with a 145% tariff on goods they normally order for the holiday season. Many are either scaling back orders or facing potential closures, Cohn said.Last week, logistics experts and shipping industry insiders echoed similar concerns, telling Business Insider they expect major disruptions to the prices and availability of goods in the coming weeks. Four even warned that unchecked supply chain stress could trigger higher domestic unemployment, global market instability, and rising geopolitical tensions.Compounding the situation is a collapse in maritime container bookings between China and the US, down 64%, Treasury Secretary Scott Bessent told investors at a JPMorgan conference last week.Cohn also warned that tariffs are \"highly regressive,\" disproportionately affecting lower-income Americans who spend a greater share of their income on basic goods.While Trump has floated the possibility of new tax cuts targeting households earning under $200,000 to offset higher costs, Cohn was skeptical about the timeline, saying it would be \"very fast\" for anything meaningful to happen by the end of May.With economic uncertainty rising and no active US-China trade negotiations underway, Cohn made it clear: the economic turbulence tied to tariffs is only just beginning.Read the original article on Business Insider IBM's vice chairman, Gary Cohn, said US consumers will feel the tariffs' effects in \"the last couple of weeks of May.\"Jemal Countess/Getty Images for Fortune MediaPresident Donald Trump's tariffs will hit US store prices by late May, a one-time advisor said.Gary Cohn, a key advisor in Trump's first presidency, said US consumers are scrambling to avoid price hikes.Logistics experts and shipping industry insiders told BI the effects of tariffs will only intensify.American consumers are just weeks away from feeling the major impacts of President Donald Trump's tariffs at the cash register, according to former Trump chief economic advisor Gary Cohn.In a CBS interview, Cohn forecast that the effects of newly imposed tariffs on China will start rippling through the US economy by late May.\"The cycle from a good being sold in China, loaded on a vessel, sailed across the ocean, unloaded in the United States, put in a factory, and distributed to a shelf is about eight weeks in the United States,\" he told CBS' Face The Nation on Sunday.Cohn, who led the National Economic Council for a year during the first Trump administration, now serves as IBM's vice chairman, having previously been Goldman Sachs' chief operating officer.He said that with tariffs on China coming into force on April 2, the real pain point for consumers is expected to emerge around \"the last couple weeks of May.\"Already, US shoppers have been scrambling to avoid potential price hikes by front-loading purchases of big-ticket items like automobiles, washing machines, and electronics.\"We've seen automobile sales almost all-time record highs,\" Cohn said, \"because they're trying to avoid tariffs.\"Trump's tariffs will hit US consumers fully in the coming weeks, Cohn said.Andrew Thomas/Middle East Images via AFPWhile recent hard data, like earnings reports for the first quarter, have so far shown strength, Cohn emphasized that softer data, like consumer confidence surveys, are beginning to flash warning signs.\"You start to see much more weakness in the polling data,\" Cohn said, noting that major consumer brands, including Chipotle, PepsiCo, and luxury giant LVMH, have warned of slowing sales in the second quarter.The tariffs are expected to hit small businesses especially hard. Toy retailers, for example, are already struggling with a 145% tariff on goods they normally order for the holiday season. Many are either scaling back orders or facing potential closures, Cohn said.Last week, logistics experts and shipping industry insiders echoed similar concerns, telling Business Insider they expect major disruptions to the prices and availability of goods in the coming weeks. Four even warned that unchecked supply chain stress could trigger higher domestic unemployment, global market instability, and rising geopolitical tensions.Compounding the situation is a collapse in maritime container bookings between China and the US, down 64%, Treasury Secretary Scott Bessent told investors at a JPMorgan conference last week.Cohn also warned that tariffs are \"highly regressive,\" disproportionately affecting lower-income Americans who spend a greater share of their income on basic goods.While Trump has floated the possibility of new tax cuts targeting households earning under $200,000 to offset higher costs, Cohn was skeptical about the timeline, saying it would be \"very fast\" for anything meaningful to happen by the end of May.With economic uncertainty rising and no active US-China trade negotiations underway, Cohn made it clear: the economic turbulence tied to tariffs is only just beginning.Read the original article on Business Insider",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4448467451479840699",
        "title": "IBM has booked $6B in sales around generative AI and Red Hat's revenue has about doubled since IBM bought it, fueling a ~2x jump in IBM's stock since April 2020 (Asa Fitch/Wall Street Journal)",
        "url": "http://www.techmeme.com/250426/p6#a250426p6",
        "site": "techmeme.com",
        "time": 1745648101000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Asa Fitch / Wall Street Journal: IBM has booked $6B in sales around generative AI and Red Hat's revenue has about doubled since IBM bought it, fueling a ~2x jump in IBM's stock since April 2020 — ‘Big Blue’ has clawed back into investor favor, but needs to show staying power in AI to cement its comeback",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1045296214673573840",
        "title": "Direct Line investors urged to reject bonus awards ahead of Aviva takeover",
        "url": "https://www.ft.com/content/a485a272-00b2-4f35-8deb-bf5b6f2e9a58",
        "site": "ft.com",
        "time": 1745599619000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Proxy adviser ISS questions relevance of pay packages that were set before insurer agreed sale to rival",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8409661379469693628",
        "title": "IBM Is Back. Now It Must Prove Its Mettle in AI.",
        "url": "https://www.wsj.com/tech/ai/ibm-generative-ai-business-f3bf8203?.tsrc=rss",
        "site": "wsj.com",
        "time": 1745573400000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "“Big Blue” has clawed its way back into investor favor, but the company needs to show staying power in AI to cement its comeback.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7766214267148314945",
        "title": "IBM was Dow’s worst performer today. ‘Deep breath: It's just Q1,' analyst says.",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=183f83cc-f980-4385-ac71-8ba0f83ee038&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1745531268000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4584193291483034430",
        "title": "What IBM’s Earnings Say About Tariffs, Consulting, AI",
        "url": "https://www.crn.com/news/ai/2025/what-ibm-s-earnings-say-about-tariffs-consulting-ai",
        "site": "crn.com",
        "time": 1745531040000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM CEO Arvind Krishna shared insights into AI, tariffs, global trade, consulting and more as partners navigate an uncertain economy under President Donald Trump.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "628313877282591932",
        "title": "Genfit S.A. GAAP EPS of -€0.58, revenue of €38.18M | $GNFTF",
        "url": "https://seekingalpha.com/news/4435338-genfit-sa-gaap-eps-of-058-revenue-of-3818m",
        "site": "seekingalpha.com",
        "time": 1745527775000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "9180961345303004023",
        "title": "IBM was the Dow’s worst performer today. ‘Deep breath…It’s more than OK,’ one analyst says.",
        "url": "https://www.marketwatch.com/story/ibm-was-the-dows-worst-performer-today-deep-breathits-more-than-ok-one-analyst-says-4e661126?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1745527380000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-7766214267148314945"
        ],
        "description": "Shares of International Business Machines Corp. fell 6.6% on Thursday following quarterly results a day earlier, making the IT giant the biggest loser on the Dow Jones Industrial Average for the day. But some analysts are saying it’s not time to freak out yet.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3746273021385753416",
        "title": "Stock Movers: American Airlines, Comcast, IBM (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-24/stock-movers-american-airlines-comcast-ibm-podcast",
        "site": "bloomberg.com",
        "time": 1745522865000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-4818923351759980756",
            "-2514690729340710752"
        ],
        "description": "Source: Bloomberg, 4:05 International Business Machines Corp Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8876316783571645453",
        "title": "Tesla’s Europe Sales Fall, IBM and ServiceNow Beat | Bloomberg Technology",
        "url": "https://www.bloomberg.com/news/videos/2025-04-24/bloomberg-technology-04-24-2025-video",
        "site": "bloomberg.com",
        "time": 1745521241000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Bloomberg’s Caroline Hyde and Ed Ludlow discuss tech earnings as Alphabet prepares to report after the bell, setting the tone for Magnificent Seven results. Plus, ServiceNow CEO Bill McDermott discusses the company’s outlook amid the threat of tariffs and the government's cost-cutting efforts. And Neo CEO Ali Partovi explains why he still focuses on backing founders with computer science backgrounds, even as AI takes over coding tasks. (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8594833557518893944",
        "title": "Bloomberg Technology: IBM & ServiceNow Beat Expectations",
        "url": "https://www.bloomberg.com/news/audio/2025-04-24/bloomberg-technology-ibm-servicenow-beat-expectations",
        "site": "bloomberg.com",
        "time": 1745516287000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-886319533740724767",
            "4873525114884706513",
            "4397272010118918629",
            "-5503223579974286307",
            "-8876316783571645453"
        ],
        "description": "Source: Bloomberg, 45:03 International Business Machines Corp Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "437923965939789295",
        "title": "IBM plunges as market expected stronger Q1 Software segment performance",
        "url": "https://seekingalpha.com/news/4434920-ibm-plunges-as-market-expected-stronger-q1-software-segment-performance",
        "site": "seekingalpha.com",
        "time": 1745503566000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3168613609528944228",
        "title": "IBM saw 15 federal contracts canceled by DOGE during Q1 2025",
        "url": "https://www.datacenterdynamics.com/en/news/ibm-saw-15-federal-contracts-canceled-by-doge-during-q1-2025/",
        "site": "datacenterdynamics.com",
        "time": 1745502888000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Company loses $100 million in future payments but downplays impact in earnings call",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8717405559985670910",
        "title": "Is IBM Stock Headed To $170? - Despite reporting strong year-over-year growth, the results ...",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/24/is-ibm-stock-headed-to-170/",
        "site": "forbes.com",
        "time": 1745498594000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Despite reporting strong year-over-year growth, the results presented a mixed picture. Despite reporting strong year-over-year growth, the results presented a mixed picture.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8768952080916046402",
        "title": "IBM price, Q1 earnings: Stock sinks 6% after news that Elon Musk’s DOGE cuts thwarted 15 government contracts",
        "url": "https://www.fastcompany.com/91322634/ibm-stock-price-down-q1-2025-earnings-elon-musk-doge-cuts-thwart-15-government-contracts?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1745497800000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Over the past 30 days, many big-name tech giants have seen their stock prices fall hard, largely thanks to President Trump’s chaotic tariff rollout. For example, Apple (Nasdaq: AAPL) has seen its shares fall 11% over the past month, while Nvidia has seen its shares fall (Nasdaq: NVDA) fall over 12%. But until yesterday, IBM (NYSE: IBM) was one of the big-name tech giants that rode out the tariff storm pretty well. While IBM’s stock price did tank along with the rest of the markets in early April, it has recovered nicely since then and, as of the close of bell yesterday, its shares were actually up just a bit (about 0.6%) over the past 30 days. But then IBM announced its Q1 2025 results yesterday, and its stock sank after hours. And today, as of the time of this writing, IBM shares are down more than 6.75% in pre-market trading. The main reason? You can blame Elon Musk’s DOGE. IBM Q1 2025 results When a stock drops after a company reports its latest quarterly results, it’s natural to assume it is doing so because the company in question posted poor numbers. But that actually wasn’t the case with IBM yesterday. By all accounts, IBM had a pretty good quarter. Here are its most salient numbers: Revenue: $14.5 billion (up 1%, or up 2% on a constant currency basis) Earnings per share (EPS): $1.60 As noted by CNBC, those critical metrics actually beat analysts’ estimates, which had expected revenue of $14.4 billion and an EPS of just $1.40. “We exceeded expectations for revenue, profitability and free cash flow in the quarter, led by strength across our Software portfolio,” IBM CEO Arvind Krishna said in a statement announcing the company’s Q1 results. “There continues to be strong demand for generative AI and our book of business stands at more than $6 billion inception-to-date, up more than $1 billion in the quarter.” But if this is the case, why did IBM’s shares drop? It’s all because of DOGE. IBM stock price falls as DOGE takes a bite out of its government contracts biz Unfortunately for IBM’s stock price, the company also announced last night that 15 of its government contracts had either been canceled or paused due to cuts initiated by Elon Musk’s Department of Government Efficiency (DOGE). Bloomberg reports that these cuts equate to about $100 million in future payments. Addressing the cuts on the company’s financial call, IBM’s chief financial officer, James Kavanaugh, said that federal sales account for less than 5% of the company’s overall revenue. However, Krishna noted that DOGE’s downscaling of the U.S. government did leave IBM’s consulting unit “more susceptible to discretionary pullbacks and DOGE-related initiatives.” As noted by Reuters, the impact of the DOGE cuts on IBM’s business sent the company’s shares lower in after-hours trading yesterday. IBM issues rare quarterly guidance But IBM also announced something else yesterday—guidance for the second quarter. Historically, IBM has not issued quarterly guidance, but as Reuters notes, the company decided to do so now. “We’ve chosen now, in light of the very unprecedented dynamic of uncertainty going on in the market, to give a second-quarter revenue guidance range. We felt incumbent upon ourselves to give as much transparency as possible to our investor group,” IBM’s Kavanaugh announced yesterday. That forecast revealed that IBM expects Q2 2025 revenue of between $16.40 billion and $16.75 billion. That’s slightly above analysts’ forecasts of $16.33 billion, noted Reuters. Still, that attempt at reducing uncertainty in investors didn’t do enough to counteract the effects that the DOGE cuts had. In premarket trading this morning, as of the time of this writing, IBM stock is down 6.75% to $228.90. As of yesterday’s close of $245.48 before IBM’s Q1 results were released, the company’s shares had been up over 11.6% for the year so far—an impressive return considering all the market turmoil over the past three weeks.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3158801332098828340",
        "title": "Stocks Dip As China Rebuffs Tariffs; Uncertainty Clouds IBM Earnings | Bloomberg Brief 04/24/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-04-24/bloomberg-brief-04-24-2025-video",
        "site": "bloomberg.com",
        "time": 1745491097000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Stocks dip as China rebuffs suggestions that talks have begun between Asia's biggest economy and the US over trade. President Trump signaled that a new tariff rate could be imposed on China within weeks. IBM delivered a beat, but investors sell off the stock due to concerns over government cost-cutting and economic uncertainty. Ella Hoxha of Newton Investment Management calls the volatility of the moment a good time for active management. Garrett Melson of Natixis Advisors says the current uncertainty is weighing on consumers, investors and business leaders. “Bloomberg Brief” delivers the market news, data and analysis you need to set your agenda. (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7086068639883817442",
        "title": "IBM's Consulting business sees limited impact from DOGE spending cuts",
        "url": "https://seekingalpha.com/news/4434673-ibms-consulting-business-sees-limited-impact-from-doge-spending-cuts",
        "site": "seekingalpha.com",
        "time": 1745491027000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2514690729340710752",
        "title": "Biggest stock movers Thursday: IBM, NOK, and more",
        "url": "https://seekingalpha.com/news/4434604-biggest-stock-movers-thursday-ibm-txn-and-more",
        "site": "seekingalpha.com",
        "time": 1745485217000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-9218840990370396794",
        "title": "Whitecap Resources GAAP EPS of $0.27, revenue of $942.2M beats by $393.18M",
        "url": "https://seekingalpha.com/news/4434595-whitecap-resources-gaap-eps-of-027-revenue-of-9422m-beats-by-39318m",
        "site": "seekingalpha.com",
        "time": 1745478666000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-2217029752200238932",
            "-2597140180393738711",
            "8765528174538500048",
            "-6568926649185747274",
            "5632670615747405010",
            "391965897045724022",
            "-1192610657841898520",
            "8338932674760437811",
            "7818704082338861903",
            "3003593580752076764",
            "-4762319547782651966",
            "7017971653065096192",
            "1046152720772090463"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "6597736793236184531",
        "title": "The Lotus Eletre SUV’s $230,000 Price Tag Is a Marketing Strategy",
        "url": "https://www.bloomberg.com/news/articles/2025-04-24/review-why-does-the-lotus-eletre-suv-cost-230-000-marketing",
        "site": "bloomberg.com",
        "time": 1745478032000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Brand executives want consumers to consider the new SUV against those from Ferrari and Lamborghini. The 2025 Lotus Eletre is available now in the US, while supplies last.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3043586591536355500",
        "title": "Trump & Bessent on China Tariffs, IBM Results Disappoint, More",
        "url": "https://www.bloomberg.com/news/audio/2025-04-24/trump-bessent-on-china-tariffs-ibm-results-disappoint-more",
        "site": "bloomberg.com",
        "time": 1745464970000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Source: Bloomberg, 5:00 International Business Machines Corp Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5116356678997929130",
        "title": "Trump on China Trade Talks, TI & IBM Earnings Beat, More",
        "url": "https://www.bloomberg.com/news/audio/2025-04-24/trump-on-china-trade-talks-ti-ibm-earnings-beat-more",
        "site": "bloomberg.com",
        "time": 1745455397000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Source: Bloomberg, 4:60 International Business Machines Corp Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1184404563164418830",
        "title": "IBM Q1 2025 Earnings: CEO Krishna Maintains Financial Forecast Despite DOGE Cuts, Economic Uncertainty",
        "url": "https://www.crn.com/news/cloud/2025/ibm-q1-2025-earnings-ceo-krishna-maintains-financial-forecast-despite-doge-cuts-economic-uncertainty",
        "site": "crn.com",
        "time": 1745452980000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM CEO Arvind Krishna reports Q1 2025 earnings, talks DOGE impacts, economic uncertainty, growth in Red Hat, AI, GenAI, automation.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2923895681987882899",
        "title": "Ibm maintains 2025 guidance with 5%+ revenue growth and $13.5B free cash flow target",
        "url": "https://seekingalpha.com/news/4434552-ibm-maintains-2025-guidance-with-5-percent-revenue-growth-and-13_5b-free-cash-flow-target",
        "site": "seekingalpha.com",
        "time": 1745452650000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7467480788137075743",
        "title": "Trump Rebukes FT Report, IBM Dips After Results Disappoint, More",
        "url": "https://www.bloomberg.com/news/audio/2025-04-23/trump-rebukes-ft-report-ibm-dips-after-results-disappoint-more",
        "site": "bloomberg.com",
        "time": 1745448603000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-3043586591536355500",
            "5116356678997929130"
        ],
        "description": "Source: Bloomberg, 4:48 International Business Machines Corp Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4419108541566176975",
        "title": "IBM affected by DOGE cuts, downplays impact during Q1 earnings call",
        "url": "https://techcrunch.com/2025/04/23/ibm-affected-by-doge-cuts-downplays-impact-during-q1-earnings-call/",
        "site": "techcrunch.com",
        "time": 1745447449000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Tech and consulting giant IBM was not immune to the Department of Government Efficiency’s (DOGE) cuts. IBM had 15 of its federal contracts cancelled due to DOGE-related cuts during the first quarter of 2025, according to reporting from Reuters and Bloomberg. These cuts amount to $100 million in future payments, per Bloomberg. Federal contracts represent […]",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-45234898512675596",
        "title": "IBM says it’s bullish despite ‘fluid’ economy, but stock falls after hours",
        "url": "https://www.marketwatch.com/story/ibm-says-its-bullish-despite-fluid-economy-but-stock-falls-after-hours-94d4cfe1?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1745440620000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Tech-infrastructure giant IBM on Wednesday offered a solid sales outlook despite worries about the impact of a global trade war on the economy and tech spending, but its shares still fell after hours.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5199670319284205637",
        "title": "IBM reports Q1 revenue up 0.6% YoY to $14.54B, vs. $14.4B est., software revenue up 7% to $6.34B, and maintains its full-year forecast (Jordan Novet/CNBC)",
        "url": "http://www.techmeme.com/250423/p46#a250423p46",
        "site": "techmeme.com",
        "time": 1745439938000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Jordan Novet / CNBC: IBM reports Q1 revenue up 0.6% YoY to $14.54B, vs. $14.4B est., software revenue up 7% to $6.34B, and maintains its full-year forecast — IBM reported better-than-expected earnings and revenue for the first quarter on Wednesday. The stock slipped 2% in extended trading. — Here's how the company performed:",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7645273466967202972",
        "title": "IBM beats on earnings and revenue, maintains full-year guidance",
        "url": "https://www.cnbc.com/2025/04/23/ibm-q1-earnings-report-2025.html",
        "site": "cnbc.com",
        "time": 1745439460000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "2923895681987882899"
        ],
        "description": "IBM is sticking with its expectations for 2025 despite a \"fluid\" economic environment.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4508708784803452340",
        "title": "IBM Posts Sales Topping Estimates, Says DOGE Hit 15 Contracts",
        "url": "https://www.bloomberg.com/news/articles/2025-04-23/ibm-posts-sales-topping-estimates-says-doge-hit-15-contracts",
        "site": "bloomberg.com",
        "time": 1745438967000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "3617257143591040438"
        ],
        "description": "International Business Machines Corp. reported better-than-expected quarterly revenue and profit, quieting investor fears of economic disruption from tariffs and federal cost cuts. IBM offices in Changi Business Park, Singapore. Photographer: Aparna Nori/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2867576662610927895",
        "title": "IBM Non-GAAP EPS of $1.60 beats by $0.17, revenue of $14.54B beats by $150M",
        "url": "https://seekingalpha.com/news/4434356-ibm-non-gaap-eps-of-1_60-beats-by-0_17-revenue-of-14_54b-beats-by-150m",
        "site": "seekingalpha.com",
        "time": 1745438954000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "190889063611712740",
        "title": "Lotus Technology reports Q4 results",
        "url": "https://seekingalpha.com/news/4433181-lotus-technology-reports-q4-results",
        "site": "seekingalpha.com",
        "time": 1745323718000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3200416160025320489",
        "title": "Manychat, which offers social messaging tools for brands, raised a $140M Series B led by Summit, after an $18M Series A in 2019, and says it has ~1.5M customers (Ingrid Lunden/TechCrunch)",
        "url": "http://www.techmeme.com/250422/p7#a250422p7",
        "site": "techmeme.com",
        "time": 1745321401000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Ingrid Lunden / TechCrunch: Manychat, which offers social messaging tools for brands, raised a $140M Series B led by Summit, after an $18M Series A in 2019, and says it has ~1.5M customers — Chatbots and other kinds of AI agents — and the companies that build them — may feel like a dime a dozen these days.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1876410546322248127",
        "title": "How To Trade IBM Stock Ahead of Its Earnings?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/22/how-to-trade-ibm-stock-ahead-of-its-earnings/",
        "site": "forbes.com",
        "time": 1745317811000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Over the last five years, IBM has delivered positive one-day returns in 60% of earnings announcements, with a median gain of 4.8% and a maximum single-day jump of 13% ... Over the last five years, IBM has delivered positive one-day returns in 60% of earnings announcements, with a median gain of 4.8% and a maximum single-day jump of 13% ...",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2712145986345647431",
        "title": "IBM Q1 2025 Earnings Preview: 5 Things To Know",
        "url": "https://www.crn.com/news/ai/2025/ibm-q1-2025-earnings-preview-5-things-to-know",
        "site": "crn.com",
        "time": 1745270880000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Trump tariff impacts, the z17 mainframe refresh cycle and Red Hat, HashiCorp momentum are among the topics expected to come up during IBM’s 1Q 2025 earnings call Wednesday.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-843891746969303376",
        "title": "IBM remains safer 'defensive' play in the face of economic headwinds: JP Morgan",
        "url": "https://seekingalpha.com/news/4432785-ibm-remains-safer-defensive-play-in-the-face-of-economic-headwinds-jp-morgan",
        "site": "seekingalpha.com",
        "time": 1745247312000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8772940947440538112",
        "title": "Tesla, Alphabet, Verizon, Chipotle, IBM, Boeing, and Many More Stocks to Watch This Week",
        "url": "https://www.barrons.com/articles/tesla-alphabet-verizon-chipotle-ibm-boeing-stocks-watch-86902706?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1745172000000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1787896696239559383",
        "title": "Earnings week ahead: TSLA, GOOG, GE, BA, PG, PEP, ABBV, V, T, AAL, LUV, INTC, IBM, and more",
        "url": "https://seekingalpha.com/news/4432457-earnings-week-ahead-tsla-goog-ge-ba-pg-pep-abbv-v-t-aal-luv-intc-ibm-and-more",
        "site": "seekingalpha.com",
        "time": 1745150450000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5725169397336134855",
        "title": "Over 70% of companies deliver EPS wins this week: Earnings Scorecard | $NFLX $GE $IBM $AMZN $T",
        "url": "https://seekingalpha.com/news/4432466-over-70-of-companies-deliver-eps-wins-this-week-earnings-scorecard",
        "site": "seekingalpha.com",
        "time": 1745069125000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7071746665051970132",
        "title": "Apollo Taps Cohn as Lead Independent Director, Names Rowan Chair",
        "url": "https://www.bloomberg.com/news/articles/2025-04-17/apollo-taps-cohn-as-lead-independent-director-names-rowan-chair",
        "site": "bloomberg.com",
        "time": 1744922953000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Apollo Global Management Inc. tapped ex-Goldman Sachs Group Inc. President Gary Cohn as lead independent director and gave Chief Executive Officer Marc Rowan the additional title of board chair. Gary Cohn, vice chairman of International Business Machines Corp., during the Bloomberg Invest event in New York, US, on Tuesday, March 4, 2025. The conference invites leaders in asset management, banking, wealth, and private markets to track, dissect, and predict the future's greatest changes, risks and opportunities.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8525947307062320359",
        "title": "Hooker Furnishings plans $18M-$20M annual cost savings by fiscal 2027",
        "url": "https://seekingalpha.com/news/4432292-hooker-furnishings-plans-18m-20m-annual-cost-savings-by-fiscal-2027",
        "site": "seekingalpha.com",
        "time": 1744905467000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-719130359301413382",
        "title": "Lotus Technology to acquire majority stake in Lotus UK from Geely, shares down | $LOT",
        "url": "https://seekingalpha.com/news/4431711-lotus-technology-to-acquire-majority-stake-in-lotus-uk-from-geely-shares-down",
        "site": "seekingalpha.com",
        "time": 1744817032000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-9011041734535217571",
        "title": "Nvidia GB200s now available 'at scale' on CoreWeave",
        "url": "https://www.datacenterdynamics.com/en/news/nvidia-gb200s-now-available-at-scale-on-coreweave/",
        "site": "datacenterdynamics.com",
        "time": 1744801205000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Early customers include IBM, Mistral AI, and Cohere",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3338777982599623354",
        "title": "IBM launches Aachen, a 156-qubit quantum system powered by Heron r2 processor",
        "url": "https://www.datacenterdynamics.com/en/news/ibm-launches-aachen-a-156-qubit-quantum-system-powered-by-heron-r2-processor/",
        "site": "datacenterdynamics.com",
        "time": 1744786804000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "System deployed in the company’s IBM Quantum Data Center in Germany",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-924259271939868982",
        "title": "Sonder announces $18M capital raise and cost reductions",
        "url": "https://seekingalpha.com/news/4430867-sonder-announces-18m-capital-raise-and-cost-reductions",
        "site": "seekingalpha.com",
        "time": 1744638285000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6859922715183654372",
        "title": "Bill Gates-backed Arnergy to expand solar access in Nigeria with $18M as demand surges",
        "url": "https://techcrunch.com/2025/04/14/arnergy-to-expand-solar-access-in-nigeria-with-18m-series-b/",
        "site": "techcrunch.com",
        "time": 1744617900000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Demand for solar energy in power-starved Nigeria has soared in the last decade thanks to worsening grid reliability and rising fuel costs. That’s drawn investor interest to Arnergy, a cleantech startup meeting that need. The company just raised a $15 million Series B extension (on top of a $3 million B1 round last year), bringing […]",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2592064984226985162",
        "title": "IBM Informs Staff of DEI Retreat as Trump-Era Scrutiny Grows",
        "url": "https://www.bloomberg.com/news/articles/2025-04-10/ibm-informs-staff-of-dei-retreat-as-trump-era-scrutiny-grows",
        "site": "bloomberg.com",
        "time": 1744326028000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "International Business Machines Corp. spent months revising its diversity initiatives as conservative attacks and souring attitudes toward DEI shifted into a full-blown assault from President Donald Trump. IBM offices in Foster City, California, US, on Wednesday, June 14, 2023. International Business Machines Corp. (IBM) is expected to release earnings figures on July 19. Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7124986874226513167",
        "title": "Goodfellow GAAP EPS of -C$0.27, revenue of C$111.18M",
        "url": "https://seekingalpha.com/news/4430290-goodfellow-gaap-eps-of-c027-revenue-of-c11118m",
        "site": "seekingalpha.com",
        "time": 1744319747000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "6170218354139299943",
        "title": "Lotus Technology appoints Daxue Wang as CFO | $LOT",
        "url": "https://seekingalpha.com/news/4429578-lotus-technology-appoints-daxue-wang-as-cfo",
        "site": "seekingalpha.com",
        "time": 1744144743000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1234964114904400519",
        "title": "IBM Sets June Date for AI Agent Era z17 Mainframes",
        "url": "https://www.crn.com/news/cloud/2025/ibm-sets-june-date-for-ai-agent-era-z17-mainframes",
        "site": "crn.com",
        "time": 1744138260000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM revealed a host of upcoming product releases including z17, Spyre accelerators, Z Operations Unite, z/OS 3.2, COBOL Upgrade Advisor, plus introducing HashiCorp capabilities.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-5141485004057180497",
        "title": "IBM unveils next-generation z17 mainframe",
        "url": "https://www.datacenterdynamics.com/en/news/ibm-unveils-next-generation-z17-mainframe/",
        "site": "datacenterdynamics.com",
        "time": 1744121010000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Has been specifically engineered to support AI workloads",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6116501629630287911",
        "title": "IBM introduces new mainframe to support multimodel AI at scale",
        "url": "https://seekingalpha.com/news/4429331-ibm-introduces-new-mainframe-to-support-multimodel-ai-at-scale",
        "site": "seekingalpha.com",
        "time": 1744104304000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7359692113591513163",
        "title": "IBM unveils the z17 mainframe with a Telum II chip, built for 250+ AI use cases and can perform 450B daily inferences, 50% more than z16, available on June 8 (Rebecca Szkutak/TechCrunch)",
        "url": "http://www.techmeme.com/250408/p1#a250408p1",
        "site": "techmeme.com",
        "time": 1744087201000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Rebecca Szkutak / TechCrunch: IBM unveils the z17 mainframe with a Telum II chip, built for 250+ AI use cases and can perform 450B daily inferences, 50% more than z16, available on June 8 — IBM is releasing the latest version of its mainframe hardware that includes new updates meant to accelerate AI adoption.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7572406722933410989",
        "title": "IBM releases a new mainframe built for the age of AI",
        "url": "https://techcrunch.com/2025/04/07/ibm-releases-a-new-mainframe-built-for-the-age-of-ai/",
        "site": "techcrunch.com",
        "time": 1744084860000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM is releasing the latest version of its mainframe hardware that includes new updates meant to accelerate AI adoption. The hardware and consulting company on Monday announced IBM z17, the latest version of its mainframe computer hardware. This fully encrypted mainframe is powered by an IBM Telum II processor and is designed for more than […]",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7349975826353191127",
        "title": "IBM Launches New Mainframe in Bet That Some Data Stays Local",
        "url": "https://www.bloomberg.com/news/articles/2025-04-08/ibm-launches-new-mainframe-in-bet-that-some-data-stays-local",
        "site": "bloomberg.com",
        "time": 1744084860000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "International Business Machines Corp. unveiled its latest mainframe system, saying that a chunk of business data will remain on customer-owned servers and never be hosted on the cloud.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4885480803499106135",
        "title": "IBM Buys Snowflake-Focused Data, AI Consultancy Hakkoda",
        "url": "https://www.crn.com/news/ai/2025/ibm-buys-snowflake-focused-data-ai-consultancy-hakkoda",
        "site": "crn.com",
        "time": 1744051560000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM buys Hakkoda to boost Snowflake and other consulting offers in data, AI.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2619106660952045635",
        "title": "IBM acquires Hakkoda to continue its AI consultancy investment push",
        "url": "https://techcrunch.com/2025/04/07/ibm-acquires-consultancy-hakkoda-as-it-continues-its-ai-investment-push/?.tsrc=rss",
        "site": "techcrunch.com",
        "time": 1744034882000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM on Monday said it has acquired Hakkoda, a data and AI consultancy based in New York. The acquisition would \"further expand\" IBM's ability to bring consultants and AI to clients, particularly customers in industries like financial services, public sector, and healthcare and life sciences, said Mohamad Ali, SVP and head of IBM's consulting business, in a statement. \"With Hakkoda's data expertise, deep technology partnerships, and asset-centric delivery model, IBM will be even better-positioned",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3774634272794901812",
        "title": "IBM announces acquisition of Hakkoda",
        "url": "https://seekingalpha.com/news/4429159-ibm-announces-acquisition-of-hakkoda",
        "site": "seekingalpha.com",
        "time": 1744034592000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8738909201138672820",
        "title": "GreenSquareDC files to upgrade and expand Sydney data center site",
        "url": "https://www.datacenterdynamics.com/en/news/greensquaredc-files-to-upgrade-and-expand-sydney-data-center-site/",
        "site": "datacenterdynamics.com",
        "time": 1744022097000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Company looks to expand former IBM site",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1765804349374734868",
        "title": "Google, Microsoft and IBM are bullish on quantum computing. Are the chips of the future for real?",
        "url": "https://www.cnbc.com/2025/04/06/google-ibm-bullish-quantum-computing-is-it-real.html",
        "site": "cnbc.com",
        "time": 1743947867000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Quantum promises huge breakthroughs in drug discovery and last-mile delivery, but there are still unknowns about what a world in quantum's hands will mean.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6238201078964166519",
        "title": "Intel's Gaudi 3 AI chips now available on IBM Cloud",
        "url": "https://www.datacenterdynamics.com/en/news/intels-gaudi-3-ai-chips-now-available-on-ibm-cloud/",
        "site": "datacenterdynamics.com",
        "time": 1743763554000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Chips offered from IBM's Frankfurt and Washington DC regions",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-5671264426052541065",
        "title": "Goldman’s Special Bonuses for CEO, President Lack Rigor, ISS Says",
        "url": "https://www.bloomberg.com/news/articles/2025-04-01/goldman-s-special-bonuses-for-ceo-president-lack-rigor-iss-says",
        "site": "bloomberg.com",
        "time": 1743474451000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Goldman Sachs Group Inc.’s $80 million retention bonuses for the firm’s top two leaders have drawn another prominent critic, with Institutional Shareholder Services urging investors to reject the rewards at an annual meeting. David Solomon Photographer: Jeenah Moon/Bloomberg",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8676626798572093984",
        "title": "CoreWeave shares slump nearly 10% in second day of trading",
        "url": "https://www.cnbc.com/2025/03/31/coreweave-stock-slumps-in-second-day-of-trading-ipo.html",
        "site": "cnbc.com",
        "time": 1743432482000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "CoreWeave rents out access to Nvidia graphics processing units to other large tech and AI companies including Meta, IBM and Cohere.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7364331566383676336",
        "title": "GPU Analysis Identifying Performance Bottlenecks That Cause Throughput Plateaus In Large-Batch Inference",
        "url": "https://semiengineering.com/gpu-analysis-identifying-performance-bottlenecks-that-cause-throughput-plateaus-in-large-batch-inference/",
        "site": "semiengineering.com",
        "time": 1743356704000,
        "favicon_url": "https://static.tickertick.com/website_icons/semiengineering.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "A new technical paper titled “Mind the Memory Gap: Unveiling GPU Bottlenecks in Large-Batch LLM Inference” was published by researchers at Barcelona Supercomputing Center, Universitat Politecnica de Catalunya, and IBM Research. Abstract “Large language models have been widely adopted across different tasks, but their auto-regressive generation nature often leads to inefficient resource utilization during inference.... » read more The post GPU Analysis Identifying Performance Bottlenecks That Cause Throughput Plateaus In Large-Batch Inference appeared first on Semiconductor Engineering. A new technical paper titled “Mind the Memory Gap: Unveiling GPU Bottlenecks in Large-Batch LLM Inference” was published by researchers at Barcelona Supercomputing Center, Universitat Politecnica de Catalunya, and IBM Research. Abstract “Large language models have been widely adopted across different tasks, but their auto-regressive generation nature often leads to inefficient resource utilization during inference. While batching is commonly used to increase throughput, performance gains plateau beyond a certain batch size, especially with smaller models, a phenomenon that existing literature typically explains as a shift to the compute-bound regime. In this paper, through an in-depth GPU-level analysis, we reveal that large-batch inference remains memory-bound, with most GPU compute capabilities underutilized due to DRAM bandwidth saturation as the primary bottleneck. To address this, we propose a Batching Configuration Advisor (BCA) that optimizes memory allocation, reducing GPU memory requirements with minimal impact on throughput. The freed memory and underutilized GPU compute capabilities can then be leveraged by concurrent workloads. Specifically, we use model replication to improve serving throughput and GPU utilization. Our findings challenge conventional assumptions about LLM inference, offering new insights and practical strategies for improving resource utilization, particularly for smaller language models.” Find the technical paper here. March 2025. Recasens, Pol G., Ferran Agullo, Yue Zhu, Chen Wang, Eun Kyung Lee, Olivier Tardieu, Jordi Torres, and Josep Ll Berral. “Mind the Memory Gap: Unveiling GPU Bottlenecks in Large-Batch LLM Inference.” arXiv preprint arXiv:2503.08311 (2025). The post GPU Analysis Identifying Performance Bottlenecks That Cause Throughput Plateaus In Large-Batch Inference appeared first on Semiconductor Engineering.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7739923134420025996",
        "title": "Entera Bio GAAP EPS of -$0.25 beats by $0.03, revenue of $0.18M beats by $0.04M",
        "url": "https://seekingalpha.com/news/4426625-entera-bio-gaap-eps-of-0_25-beats-by-0_03-revenue-of-0_18m-beats-by-0_04m",
        "site": "seekingalpha.com",
        "time": 1743192969000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-2867576662610927895"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7815796299746225579",
        "title": "P3 Health Partners GAAP EPS of -$0.36 misses by $0.25, revenue of $30.7M misses by $348.18M",
        "url": "https://seekingalpha.com/news/4426054-p3-health-partners-gaap-eps-of-0_36-misses-by-0_25-revenue-of-30_7m-misses-by-348_18m",
        "site": "seekingalpha.com",
        "time": 1743107224000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "418523320017568749",
        "title": "Proxy advisor ISS recommends voting for BP's board, executives",
        "url": "https://seekingalpha.com/news/4425376-proxy-advisor-iss-recommends-voting-for-bps-board-executives",
        "site": "seekingalpha.com",
        "time": 1743008005000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4171707044727026020",
        "title": "Has GetReal cracked the code on AI deepfakes? $18M and an impressive client list says yes",
        "url": "https://techcrunch.com/2025/03/26/has-getreal-cracked-the-code-on-ai-deepfakes-18m-and-an-impressive-client-list-says-yes/",
        "site": "techcrunch.com",
        "time": 1743006525000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "The proliferation of scarily realistic deepfakes is one of the more pernicious byproducts of the rise of AI, and falling victim to scams based on these deepfakes is already costing companies millions of dollars — not to mention the implications these could have on national security. A startup that’s built a toolset aimed at governments […]",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-73782936824877143",
        "title": "Zuken Joins IBM Research AI Hardware Center to Develop Next-Generation AI Hardware Solutions",
        "url": "https://www.eejournal.com/industry_news/zuken-joins-ibm-research-ai-hardware-center-to-develop-next-generation-ai-hardware-solutions/",
        "site": "eejournal.com",
        "time": 1742908068000,
        "favicon_url": "https://static.tickertick.com/website_icons/eejournal.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "WESTFORD, MASS, USA, March 24, 2025 – Today, Zuken Inc. announced an agreement with IBM to join the IBM Research AI Hardware Center as a commercial member. The IBM Research AI Hardware Center, a global research hub headquartered at the Albany NanoTech Complex in Albany, NY, aims to develop next-generation chips and systems, including advanced semiconductor … Read More → \"Zuken Joins IBM Research AI Hardware Center to Develop Next-Generation AI Hardware Solutions\" WESTFORD, MASS, USA, March 24, 2025 – Today, Zuken Inc. announced an agreement with IBM to join the IBM Research AI Hardware Center as a commercial member. The IBM Research AI Hardware Center, a global research hub headquartered at the Albany NanoTech Complex in Albany, NY, aims to develop next-generation chips and systems, including advanced semiconductor packaging, that support the processing power and unprecedented speed that AI requires. Zuken has also signed an agreement with IBM for the joint research and development of heterogeneous chip integration packaging solutions, which is critical for AI accelerator architecture. The collaboration will focus on 3-D integrated circuit (3DIC) packaging design for advanced semiconductors and optimizing Electronic Design Automation (EDA) workflows. Zuken will support the evaluation of a prototype deep learning accelerator core from IBM’s digital and analog projects. Additionally, Zuken will contribute to material development and processes modeling, and integration assembly methods for interconnecting multiple IC dies within a semiconductor packaging module. The agreement will further focus on reliability testing, performance simulation, and hardware validation. “Zuken is pleased to collaborate with IBM Research as a member of the AI Hardware Center and joint development partner,” said Kazuhiro Kariya, Zuken’s Senior Managing Executive Officer and CTO. “Our unique system-level design platform supports innovation in 3DIC heterogeneous integration design process by enabling a practical SOC/package/PCB co-design environment. Zuken aims to play an important role in the next-generation high-end device development ecosystem.” “We are thrilled to be working with Zuken to accelerate chip packaging and AI hardware innovation,” said Jeff Burns, Director of the IBM Research AI Hardware Center. “These advances will play a critical role in unlocking the performance and efficiency needed for the future of AI.” Zuken views 3DIC packaging design as a key enabler for future technological innovation and continues to invest in R&D. Open collaboration with industry consortiums is critical, and our collaboration with IBM Research reflects our commitment to expanding technological capabilities and providing innovative solutions to our customers. About Zuken Zuken is a global software company providing industry leading electrical and electronic design solutions. Founded in 1976, Zuken has a long track record of technology innovation and financial stability in the electronic design automation (EDA) industry. With a product portfolio of world-class design solutions spanning MBSE-based product definition and services to electrical and electronic design solutions to address the needs of a broad range of industries across the globe. These design solutions provide our customers with improved productivity and efficiencies in this highly competitive landscape. For more information about the company and its products, visit www.zuken.com.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8143129241933491406",
        "title": "HW Implementation Of An ONN Coupled By A ReRAM Crossbar Array (IBM, TU Eindhoven)",
        "url": "https://semiengineering.com/hw-implementation-of-an-onn-coupled-by-a-reram-crossbar-array-ibm-tu-eindhoven/",
        "site": "semiengineering.com",
        "time": 1742886219000,
        "favicon_url": "https://static.tickertick.com/website_icons/semiengineering.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "A new technical paper titled “Hardware Implementation of Ring Oscillator Networks Coupled by BEOL Integrated ReRAM for Associative Memory Tasks” was published by researchers at IBM Research Europe and Eindhoven University of Technology. Abstract “We demonstrate the first hardware implementation of an oscillatory neural network (ONN) utilizing resistive memory (ReRAM) for coupling elements. A ReRAM... » read more The post HW Implementation Of An ONN Coupled By A ReRAM Crossbar Array (IBM, TU Eindhoven) appeared first on Semiconductor Engineering. A new technical paper titled “Hardware Implementation of Ring Oscillator Networks Coupled by BEOL Integrated ReRAM for Associative Memory Tasks” was published by researchers at IBM Research Europe and Eindhoven University of Technology. Abstract “We demonstrate the first hardware implementation of an oscillatory neural network (ONN) utilizing resistive memory (ReRAM) for coupling elements. A ReRAM crossbar array chip, integrated into the Back End of Line (BEOL) of CMOS technology, is leveraged to establish dense coupling elements between oscillator neurons, allowing phase-encoded analog information to be processed in-memory. We also realize an ONN architecture design with the coupling ReRAM array. To validate the architecture experimentally, we present a conductive metal oxide (CMO)/HfOx ReRAM array chip integrated with a 2-by-2 ring oscillator-based network. The system successfully retrieves patterns through correct binary phase locking. This proof of concept underscores the potential of ReRAM technology for large-scale, integrated ONNs.” Find the technical paper here. March 2025. Choi, Wooseok, Thomas van Bodegraven, Jelle Verest, Olivier Maher, Donato Francesco Falcone, Antonio La Porta, Daniel Jubin et al. “Hardware Implementation of Ring Oscillator Networks Coupled by BEOL Integrated ReRAM for Associative Memory Tasks.” arXiv preprint arXiv:2503.14126 (2025). The post HW Implementation Of An ONN Coupled By A ReRAM Crossbar Array (IBM, TU Eindhoven) appeared first on Semiconductor Engineering.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4923337419446206401",
        "title": "AWS Vs. Azure Vs. GCP Vs. Oracle Vs. IBM Customer Spending Face-Off: Report",
        "url": "https://www.crn.com/news/cloud/2025/aws-vs-azure-vs-gcp-vs-oracle-vs-ibm-customer-spending-face-off-report",
        "site": "crn.com",
        "time": 1742837400000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Here’s a breakdown of public cloud customer spending on AWS, Microsoft Azure, Google Cloud Platform, Oracle OCI and IBM workloads, according to Flexera’s 2025 cloud report.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7854479127147140733",
        "title": "Lotus Technology sees strong rally off its recent all-time low",
        "url": "https://seekingalpha.com/news/4424275-lotus-technology-sees-strong-rally-off-its-recent-all-time-low",
        "site": "seekingalpha.com",
        "time": 1742831060000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4186682020272642018",
        "title": "IBM in spotlight as Wedbush adds to Best Ideas List",
        "url": "https://seekingalpha.com/news/4423941-ibm-in-spotlight-as-wedbush-adds-to-best-ideas-list",
        "site": "seekingalpha.com",
        "time": 1742815678000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1579276461153867129",
        "title": "Research shows a surge in the popularity of deepfake porn services, with the 10 most popular \"nudifying\" websites receiving 18M views in January 2025 alone (Margi Murphy/Bloomberg)",
        "url": "http://www.techmeme.com/250323/p13#a250323p13",
        "site": "techmeme.com",
        "time": 1742766601000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Margi Murphy / Bloomberg: Research shows a surge in the popularity of deepfake porn services, with the 10 most popular “nudifying” websites receiving 18M views in January 2025 alone — An introduction to the Levittown podcast. Plus: Another billionaire's space dreams.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6856030361342208760",
        "title": "Why startups and tech giants are racing to build a practical quantum computer",
        "url": "https://www.cnbc.com/2025/03/21/the-race-to-build-a-practical-quantum-computer.html",
        "site": "cnbc.com",
        "time": 1742576386000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Amazon, IBM, Google, Intel and Microsoft are all working on quantum technology. Governments around the world have also invested over $55 billion in the tech.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2708902529548791860",
        "title": "IBM Cuts From Roles In Neudesic, Cloud Classic Operations",
        "url": "https://www.crn.com/news/cloud/2025/ibm-cuts-from-roles-in-neudesic-cloud-classic",
        "site": "crn.com",
        "time": 1742562900000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM makes cuts in Neudesic, the cloud division that came from SoftLayer and in roles related to the federal government workforce.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-5932646765700015589",
        "title": "111 Non-GAAP EPADS of -$0.04, revenue of $527.14M misses by $17.18M",
        "url": "https://seekingalpha.com/news/4422609-111-non-gaap-epads-of-004-revenue-of-52714m-misses-by-1718m",
        "site": "seekingalpha.com",
        "time": 1742447988000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2373212902664836155",
        "title": "Utila, which offers a multi-party computation crypto wallet service, raised an $18M Series A led by Nyca Partners, taking its total funding to $30M (Krisztian Sandor/CoinDesk)",
        "url": "http://www.techmeme.com/250319/p21#a250319p21",
        "site": "techmeme.com",
        "time": 1742391000000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Krisztian Sandor / CoinDesk: Utila, which offers a multi-party computation crypto wallet service, raised an $18M Series A led by Nyca Partners, taking its total funding to $30M — Utila, a digital asset operations platform, has raised $18 million in a Series A round to expand its multi-party computation (MPC) …",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "809235307844013582",
        "title": "Rio Tinto dismisses proxy advisers’ support for review of UK listing",
        "url": "https://www.ft.com/content/fd11bdc3-0436-4c45-b548-7d8afd2b1748",
        "site": "ft.com",
        "time": 1742358369000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "ISS and Glass Lewis back activist calls for further investigation into consolidating miner’s corporate structure in Australia",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1852369713597259254",
        "title": "The 10 most innovative computing companies of 2025",
        "url": "https://www.fastcompany.com/91269121/computing-most-innovative-companies-2025?.tsrc=rss",
        "site": "fastcompany.com",
        "time": 1742295600000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Why IBM, TSMC, Quantinuum, and SambaNova Systems are among Fast Company’s Most Innovative Companies in computing for 2025.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7004154572471387709",
        "title": "Channel Standouts: The 2025 CRN Tech Elite 250",
        "url": "https://www.crn.com/news/channel-news/2025/channel-standouts-the-2025-crn-tech-elite-250",
        "site": "crn.com",
        "time": 1742214600000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "The 2025 CRN Tech Elite 250 includes solution providers in the U.S. and Canada that have the highest partner levels and certifications from the IT industry’s leading vendors including AWS, Cisco, Dell, HPE and IBM.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-641086189085595431",
        "title": "Notable analyst calls this week: Verizon, Novo Nordisk and Intel stocks among top picks | $AAPL $CNP $IBM $MSFT $VZ",
        "url": "https://seekingalpha.com/news/4420820-notable-analyst-calls-this-week-verizon-novo-nordisk-and-intel-stocks-among-top-picks",
        "site": "seekingalpha.com",
        "time": 1742045756000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8075858960851964135",
        "title": "IBM to place quantum computer in Spain for Basque government",
        "url": "https://www.datacenterdynamics.com/en/news/ibm-to-place-quantum-computer-in-spain-for-basque-government/",
        "site": "datacenterdynamics.com",
        "time": 1742032804000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Upgrades prior agreement from a System One",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3227929559474686233",
        "title": "Senate Vote Avoids Shutdown, SpaceX Rocket off to ISS, More",
        "url": "https://www.bloomberg.com/news/audio/2025-03-15/senate-vote-avoids-shutdown-spacex-rocket-off-to-iss-more",
        "site": "bloomberg.com",
        "time": 1742009714000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Source: Bloomberg, 4:50",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7418877929792978589",
        "title": "Clean Energy Capital plans solar farm directly connected to IBM Hursley, UK, data center",
        "url": "https://www.datacenterdynamics.com/en/news/clean-energy-capital-plans-solar-farm-directly-connected-to-ibm-hursley-uk-data-center/",
        "site": "datacenterdynamics.com",
        "time": 1741959832000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "An IBM R&D center with a Grade II* listed building and a museum",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-547225656648171765",
        "title": "Communication is now even more important to getting renewable projects off the ground, experts say",
        "url": "https://www.cnbc.com/2025/03/14/better-communications-key-to-getting-renewable-projects-off-the-ground.html",
        "site": "cnbc.com",
        "time": 1741924220000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM's Christina Shim discussed the importance of communicating a sustainable project's business value, given the current political climate.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1507040294708262434",
        "title": "Generation Bio GAAP EPS of -$0.32, revenue of $4.18M",
        "url": "https://seekingalpha.com/news/4420538-generation-bio-gaap-eps-of-0_32-revenue-of-4_18m",
        "site": "seekingalpha.com",
        "time": 1741900110000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-6881318332793623388",
        "title": "IBM updates revenue categories in reportable segments",
        "url": "https://seekingalpha.com/news/4420311-ibm-updates-revenue-categories-in-reportable-segments",
        "site": "seekingalpha.com",
        "time": 1741871756000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "8367226527234348298",
        "title": "IBM’s Tellum II Voltage Guard Band Reduction",
        "url": "https://semiengineering.com/ibms-tellum-ii-voltage-guard-band-reduction/",
        "site": "semiengineering.com",
        "time": 1741849765000,
        "favicon_url": "https://static.tickertick.com/website_icons/semiengineering.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "An approach that improves energy efficiency and reduces power using three coupled control loops. The post IBM’s Tellum II Voltage Guard Band Reduction appeared first on Semiconductor Engineering. The 2025 International Solid State Circuits Conference was held in San Francisco from February 16th to 20th. IBM presented three papers[1,2,3] based on their Samsung 5nm Tellum II chip. These are interesting in terms of the technology and the specifics about the design and measures taken to improve energy efficiency and reduce power. My first remembrance of a company specializing in guard-band reduction was seeing Silicon Metrics at the Design Automation Conference (DAC) in the late 90’s. (Silicon Metrics was acquired by Magma which was itself acquired by Synopsys in the EDA industry’s common bigger fish eating smaller fish scenario.) One of the company’s founders, Farid Najm, has focused much of his career in this area and power savings. There’s an article, Two Constraints-Based Techniques To Address Power-Related Challenges In SoC Design, discussing more background about this topic. This article will mostly focus on the three coupled control loops approach IBM used to reduce voltage guard banding in the Tellum II and zNext System. It also provides a quick overview of the Tellum II and the decoupled (from core) voltage control for the SRAM. Figure 1 below shows an overview of the Tellum II, including a die photo and labeled blocks of the processor. There are 8 cores on the chip, 3 on the left and 5 on the right. The left side also includes a data processing unit (DPU). There are 10 36MB L2 caches in the middle of the chip (light blue). Fig. 1: Tellum II Chip Overview.[1] Figure 2 below shows core-specific information and is actually a conglomeration of information from two presentations.[1,2] It includes markup information clearly showing the 7 fully abutted blocks used in the core and the labels for each block. Rough locations for the placement of digital droop sensors (DDS), droop mitigation units (DMU) and the core recovery unit (CRU) are also shown. At ~9.52 mm2 per core, that works out to 76.16 mm2 total for the 8 cores and implies that only about 1/8 (12.7%) of the total chip area is used for the cores. Fig. 2: Tellum II Core. It’s clear that the L2 cache takes up a significant portion of the die area. The 36MB L2 cache has a 3.6ns (~20 clock cycles) access time and is designed with Samsung’s high-density SRAM bitcell. 360MB of virtual L3 cache is accessible in 11.5ns (~64 cycles) and 2.8 GB virtual L4 in 48.5ns[4] (~267 cycles). The increase in access time going from L2 to virtual L3 is over 3x and from virtual L3 to virtual L4 is over 4x. To deal with the memory wall, the on-board cache dwarves the chip area for the 8-cores. Fig. 3: 36MB L2 Cache with SRAM Voltage Regulators. A separate power supply is used to drive the SRAM cells and periphery logic. This allows the voltage to be changed on the cores to respond to workload scenarios without concerns about the voltage change creating SRAM issues. On-chip regulators generate the SRAM stand-alone supply and reduce system and integration complexity. The regulator is implemented as a dual-loop analog with a high precision slow loop to set the DC value. Distributed micro-regulators respond to fast switching transients and voltage noise is further suppressed via a predictive activation scheme. This enables the SRAM supply to be set to a level that optimizes yield, power, and performance. The placement of the regulators is shown above in figure 3. Focusing now on the core, one might wonder why a dynamic voltage scaling scheme wasn’t employed. Power-supply redundancy and security requirements made fast voltage changes impossible. For the IBM zNext, a sophisticated voltage control loop (VCL) was developed that achieves similar power savings to that of the previous POWER10 Processor[5], while keeping performance loss less than 0.5% despite voltage changes requiring milliseconds instead of microseconds. A control loop was also added to react to core recoveries. Figure 4 below shows a diagram with the three control loops, Timing Protection, Performance Protection and Guard Band Optimization, to implement the VCL for Tellum II. Each control loop is described below. Fig. 4: Diagram of Tellum II’s three coupled control loops. We look at the timing protection control loop first. Timing protection is implemented using droop mitigation only. A digital droop sensor (DDS) based around the same principles as we looked at in Staying Within the Margins was deployed with a latch tapped delay line with 24 possible values (this may be helpful when looking at figures 9 and 11 later for DDS values). Figure 5 below shows how VSET can be eliminated and an operating voltage dynamically found based on a VCRIT setting that causes instruction throttling (DMU) to kick in. The right part of the figure diagrammatically shows the impact on the voltage guard band. Fig. 5: The timing protection control loop. Figure 6 below shows the effectiveness of the timing protection loop. When the DMU throttling is enabled, there is a significant 50% reduction in voltage droop. Fig. 6: Comparison results with timing protection control loop disabled and enabled. Next, we look at the performance protection control loop. Its mission is to make sure that the performance impact stays at or below the 0.5% performance impact target. It does this by monitoring the impact of the time spent below VCRIT where throttling is active. If the core throttling becomes too detrimental to performance, the performance protection control loop will raise the voltage so that the performance impact remains at or below the 0.5% target. Figure 7 below diagrams this behavior. Fig. 7: Performance protection control loop. Previous work performed in Razor[6-9] enabled robust error recovery and used an adaptive voltage scaling scheme to raise voltages. While the voltage can be raised in the performance protection control loop to maintain performance, the adjustment made in the guard band optimization control loop is to raise VCRIT so that throttling kicks in sooner. If this were to lead to an unacceptable drop in performance, i.e. too much throttling, then the performance protection control loop, described above, would raise the voltage. Figure 8 shows a diagram of how VCRIT is raised after a recoverable error event. Fig. 8: Guard band optimization control loop. Figure 9 below shows the effectiveness of the guard band optimization control loop and how the system seeks a lower voltage level. If the voltage falls to a point where recoverable errors occur, then there’s a dynamic adaptation of the timing protection by raising the VCRIT. If this were to lead to an unacceptable degradation in performance, then the performance protection control loop would raise the voltage. All three control loops are coupled together to provide a stable voltage operating environment. Fig. 9: Guard band optimization control loop effectiveness. Figure 10 shows a composite diagram indicating the impact of each control loop on the effective voltage guard band. Fig. 10: Diagram of each control loops contribution to voltage guard band reduction. Figure 11 shows the overall gains in energy and power efficiency using the Tellum II coupled control loop implementation. Fig. 11: Workload power savings results. The three coupled control loops used in IBM Tellum II and zNext System protect against timing violations by using digital droop sensors (DDS) and droop mitigation units (DMU) that throttle the instruction rate. Simultaneously, performance is maintained by raising the voltage if needed to prevent too much instruction throttling. Furthermore, there’s additional guard band protection by detecting violations caused by sudden low voltages that lead to recoverable errors handled by the core recovery unit (CRU). This creates a dynamic environment where the system is continuously seeking to run at the lowest voltage possible, leading to better performance and cores that always run at 5.5GHz, voltage squared reductions in energy and power, all while simultaneously maintaining an 99.999999% (eight NINES) availability. All in all, it dynamically optimizes guard bands by simultaneously leveraging both robust droop mitigation and robust error recovery to deliver significant chip power savings of 18% and system level power savings of 10% while maintaining average throttling below 0.5%. References G. Strevig, et al., “IBM Telum II: Next Generation 5.5GHz Microprocessor with On-Die Data Processing Unit and Improved AI Accelerator,” Paper 2.2, 2025 ISSCC, February 17, 2025. T. Webel, et al., “Dynamic Guard-Band Features of the IBM zNext System,” Paper 8.1, 2025 ISSCC, February 18, 2025. D. Wolpert, et al., “IBM Telum II Processor Design-Technology Co-Optimizations for Power, Performance, Area, and Reliability,” Paper 37,1, 2025 ISSCC, February 19, 2025. C. Berry, “IBM Telum II Processor and IBM Spyre Accelerator Chip for AI,” Hot Chips, 2024. B.T. Vanderpool et al., “Deterministic Frequency Boost and Voltage Enhancements on the POWER10 Processor,” ISSCC, pp. 218-219, 2022. D. Ernst et al., “Razor: A Low-Power Pipeline Based on Circuit-Level Timing Speculation,” IEEE/ACM MICRO, pp. 7-18, 2003. S. Das et al., “A Self-Tuning DVS Processor Using Delay-Error Detection and Correction,” IEEE JSSC, vol. 41, no. 4, pp. 792-804, 2006. S. Das et al., “Razor II: In Situ Error Detection and Correction for PVT and SER Tolerance,” IEEE JSSC, vol. 44, no. 1, pp. 32-48, 2009. J.P. Kulkarni et al., “A 409GOPS/W Adaptive and Resilient Domino Register File in 22nm Tri-Gate CMOS Featuring In-Situ Timing Margin and Error Detection for Tolerance To Within-Die Variation, Voltage Droop, Temperature And Aging,” ISSCC, pp. 82-83, 2015. Bonus for readers who have read to the end At the plenary session of invited papers, Navid Shahriari of Intel gave a p",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-5885452269735437474",
        "title": "ElectroCore GAAP EPS of -$1.59 misses by $0.09, revenue of $25.18M in-line",
        "url": "https://seekingalpha.com/news/4420020-electrocore-gaap-eps-of-1_59-misses-by-0_09-revenue-of-25_18m-in-line",
        "site": "seekingalpha.com",
        "time": 1741810098000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "3902369053598419085",
        "title": "Apple, IBM seen as 'defensive names' in IT hardware amid downturn: BofA",
        "url": "https://seekingalpha.com/news/4419820-apple-ibm-seen-as-defensive-names-in-it-hardware-amid-downturn-bofa",
        "site": "seekingalpha.com",
        "time": 1741786450000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2937046063628658460",
        "title": "IBM CEO Defends Global Trade, Criticizes U.S. Policies, and Dismisses AI Takeover Fears",
        "url": "https://www.digitalinformationworld.com/2025/03/ibm-ceo-defends-global-trade-criticizes.html",
        "site": "digitalinformationworld.com",
        "time": 1741772520000,
        "favicon_url": "https://static.tickertick.com/website_icons/digitalinformationworld.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "The arrival of Donald Trump as America’s president saw a host of executive orders released. Recently, the US commander in chief unleashed a new trade war that has some predicting America’s economic downfall. However, IBM’s CEO disagrees with the Trump administration’s attack on other economies and feels global trade isn’t dead yet. In fact, he feels this might be the key to America’s growth and success as many embrace global exchange of products.He explained how strongly he feels every 10% rise in global trade provides a 1% rise in local GDP. This was mentioned during an onstage interview at the recently held SXSW yesterday. If anyone wants to make the most of their growth, they need to embrace international trade, he shared. Image: SXSW / YouTubeThat matter goes hand in hand with giving international talent the chance to flow into America. But with the current ban and restrictions for student and work visas, it’s actually doing the US more harm than good.IBM says they want foreign talent to come forward and show their skills while they work hard to better train local talent. But no country can progress and prosper if they don’t get access to the best from around the globe. So there needs to be international talent hubs and policies that go well with that.In that same interview, there was talk about geopolitics and then AI, which the CEO feels is so valuable. He disagrees with predictions made by Anthropic that AI will rule the world in the next few years and would even start writing most codes in a couple of months.Also read: AI Gives Startups an Edge, But Creativity Remains Essential, SXSW Panel HighlightsHe strongly felt that the figures would be 20 to 30% produced by AI but not 90%. Some are very complicated that go beyond the capabilities of AI. With that said, he was adamant that AI would assist programmers get more productive with their time. They boost outputs from employers instead of getting rid of programming jobs as some critics predict.Some felt Krishna’s statements are the opposite of those mentioned in 2023, where IBM planned to put a stop on hiring on all back-office functions, which the firm anticipated could be replaced with AI tech. Now, the main take-home message is that he knows AI is here to help and not replace programmers anytime soon.Read next: • Global Sales for Smartphones Sharply Decline for the First Time• AI Costs Drop as OpenAI Faces GPU Constraints, While Synthetic Data Eases Training Concerns",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-117200201930940053",
        "title": "Flint GAAP EPS of C$0.01, revenue of C$187.18M",
        "url": "https://seekingalpha.com/news/4419643-flint-gaap-eps-of-c001-revenue-of-c18718m",
        "site": "seekingalpha.com",
        "time": 1741731470000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8561844026150140865",
        "title": "Junction, an API to link health wearables with labs, raises $18M",
        "url": "https://techcrunch.com/2025/03/11/junction-an-api-to-link-health-wearables-with-labs-raises-18m/",
        "site": "techcrunch.com",
        "time": 1741698000000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Medical devices, wearables — we are all familiar with them. But are they linked in any way to the healthcare system and the databases that are supposed to keep us healthy? The answer in most cases is no, they are not. Vital, which is rebranding to “Junction”, provides a single API to integrate wearables and […] © 2024 TechCrunch. All rights reserved. For personal use only.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2937792386244344600",
        "title": "IBM’s CEO doesn’t think AI will replace programmers anytime soon",
        "url": "https://techcrunch.com/2025/03/11/ibms-ceo-doesnt-think-ai-will-replace-programmers-anytime-soon/",
        "site": "techcrunch.com",
        "time": 1741651200000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM CEO Arvind Krishna says that, despite the Trump Administration’s attacks on globalism, global trade isn’t dead. In fact, he thinks that the U.S.’s key to growth will be embracing an international exchange of goods. “So, I actually am a firm believer — I think it goes all the way back to the economists who […] © 2024 TechCrunch. All rights reserved. For personal use only.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "2473281939159354295",
        "title": "IBM wins court battle with LzLabs over mainframe trade secrets",
        "url": "https://www.datacenterdynamics.com/en/news/ibm-wins-court-battle-with-lzlabs-over-mainframe-trade-secrets/",
        "site": "datacenterdynamics.com",
        "time": 1741626275000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Big Blue's claim that its IP was stolen is upheld",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-7031860683326210863",
        "title": "IBM in focus as SCOTUS refuses to hear BMC appeal",
        "url": "https://seekingalpha.com/news/4419005-ibm-in-focus-as-scotus-refuses-to-hear-bmc-appeal",
        "site": "seekingalpha.com",
        "time": 1741626237000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5835076667088582496",
        "title": "SCOTUS refuses to hear BMC's appeal and revive a $1.6B award against IBM, which was accused by BMC of poaching a client in violation of a licensing agreement (Greg Stohr/Bloomberg)",
        "url": "http://www.techmeme.com/250310/p13#a250310p13",
        "site": "techmeme.com",
        "time": 1741617302000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "-7031860683326210863"
        ],
        "description": "Greg Stohr / Bloomberg: SCOTUS refuses to hear BMC's appeal and revive a $1.6B award against IBM, which was accused by BMC of poaching a client in violation of a licensing agreement — The US Supreme Court refused to revive a $1.6 billion award against International Business Machines Corp., which was accused …",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-5047710451142846209",
        "title": "IBM Spared $1.6 Billion Award as Supreme Court Rejects BMC",
        "url": "https://www.bloomberg.com/news/articles/2025-03-10/ibm-spared-1-6-billion-award-as-supreme-court-rejects-bmc",
        "site": "bloomberg.com",
        "time": 1741613720000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "The US Supreme Court refused to revive a $1.6 billion award against International Business Machines Corp., which was accused by KKR & Co.’s BMC Software of poaching a client in violation of a licensing agreement. IBM offices in Foster City, California.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4972277113413442200",
        "title": "Google, Microsoft, and others are racing to crack open quantum computing. Here's how their breakthroughs stack up.",
        "url": "https://www.businessinsider.com/quantum-computing-race-big-tech-microsoft-google-amazon-ibm-2025-2",
        "site": "businessinsider.com",
        "time": 1741517701000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Charles O'Rear/Getty, thawornnurak/Getty, valiantsin suprunovich/Getty, twomeows/Getty, aluxum/Getty, Tyler Le/BITech giants Amazon, Google, IBM, and Microsoft are racing to develop a functional quantum computer.Each has released a prototype quantum chip with different approaches and potential applications.The field is rapidly evolving, but major hurdles remain before it becomes commercially useful.The quantum race is heating up.Tech titans Amazon, Google, IBM, and Microsoft each recently announced advancements in their prototype chips, tightening the race to develop a commercially useful quantum computer that could solve some of the universe's stickiest problems faster than a classical computer ever could.Quantum computing is a rapidly evolving — though still largely theoretical and deeply technical — field. But cracking it open could help discover new drugs, develop new chemical compounds, or break encryption methods, among other outcomes, researchers say.Naturally, each of the major players in Big Tech wants to be the one to take quantum computing mainstream.\"You're hearing a lot about it because this is a real tipping point,\" Oskar Painter, the director of quantum hardware at Amazon Web Services, told Business Insider in late February, following the company's announcement of its Ocelot chip.Stick with us — here's where it gets complicated.Where classical computing uses binary digits — 0s and 1s, called bits — to represent information, quantum computing relies on a foundation built from the quantum equivalent of bits, called qubits. When they behave predictably at a large enough scale, qubits allow quantum computers to quickly calculate equations with multiple solutions and perform advanced computations that would be impossible for classical computers.However, qubits are unstable, and their behavior is unpredictable. They require specific conditions, such as low light and extremely cold environments, to reduce errors. When the number of qubits is increased, the error rate goes up — making advancement in the field slowgoing.Small-scale quantum computers already exist, but the race is on to scale them up and make them useful to a wider audience rather than just scientists.Recently, Amazon, Google, and Microsoft have announced new prototype chips, and IBM has made strides in its existing quantum road map. Each company is using unique approaches to solve the error reduction and scalability problems that have long plagued the field and make useful quantum computing a reality.Here's how each approach stacks up.MicrosoftMicrosoft's Majorana 1 chip is the first quantum computing chip powered by topological qubits.MicrosoftApproach to quantum: Topological qubitsMost powerful machine: Majorana 1In February, Microsoft unveiled its new quantum chip, Majorana 1. The aim is for the chip to speed up the development of large-scale quantum computers from decades to years.Microsoft said the chip uses a new state of matter to produce \"topological\" qubits that are less prone to errors and more stable. Essentially, this is a qubit based on a topological state of matter, which isn't a liquid, gas, or solid. As a result, these quantum particles could retain a \"memory\" of their position over time and move around each other. Information, therefore, could be stored across the whole qubit, so if any parts fail, the topological qubit could still hold key pieces of information and become more fault-resistant.\"Microsoft's progress is the hardest to get an idea about because it's very niche,\" said Tom Darras, founder of quantum computing startup Welinq. \"Even experts in the industry find it difficult to assess the quality of these results.\"Quantum experts agree that Microsoft still has many roadblocks to overcome, and its peer-reviewed Nature paper only demonstrates aspects of what its researchers have claimed to achieve — but some in the quantum ecosystem see it as a promising outcome.GoogleGoogle researchers are aiming to reverse a long-standing qubit problem.GoogleApproach to quantum: Superconducting qubitsMost powerful machine: WillowIn December, Google announced Willow, its newest quantum chip, which the company claims takes just five minutes to solve a problem that would take the world's fastest supercomputer 10 septillion years.Perhaps more impressive was Google's breakthrough in how quantum computers scale. Historically, the more qubits that are added, and the more powerful the computer becomes, the more prone it is to errors. With Willow, Google's researchers said that adding more physical qubits to a quantum processor actually made it less error-prone, reversing the typical phenomenon.Known as \"below threshold,\" the accomplishment marks a significant milestone by cracking a problem that has been around since the 1990s. In a study published in Nature, Google's researchers posit this breakthrough could finally offer a way to build a useful large-scale quantum computer. However, much of this is still theoretical, and now Google will need to prove it in practice.AmazonA superconducting-qubit quantum chip being wire-bonded to a circuit board at the AWS Center for Quantum Computing in Pasadena, Calif.Amazon Web ServicesApproach to quantum: Superconducting qubitsMost powerful machine: OcelotIn late February, Amazon Web Services announced its Ocelot chip, a prototype designed to advance the company's focus on cloud-based quantum computing.An Amazon spokesperson told Business Insider the Ocelot prototype demonstrated the potential to increase efficiency in quantum error correction by up to 90% compared to conventional approaches. The chip leverages a unique architecture that integrates cat qubit technology — named for the famous Schrödinger's cat thought experiment — and additional quantum error correction components that can be manufactured using processes borrowed from the electronics industry.Troy Nelson, a computer scientist and the chief technology officer at Lastwall, a cybersecurity provider of quantum resilient technology, told Business Insider that Amazon's Ocelot chip is another building block that the industry will use to build a functioning quantum computer. However, its error rate needs to be substantially lowered, and its chips would require more qubit density before they're useful.\"There's lots of challenges ahead. What Amazon gained in error correction was a trade-off for the complexity and the sophistication of the control systems and the readouts from the chip,\" Nelson said. \"We're still in prototype days, and we still have multiple years to go, but they've made a great leap forward.\"IBMCES patrons take a look as IBM unveils this quantum computer, Q System One.Ross D. Franklin/ASSOCIATED PRESSApproach to quantum: Superconducting qubitsMost powerful machine: CondorIBM has been a quantum frontrunner for some time, with several different prototype chips and its development of Q System One, the first circuit-based commercial quantum computer, unveiled in January 2019.IBM's Condor chip is the company's most powerful in terms of its number of qubits. However, since its development, IBM has focused its approach on the quality of its gate operations and making its newer quantum chips modular so multiple smaller, less error-prone chips can be combined to make more powerful quantum computing machines.Condor, the second-largest quantum processor ever made, was unveiled at the IBM Quantum Summit 2023 on December 4, 2023. At the same time, IBM debuted its Heron chip, a 133-qubit processor with a lower error rate.Rob Schoelkopf, cofounder and chief scientist of Quantum Circuits, told Business Insider that IBM has prioritized \"error mitigation\" over traditional error correction approaches. While IBM has so far been successful in what Schoelkopf calls \"brute force scaling\" with this approach, he said the methodology will need to be modified in the long run for efficiency.Who leads the race?Sankar Das Sarma, a theoretical condensed matter physicist at the University of Maryland, told Business Insider that the Amazon Web Services Ocelot chip, Google's Willow, and IBM's Condor use a \"more conventional\" superconducting approach to quantum development compared to other competitors.By contrast, Microsoft's approach is based on topological Majorana zero modes, which also have a superconductor, but in \"a radically different manner,\" he said. If the Majorana 1 chip works correctly, Das Sarma added, it is protected topologically with minimal need for error correction, compared to claims from other tech companies that they have improved conventional error correction methods.Still, each company's approach is \"very different,\" Das Sarma said. \"It is premature to comment on who is ahead since the whole subject is basically in the initial development phase.\"Big Tech companies should be cautious about \"raising expectations when promoting results,\" said Georges-Olivier Reymond, CEO of quantum computing startup Pasqal. \"Otherwise, you could create disillusionment.\"Reymond's sentiment was echoed by IBM's VP of quantum adoption and business development, Scott Crowder, who told Business Insider he is concerned \"over-hype\" could lead people to discount quantum technology before its promise can be realized.\"We think we are on the cusp of demonstrating quantum advantage,\" said Crowder, referring to when a quantum computer outperforms classical machines. \"But the industry is still a few years from a fully fault-tolerant quantum computer.\"Read the original article on Business Insider Charles O'Rear/Getty, thawornnurak/Getty, valiantsin suprunovich/Getty, twomeows/Getty, aluxum/Getty, Tyler Le/BITech giants Amazon, Google, IBM, and Microsoft are racing to develop a functional quantum computer.Each has released a prototype quantum chip with different approaches and potential applications.The field is rapidly evolving, but major hurdles remain before it becomes commercially useful.The quantum race is heating up.Tech titans Amazon, Google, IBM",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-5639366648705856594",
        "title": "RedHat teams up with Axiom Space on International Space Station data center project",
        "url": "https://www.datacenterdynamics.com/en/news/redhat-teams-up-with-axiom-space-on-international-space-station-data-center-project/",
        "site": "datacenterdynamics.com",
        "time": 1741431603000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Will see Red Hat Device Edge used in Orbital Data Center project",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3821168635176865550",
        "title": "Chiplet Placement Algorithm Based on Automatic Differentiation (MIT, IBM)",
        "url": "https://semiengineering.com/chiplet-placement-algorithm-based-on-automatic-differentiation-mit-ibm/",
        "site": "semiengineering.com",
        "time": 1741397514000,
        "favicon_url": "https://static.tickertick.com/website_icons/semiengineering.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "A new technical paper titled “DiffChip: Thermally Aware Chip Placement with Automatic Differentiation” was published by researchers at MIT and IBM. Abstract “Chiplets are modular integrated circuits that can be combined to form a larger system, offering flexibility and performance enhancements. However, their dense packing often leads to significant thermal management challenges, requiring careful floorplanning... » read more The post Chiplet Placement Algorithm Based on Automatic Differentiation (MIT, IBM) appeared first on Semiconductor Engineering. A new technical paper titled “DiffChip: Thermally Aware Chip Placement with Automatic Differentiation” was published by researchers at MIT and IBM. Abstract “Chiplets are modular integrated circuits that can be combined to form a larger system, offering flexibility and performance enhancements. However, their dense packing often leads to significant thermal management challenges, requiring careful floorplanning to ensure efficient heat distribution. To address thermal considerations, layout optimization algorithms concurrently minimize the total wirelength and the maximum temperature. However, these efforts employ gradient-free approaches, such as simulated annealing, which suffer from poor scaling and slow convergence. In this paper, we propose DiffChip, a chiplet placement algorithm based on automatic differentiation (AD). The proposed framework relies on a differentiable thermal solver that computes the sensitivity of the temperature map with respect to the positions of the chiplets. Regularization strategies for peak temperature, heat sources, and material properties enable end-to-end differentiability, allowing for gradient-based optimization. We apply DiffChip to optimize a layout where the total wirelength is minimized while keeping the maximum temperature below a desired threshold. By leveraging AD and physics-aware optimization, our approach accelerates the design process of microelectronic systems, exceeding traditional trial-and-error and gradient-free methods.” Find the technical paper here. February 2025. Romano, Giuseppe, Aakrati Jain, Nima Dehmamy, Cheng Chi, and Xin Zhang. “DiffChip: Thermally Aware Chip Placement with Automatic Differentiation.” arXiv preprint arXiv:2502.16633 (2025). The post Chiplet Placement Algorithm Based on Automatic Differentiation (MIT, IBM) appeared first on Semiconductor Engineering.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "1239211148814760965",
        "title": "Former ISS Executive Cristiano Guerra Gives a Proxy Prognosis",
        "url": "https://www.bloomberg.com/news/newsletters/2025-03-06/former-iss-executive-cristiano-guerra-gives-a-proxy-prognosis",
        "site": "bloomberg.com",
        "time": 1741283516000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Hi, it’s Crystal Tse in New York, where I recently discussed the worlds of activism and proxy advisers with former ISS executive Cristiano Guerra. Also today, London’s IPO bankers advise patience during a listings drought.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-8589606925359345209",
        "title": "Curtiss-Wright receives $18M follow-on order from U.S. Marine Corps",
        "url": "https://seekingalpha.com/news/4417998-curtiss-wright-receives-18m-follow-on-order-from-us-marine-corps",
        "site": "seekingalpha.com",
        "time": 1741266875000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-2821348089734694073",
        "title": "Trump Sets Meeting With Tech CEOs As Tariff Pressures Set In",
        "url": "https://www.pymnts.com/politics/2025/trump-sets-meeting-with-tech-ceos-as-tariff-pressures-set-in/",
        "site": "pymnts.com",
        "time": 1741262311000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "President Trump will reportedly meet with top U.S. tech companies facing tariff-related pressure. The CEOs of IBM, Intel, Qualcomm and HP will gather at the White House on Monday (March 10), Bloomberg News reported Thursday (March 6), citing sources familiar with the matter and a spokesperson for HP. “Some of the topics top-of-mind for our […] The post Trump Sets Meeting With Tech CEOs As Tariff Pressures Set In appeared first on PYMNTS.com. President Trump will reportedly meet with top U.S. tech companies facing tariff-related pressure. The CEOs of IBM, Intel, Qualcomm and HP will gather at the White House on Monday (March 10), Bloomberg News reported Thursday (March 6), citing sources familiar with the matter and a spokesperson for HP. “Some of the topics top-of-mind for our leadership team are trade policy and U.S. manufacturing,” that spokesperson said. As Bloomberg notes, the Trump administration is pushing several policy changes that could threaten computer hardware makers. For example, new tariffs on manufacturing centers like China could drive up costs and hinder supply chains. In addition, the report added, tech companies are also seeking clarity about possible restrictions on their exports of technology for artificial intelligence (AI) data centers, which are being constructed around the globe. The meeting is happening as businesses from a range of sectors are feeling pressure from the tariffs, imposed on Canada, Mexico and China and covering a range of goods. For example, a report Wednesday (March 5) by the Wall Street Journal found that toy companies are bracing themselves for the impact of the tariffs. These companies are concerned about where they will source their products, how they will stay on top of growing costs and how consumers will react to higher prices. While some larger toymakers are renegotiating with vendors and shifting production to other countries, smaller companies have fewer options and could be forced to absorb the added costs if they cannot pass them along to buyers in the form of higher prices. Meanwhile, Best Buy said earlier this week that tariffs on China could have a negative effect of about one point of comparable sales if they stayed in place for a full year. “While Best Buy only directly imports 2% to 3% of our overall assortment, we expect our vendors across our entire assortment will pass along some level of tariff costs to retailers, making price increases for American consumers highly likely,” CEO Corie Barry said during the company’s earnings call. Research by PYMNTS Intelligence shows that at least 60% of CFOs see their companies facing greater uncertainty and challenges due to the tariffs. “Reconfiguring supply chains is no panacea, as it costs time and money,” PYMNTS wrote recently. “Moreover, domestic supply chains would become more competitive, as near-shoring or onshoring materials would mean greater competition for suppliers on higher demand and, thus, supply crunches.” The post Trump Sets Meeting With Tech CEOs As Tariff Pressures Set In appeared first on PYMNTS.com.",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4901566753949845942",
        "title": "Sources: President Trump is set to meet the CEOs of HP, Intel, IBM, and Qualcomm on March 10, as new US tariffs threaten to roil the PC hardware industry (Bloomberg)",
        "url": "http://www.techmeme.com/250306/p12#a250306p12",
        "site": "techmeme.com",
        "time": 1741260603000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Bloomberg: Sources: President Trump is set to meet the CEOs of HP, Intel, IBM, and Qualcomm on March 10, as new US tariffs threaten to roil the PC hardware industry — President Donald Trump is poised to meet next week with leaders of some of the country's largest tech companies …",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "652650159837416808",
        "title": "Tel Aviv-based Grain, which helps businesses find the best FX hedges using FX derivatives and AI, emerges from stealth with a $33M Series A and an $18M seed (Ingrid Lunden/TechCrunch)",
        "url": "http://www.techmeme.com/250305/p50#a250305p50",
        "site": "techmeme.com",
        "time": 1741231201000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Ingrid Lunden / TechCrunch: Tel Aviv-based Grain, which helps businesses find the best FX hedges using FX derivatives and AI, emerges from stealth with a $33M Series A and an $18M seed — Foreign exchange fluctuations can make or break a business that trades across borders, but keeping up and responding to the FX market …",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-1437442314417718205",
        "title": "Tecsys GAAP EPS of C$0.08, revenue of C$45.18M",
        "url": "https://seekingalpha.com/news/4417811-tecsys-gaap-eps-of-c008-revenue-of-c4518m",
        "site": "seekingalpha.com",
        "time": 1741214745000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-3920374332269362377",
        "title": "Riley Exploration Permian Non-GAAP EPS of $0.96 misses by $0.56, revenue of $102.69M misses by $1.18M",
        "url": "https://seekingalpha.com/news/4417763-riley-exploration-permian-non-gaap-eps-of-0_96-misses-by-0_56-revenue-of-102_69m-misses-by",
        "site": "seekingalpha.com",
        "time": 1741210407000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4238616309988324698",
        "title": "Lotus Technology plans $1.4B mixed shelf offering",
        "url": "https://seekingalpha.com/news/4417193-lotus-technology-plans-14b-mixed-shelf-offering",
        "site": "seekingalpha.com",
        "time": 1741124136000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "5944548288291776187",
        "title": "IBM's Cohn on The Next Phase of AI",
        "url": "https://www.bloomberg.com/news/videos/2025-03-04/ibm-s-cohn-on-the-next-phase-of-ai-video",
        "site": "bloomberg.com",
        "time": 1741117903000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "Gary D. Cohn, Vice Chairman, IBM discusses how the next phase of AI could impact the economy and business with Bloomberg's Matthew Miller at Bloomberg Invest. (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "4624862973914999534",
        "title": "IBM's Cohn Says Bigger Companies Will Be Winners in AI",
        "url": "https://www.bloomberg.com/news/videos/2025-03-04/cohn-says-bigger-companies-will-be-winners-in-ai-video",
        "site": "bloomberg.com",
        "time": 1741117897000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "ibm"
        ],
        "description": "IBM Vice Chairman Gary Cohn says bigger companies will be the winners when it comes to investing in artificial intelligence. He speaks at Bloomberg Invest in New York. (Source: Bloomberg)",
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "-4472028962796908300",
        "title": "L.B. Foster GAAP EPS of -$0.02, revenue of $128.18M",
        "url": "https://seekingalpha.com/news/4416848-l-b-foster-gaap-eps-of-0_02-revenue-of-128_18m",
        "site": "seekingalpha.com",
        "time": 1741093667000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "tickers": [
            "ibm"
        ]
    },
    {
        "id": "7206715069499385653",
        "title": "Curaleaf GAAP EPS of -$0.10 misses by $0.03, revenue of $331.05M misses by $1.18M",
        "url": "https://seekingalpha.com/news/4416520-curaleaf-gaap-eps-of-0_10-misses-by-0_03-revenue-of-331_05m-misses-by-1_18m",
        "site": "seekingalpha.com",
        "time": 1741035843000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "ibm"
        ],
        "similar_stories": [
            "1507040294708262434",
            "-5885452269735437474",
            "-117200201930940053",
            "-1437442314417718205",
            "-3920374332269362377",
            "-4472028962796908300"
        ],
        "tickers": [
            "ibm"
        ]
    }
]