[
    {
        "id": "7137181096860786570",
        "title": "Visa and eTip Team to Help Hospitality Workers Get Tipped Faster",
        "url": "https://www.pymnts.com/real-time-payments/2025/visa-and-etip-team-to-help-hospitality-workers-get-tipped-faster/",
        "site": "pymnts.com",
        "time": 1750102542000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa has teamed with eTip, a digital tipping platform for the hospitality and service industries. [contact-form-7] The collaboration is designed to help deliver funds directly to participating digital wallets in real time, the companies said in a Monday (June 16) news release. This will let service industry professionals quickly send funds to apps such as […] The post Visa and eTip Team to Help Hospitality Workers Get Tipped Faster appeared first on PYMNTS.com. Visa has teamed with eTip, a digital tipping platform for the hospitality and service industries. [contact-form-7] The collaboration is designed to help deliver funds directly to participating digital wallets in real time, the companies said in a Monday (June 16) news release. This will let service industry professionals quickly send funds to apps such as Venmo and PayPal without having to wait multiple business days to get their earnings, the release added. “At eTip, we believe service workers are the backbone of the economy, and they deserve a fast, transparent, and accessible way to manage their earnings,” said Nicolas Cassis, co-founder and CEO of eTip. “With cash transactions declining, it’s critical that tipping evolves to meet the needs of today’s workforce. “Our integration with Visa Direct makes it easier than ever for workers to access their hard-earned money quickly, empowering them with financial stability and control. By removing barriers to financial security, we are helping to ensure that tipping truly serves the people who rely on it most.” The release said eTip’s platform is used by some of the world’s most well-known companies in hospitality and other sectors, with businesses using eTip reporting an average 95% increase in tip frequency, with workers receiving tips five times more often than before. In integrating with alias-based payments via Visa Direct, eTip is ensuring workers can benefit from their added earnings as fast as possible, the companies said. The partnership comes amid a changing tipping landscape in the U.S. As PYMNTS wrote last month, recent legislation passed in Congress eliminates federal taxes on tips, which will likely serve as “further tailwind” for tips to be paid digitally and not in cash. “For restaurants, hotels and a host of other businesses, the daily divvying up of cash tips, parceled out to shift (and other) workers has become a mainstay of take-home pay,” that report said. “The onus has been on workers and employers to report those cash tips on tax filings, since tip-related income is treated as, well, income.” Current policy, per the IRS, requires employees to keep a daily tip record; report tips to the employer, unless the total is less than $20 each month per employer; and list all tips on an individual income tax return. Under the new legislation income derived from tips paid out in hard currency or using credit and debit cards would be exempt from federal income taxes. The income would be subtracted from “above the line” gross income, which in turn reduces taxable income. The post Visa and eTip Team to Help Hospitality Workers Get Tipped Faster appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5103228521605484026",
        "title": "Visa, Mastercard Tumble as Merchants Eye Stablecoins",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/visa-mastercard-tumble-as-merchants-eye-stablecoins",
        "site": "bloomberg.com",
        "time": 1749845360000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa Inc. and Mastercard Inc. fell, with Visa slipping as much as 7.1% and Mastercard dropping as much as 6.2%. Both declines were the biggest for the shares of companies since April. Meanwhile, Amazon.com Inc. and Walmart Inc. are among large multinational companies which have recently discussed issuing their own stablecoins in the US, the Wall Street Journal reported, citing unidentified people. Bloomberg's Michael Regan has more on the story. (Source: Bloomberg)",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-9031338486653252570",
        "title": "Visa, Mastercard Tumble as Merchants Eye Stablecoins | Bloomberg Markets 6/13/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/bloomberg-markets-6-13-2025-video",
        "site": "bloomberg.com",
        "time": 1749845352000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. Today's guests; Middle East Institute Vice President For Policy Kenneth Pollack, Bloomberg's Mishal Husain, and David Welch. (Source: Bloomberg)",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5547004919370367094",
        "title": "A $60 Billion Visa, Mastercard Slump Seen as Buying Opportunity",
        "url": "https://www.bloomberg.com/news/articles/2025-06-13/a-60-billion-visa-mastercard-slump-seen-as-buying-opportunity",
        "site": "bloomberg.com",
        "time": 1749840534000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "A report that large multinational merchants are exploring ways to bypass traditional credit-card fees presents investors with an opportunity to buy shares of Mastercard Inc. and Visa Inc., according to Wall Street analysts.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-2334480904329112775",
        "title": "Visa and Mastercard shares slide on stablecoin fears — but is the selloff too harsh?",
        "url": "https://www.marketwatch.com/story/visa-and-mastercard-shares-slide-on-stablecoin-fears-but-is-the-selloff-too-harsh-1735979a?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1749832740000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "v"
        ],
        "description": "Walmart and other retailers reportedly are exploring stablecoin ventures, but some analysts are doubtful these will take off with shoppers.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5906145075499483152",
        "title": "Walmart and Amazon Explore Stablecoins. Visa Stock Falls but Analysts Don’t See Immediate Threat.",
        "url": "https://www.barrons.com/articles/visa-stock-stablecoins-walmart-amazon-c57ead74?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749829560000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-2014171691806465673",
        "title": "Marriott Turns App and Hotel TVs Into Revenue Stream With New Ad Network",
        "url": "https://skift.com/2025/06/13/marriott-turns-app-and-hotel-tvs-into-revenue-stream-with-new-ad-network/",
        "site": "skift.com",
        "time": 1749829485000,
        "favicon_url": "https://static.tickertick.com/website_icons/skift.com.ico",
        "tags": [
            "v"
        ],
        "description": "Brands like Visa and Gatorade have begun advertising across Marriott's many screens. Its booking app? Ads. Your hotel room TV? Ads. The Wi-Fi login page? More ads. Skift Take: Brands like Visa and Gatorade have begun advertising across Marriott's many screens. Its booking app? Ads. Your hotel room TV? Ads. The Wi-Fi login page? More ads. Read the Complete Story On Skift",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "9188200612863800081",
        "title": "Stock Movers: Lockheed Martin, Oracle, Visa (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-13/stock-movers-lockheed-martin-oracle-visa-podcast",
        "site": "bloomberg.com",
        "time": 1749828981000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "Source: Bloomberg, 3:23 Oracle Corp Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "6946464783854818704",
        "title": "Visa, Mastercard stocks slide after stablecoin report",
        "url": "https://seekingalpha.com/news/4458073-visa-mastercard-stocks-slide-after-stablecoin-report",
        "site": "seekingalpha.com",
        "time": 1749828583000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "6322554600882400110",
        "title": "GENIUS Act, Texas v. BlackRock, DOJ v. Visa: Votes and Verdicts",
        "url": "https://www.bloomberg.com/news/audio/2025-06-13/genius-act-texas-v-blackrock-doj-v-visa-votes-and-verdicts",
        "site": "bloomberg.com",
        "time": 1749816000000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "An update on the GENIUS Act stablecoin bill making its way through Congress — which is important to companies like Coinbase, Robinhood and Circle — was among the key catalysts Bloomberg Intelligence litigation and policy analysts are watching this week. The team also discussed potential bills to increase credit-card competition and cap credit-card fees, which could affect Visa, Mastercard, American Express and Discover. We also discussed pending motions to dismiss in a pair of antitrust cases - BlackRock Inc Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "6662021213896320786",
        "title": "Visa: stablecoin transaction volumes hit $752B in May, up from $409B in May 2024, and wallets that regularly send and receive payments hit a record 46M average (Financial Times)",
        "url": "http://www.techmeme.com/250612/p16#a250612p16",
        "site": "techmeme.com",
        "time": 1749725400000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "v"
        ],
        "description": "Financial Times: Visa: stablecoin transaction volumes hit $752B in May, up from $409B in May 2024, and wallets that regularly send and receive payments hit a record 46M average — Usage of the digital assets is growing rapidly, but concerns remain about supervision and their impact on other parts of the financial system",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "3495711391649970169",
        "title": "Worldpay and Visa Team to Help Merchants Combat Fraud",
        "url": "https://www.pymnts.com/fraud-prevention/2025/worldpay-and-visa-team-to-help-merchants-combat-fraud/",
        "site": "pymnts.com",
        "time": 1749654893000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Worldpay is expanding its partnership with Visa to enhance that company’s 3D Secure solution. [contact-form-7] This tool, Worldpay said in a Wednesday (June 11) news release, helps merchants reduce fraud while easing consumer friction and boosting authorizations. “Fraud mitigation isn’t just an on or off switch; rather, it’s a balance that requires merchants to understand how security, authentication, authorization, […] The post Worldpay and Visa Team to Help Merchants Combat Fraud appeared first on PYMNTS.com. Worldpay is expanding its partnership with Visa to enhance that company’s 3D Secure solution. [contact-form-7] This tool, Worldpay said in a Wednesday (June 11) news release, helps merchants reduce fraud while easing consumer friction and boosting authorizations. “Fraud mitigation isn’t just an on or off switch; rather, it’s a balance that requires merchants to understand how security, authentication, authorization, fraud detection and the impact on the shopping experience work in harmony with one another,” Cindy Turner, chief product officer at Worldpay, said in the release. “For example, false positive declines of good faith purchases and additional steps in the checkout process present serious challenges to fraud mitigation strategies,” Turner added. “This is why we partner with card networks like Visa to enhance authorizations — at the end of the day, it helps merchants achieve the highest standards of security while improving the overall customer experience.” The company notes that more than half of U.S. shoppers will abandon a transaction if it takes multiple tries to go through, underscoring the importance of making sure that a valid payment goes through on the first try. Meanwhile, research by PYMNTS Intelligence from last year found that 56% of U.S. consumers had experienced a false payment decline in the three months prior to being surveyed. “Payment declines can severely impact customer satisfaction and business revenue. Some 40% of global consumers reported experiencing a false payment decline recently, with 79% indicating that varied payment options are crucial for building trust with brands,” PYMNTS wrote. “To mitigate these issues, open payments platforms offer enhanced authorization rates by improving back-end connections and streamlining transaction processes.” More recently, PYMNTS teamed with Worldpay to examine the importance of factors like convenience and payment choice in driving customer satisfaction and acquisition. A little more than half of all shoppers place convenience first when choosing payments, according to the PYMNTS Intelligence/Worldpay report “Big Three: How Choice, Confidence and Convenience Drive Payments Optimization.” “The collective expectation of shoppers for these three elements — choice in payment methods, speed and convenience of transactions and refunds, and secure environments — is influential in their decisions on where to spend their money. Excelling in just one area is no longer sufficient,” PYMNTS wrote earlier this week. “Modern consumers worldwide prioritize methods familiar to them. Ensuring customers have their preferred payment options available is a primary driver of customer loyalty.” The post Worldpay and Visa Team to Help Merchants Combat Fraud appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5064446215225433143",
        "title": "Visa: Issuer Customer Lifetime Value Hinges on Personalization and Real-Time Experiences",
        "url": "https://www.pymnts.com/visa/2025/visa-issuer-customer-lifetime-value-hinges-personalization-real-time-experiences/",
        "site": "pymnts.com",
        "time": 1749628809000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "It would be understandable to ascribe certain characteristics to the best-in-class issuers. [contact-form-7] The PYMNTS Intelligence and Visa DPS report “The Best-In-Class Modern Card Issuer: Driving Customer Lifetime Value Through Innovation” surveyed 451 executives who weighed in on what separates the best from the rest in the pursuit of high lifetime values of their customers. […] The post Visa: Issuer Customer Lifetime Value Hinges on Personalization and Real-Time Experiences appeared first on PYMNTS.com. It would be understandable to ascribe certain characteristics to the best-in-class issuers. [contact-form-7] The PYMNTS Intelligence and Visa DPS report “The Best-In-Class Modern Card Issuer: Driving Customer Lifetime Value Through Innovation” surveyed 451 executives who weighed in on what separates the best from the rest in the pursuit of high lifetime values of their customers. The usual suspects would be size and digital prowess. However, as PYMNTS CEO Karen Webster mused, “What we found was that it’s a mindset — a willingness to explore and invest.” Any issuer who chooses to think differently about their customer base will need to find new ways to strengthen their relationships with cardholders. As Webster noted to “We all have multiple cards — and so we all see different experiences that force a top-of-wallet decision,” Webster told Neil Mumm, senior vice president and head of Visa DPS. The drive to create new experiences and invest in the infrastructure and go-to-market strategies is a tough balancing act, Mumm said. “So much of it all comes down to constrained resources, and everyone has to allocate their resources in the appropriate ways … you can’t chase every shiny object,” Mumm said. “You have to prioritize.” The Here and Now Some efforts need to be in the here and now, regardless of the issuer, and regardless of the size of the issuer, Mumm said. “You need to place your bets somewhere — and place them in personalization, in real-time experiences and in improving fraud performance,” he said. But beyond those non-negotiables, “an understanding of your customers and the data that they are delivering to you through the interactions that they have … [gives you] an opportunity to deliver something that they’re going to feel is not a ‘sell’ to them,” he said. Data helps make those real-time interactions personalized. Monetization of the relationships may not occur at the outset of a relationship but will come over time, Mumm said. Visa DPS, which works with issuers across the spectrum, has seen success come from relatively smaller players such as community banks and FinTechs. Success comes from using data to target outreach and make the customer want to deepen the relationship — offering a new card or credit limit increase at the most opportune moments. Artificial intelligence has been instrumental in supercharging the collection and analysis of data to deliver results that might have seemed impossible just a year or so ago, he said. “[Visa has] invested pretty heavily in AI and our data analytics platform right now, and we are pretty excited about some of the things we’re going to be able to roll out there in the months and year ahead,” Mumm said. In addition, API connectivity helps issuers plug into other providers to speed innovations to market, he said. Some of Visa’s most recent innovations fall into the invest-for-today and invest-for-tomorrow camps. Mumm said the introduction of the Flexible Credential can and should be used by issuers to improve the lifetime value of customer relationships. Consumers value the ability to shift their spending across debit, credit, and buy now, pay later (BNPL) as the situation warrants, while keeping all of those transactions within the issuer/banks’ brand and ecosystem. “Flex Credential’s been born out of customer feedback,” he said, adding that the credential simplifies the ways in which a customer interacts with different types of payments. The Easy Button Looking ahead, Webster contended that just about everybody wants an “easy button,” where integration is a streamlined technical lift. “You want to have partners you can work with who can kind of bring many of those pieces together for you … with the idea of building a best-in-class offering,” Mumm said. “And when I think about Visa, and DPS more specifically, that’s exactly what we are striving to do.” Featurespace is now a part of Visa, ServiceNow partners with the payments network, and through those linkups, Visa can “plug” issuers into better dispute management flows and battle fraudsters, he said. “These are the tools that can allow you to start having more frequent interactions with your customers,” Mumm said of the best-in-class issuers, and “surprise and delight them … Architecting and re-architecting your product suite takes time, but doing these things along the way ensures you are top of wallet with your customers.” The post Visa: Issuer Customer Lifetime Value Hinges on Personalization and Real-Time Experiences appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6334547035967363110",
        "title": "Tech companies have a new hiring requirement: vibe coding",
        "url": "https://www.businessinsider.com/vibe-coding-tech-firms-hire-engineers-2025-6",
        "site": "businessinsider.com",
        "time": 1749546001000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "v"
        ],
        "description": "Software engineers are increasingly turning to AI tools.MTStock Studio/Getty ImagesVibe coding has taken over Silicon Valley — and it's cropping up in tech job ads.Visa, Reddit, and others want to hire people familiar with vibe coding to boost product development.AI coding tools can increase productivity, though they won't replace senior engineers anytime soon.Looking for a tech job? Being good at vibe coding could help.Vibe coding is the art of using AI to generate code. It's the latest trend taking over Silicon Valley, and CTOs are taking notice.Business Insider found job listings from Visa, Reddit, DoorDash, and a host of others that explicitly require vibe coding experience or familiarity with AI code generators like Cursor and Bolt.One startup even called vibe coding a \"non-negotiable\" skill and required anyone hired to the position to generate at least half of their current code with AI.The listings make clear that companies want to hire these vibe coders to boost the speed at which they build their products, or what's known as \"velocity\" in the tech industry.Big Tech is getting in on the action too, with Google CEO Sundar Pichai saying he's had a \"delightful\" time vibe coding up a webpage and Amazon in talks to deploy Cursor. (Business Insider couldn't find any \"Magnificent Seven\" firms asking for vibe coding experience in their job ads, though.)While vibe coding gains traction, it's not close to replacing senior engineers just yet. Engineers tell BI that the practice remains mostly useful for spending less time on basic tasks.Vibe coding is now \"essential\"Visa posted three generative AI engineer positions last month for its Austin office that lists familiarity with vibe coding tools as \"essential.\"Reddit, meanwhile, seeks an engineer who can build and maintain integrations with AI coding tools including Cursor and Bolt. Reddit wants this engineer to engage directly with the broader vibe-coding community to gather feedback and \"drive adoption.\"DoorDash seeks an engineer familiar with those tools, too, while cybersecurity unicorn Snyk wants to hire someone with \"deep expertise\" in vibe coding.The most extreme embrace of vibe coding may come from Y Combinator startup Domu Technology, which called \"vibe coding experience\" a \"non-negotiable.\" The listing said that at least half of this person's code should already be written by AI.It's all about speedThere's a common thread across these listings: speed. Most mention that the company seeks people with vibe coding knowledge so its engineering teams can ship products out faster.That's why vibe coding is kicking off in the first place: to turbocharge engineering teams.For example, streaming service Tubi wants an engineer to integrate AI-powered coding tools into the daily workflow to \"boost velocity.\" And Udacity wants to \"accelerate\" product development by hiring someone familiar with Cursor and Anthropic's AI assistant, Claude Code.The Visa positions that mention vibe coding also specify that it's for the \"rapid\" generation of code and prototypes at the company.Alex Balazs, CTO of Intuit, told BI he's approved six to seven different AI coding tools at Intuit including Cursor, Windsurf, and Microsoft Copilot — and he has no regrets.\"Right now, we're seeing that a great engineer using one of these tools can be up to 40% faster in terms of coding,\" Balazs said.Balazs added that while Intuit doesn't specifically seek out vibe coders in its hiring, it does appreciate people who \"love leveraging AI\" to solve problems.AI isn't taking over just yetThat's not to say someone with no coding experience armed with a $20-a-month Cursor subscription can waltz into a senior software engineer job.Vibe coding is relevant for companies largely because it helps existing engineers spend less time on \"boilerplate code\" and focus on higher-end problems instead, Balazs said.Even the most advanced vibe coding tools aren't so useful for tasks like shipping production-ready code or diving deep into a company's core systems, said Mohammad Sanatkar, a former senior machine learning engineer at Waymo who now runs an AI agents startup called SelfMachines in San Francisco.He said these tools tend to work better for simpler tasks, like building a website's front page.\"A few weeks ago, I used Cursor for a landing page, and it was pretty good at it,\" he said. \"But I don't think they are skilled enough to do core software improvements.\"Read the original article on Business Insider Software engineers are increasingly turning to AI tools.MTStock Studio/Getty ImagesVibe coding has taken over Silicon Valley — and it's cropping up in tech job ads.Visa, Reddit, and others want to hire people familiar with vibe coding to boost product development.AI coding tools can increase productivity, though they won't replace senior engineers anytime soon.Looking for a tech job? Being good at vibe coding could help.Vibe coding is the art of using AI to generate code. It's the latest trend taking over Silicon Valley, and CTOs are taking notice.Business Insider found job listings from Visa, Reddit, DoorDash, and a host of others that explicitly require vibe coding experience or familiarity with AI code generators like Cursor and Bolt.One startup even called vibe coding a \"non-negotiable\" skill and required anyone hired to the position to generate at least half of their current code with AI.The listings make clear that companies want to hire these vibe coders to boost the speed at which they build their products, or what's known as \"velocity\" in the tech industry.Big Tech is getting in on the action too, with Google CEO Sundar Pichai saying he's had a \"delightful\" time vibe coding up a webpage and Amazon in talks to deploy Cursor. (Business Insider couldn't find any \"Magnificent Seven\" firms asking for vibe coding experience in their job ads, though.)While vibe coding gains traction, it's not close to replacing senior engineers just yet. Engineers tell BI that the practice remains mostly useful for spending less time on basic tasks.Vibe coding is now \"essential\"Visa posted three generative AI engineer positions last month for its Austin office that lists familiarity with vibe coding tools as \"essential.\"Reddit, meanwhile, seeks an engineer who can build and maintain integrations with AI coding tools including Cursor and Bolt. Reddit wants this engineer to engage directly with the broader vibe-coding community to gather feedback and \"drive adoption.\"DoorDash seeks an engineer familiar with those tools, too, while cybersecurity unicorn Snyk wants to hire someone with \"deep expertise\" in vibe coding.The most extreme embrace of vibe coding may come from Y Combinator startup Domu Technology, which called \"vibe coding experience\" a \"non-negotiable.\" The listing said that at least half of this person's code should already be written by AI.It's all about speedThere's a common thread across these listings: speed. Most mention that the company seeks people with vibe coding knowledge so its engineering teams can ship products out faster.That's why vibe coding is kicking off in the first place: to turbocharge engineering teams.For example, streaming service Tubi wants an engineer to integrate AI-powered coding tools into the daily workflow to \"boost velocity.\" And Udacity wants to \"accelerate\" product development by hiring someone familiar with Cursor and Anthropic's AI assistant, Claude Code.The Visa positions that mention vibe coding also specify that it's for the \"rapid\" generation of code and prototypes at the company.Alex Balazs, CTO of Intuit, told BI he's approved six to seven different AI coding tools at Intuit including Cursor, Windsurf, and Microsoft Copilot — and he has no regrets.\"Right now, we're seeing that a great engineer using one of these tools can be up to 40% faster in terms of coding,\" Balazs said.Balazs added that while Intuit doesn't specifically seek out vibe coders in its hiring, it does appreciate people who \"love leveraging AI\" to solve problems.AI isn't taking over just yetThat's not to say someone with no coding experience armed with a $20-a-month Cursor subscription can waltz into a senior software engineer job.Vibe coding is relevant for companies largely because it helps existing engineers spend less time on \"boilerplate code\" and focus on higher-end problems instead, Balazs said.Even the most advanced vibe coding tools aren't so useful for tasks like shipping production-ready code or diving deep into a company's core systems, said Mohammad Sanatkar, a former senior machine learning engineer at Waymo who now runs an AI agents startup called SelfMachines in San Francisco.He said these tools tend to work better for simpler tasks, like building a website's front page.\"A few weeks ago, I used Cursor for a landing page, and it was pretty good at it,\" he said. \"But I don't think they are skilled enough to do core software improvements.\"Read the original article on Business Insider",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "31422016400785277",
        "title": "Notable analyst calls this week: Boeing, Apple and Visa among top picks | $AAPL $CEG $BA $NVDA $WBD",
        "url": "https://seekingalpha.com/news/4456286-notable-analyst-calls-this-week-boeing-apple-and-visa-among-top-picks",
        "site": "seekingalpha.com",
        "time": 1749303005000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5102978420018179286",
        "title": "QIB and Visa Partner to Expand B2B Cross-Border Payments",
        "url": "https://www.pymnts.com/news/cross-border-commerce/cross-border-payments/2025/qib-and-visa-partner-to-expand-b2b-cross-border-payments/",
        "site": "pymnts.com",
        "time": 1749160837000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Qatar Islamic Bank (QIB) has partnered with Visa to enhance cross-border business-to-business (B2B) payments through Visa B2B Connect. The platform supports direct, account-to-account international transfers and will allow QIB’s corporate clients to send payments to 120 countries. [contact-form-7] QIB is the first Islamic bank in Qatar to adopt Visa B2B Connect, positioning the partnership as […] The post QIB and Visa Partner to Expand B2B Cross-Border Payments appeared first on PYMNTS.com. Qatar Islamic Bank (QIB) has partnered with Visa to enhance cross-border business-to-business (B2B) payments through Visa B2B Connect. The platform supports direct, account-to-account international transfers and will allow QIB’s corporate clients to send payments to 120 countries. [contact-form-7] QIB is the first Islamic bank in Qatar to adopt Visa B2B Connect, positioning the partnership as both a regional milestone and part of the country’s broader push for financial innovation. The bank said the solution offers faster, more secure, and transparent global transactions, helping businesses navigate the complexity of international settlement. Visa B2B Connect is designed for non-card-based transfers between banks, offering real-time visibility and reducing the need for intermediaries. The service aims to streamline treasury operations and cut down on friction common in legacy correspondent banking systems. “In today’s fast-paced business environment, it’s essential for companies to have a banking partner that can ensure swift transactions,” said Tarek Fawzi, QIB’s general manager for the Wholesale Banking Group. For QIB, the partnership reflects its commitment to helping businesses stay competitive by enabling faster account-to-account cross-border transfers through modern digital infrastructure. The partnership supports Qatar’s national goals around digital transformation and trade enablement. QIB framed the move as part of a larger effort to provide cost-effective, scalable cross-border payment solutions tailored to growing corporate needs. Visa has also launched a separate program this year to help businesses embed payments more directly into their platforms — an effort that complements its global push to modernize B2B transactions and deepen commercial adoption of its infrastructure. As global businesses face mounting pressure to improve payment predictability and reduce operational risk, financial institutions in the Gulf are embracing solutions like Visa B2B Connect to bolster their global capabilities and deepen trade corridor support. This shift aligns with broader regional trends, such as Visa’s recent partnership with NymCard, aimed at enhancing digital payment solutions across the Middle East. The post QIB and Visa Partner to Expand B2B Cross-Border Payments appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-8269697255787144504",
        "title": "Visa snaps seven straight sessions of gains",
        "url": "https://seekingalpha.com/news/4455928-visa-snaps-seven-straight-sessions-of-gains",
        "site": "seekingalpha.com",
        "time": 1749156220000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "7844049603540961164",
        "title": "Visa upgraded to Outperform at Mizuho on more optimistic card spend outlook",
        "url": "https://seekingalpha.com/news/4455829-visa-upgraded-to-outperform-at-mizuho-on-more-optimistic-card-spend-outlook",
        "site": "seekingalpha.com",
        "time": 1749130148000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "844561698756467673",
        "title": "Working Capital Efficiency Rises 2.5% Among North American Middle-Market Companies",
        "url": "https://www.pymnts.com/working-capital/2025/working-capital-efficiency-rises-2-5-among-north-american-middle-market-companies/",
        "site": "pymnts.com",
        "time": 1749110422000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "North American middle-market firms are demonstrating resilience, fueled in part by an increasing and more strategic use of financial tools. [contact-form-7] The “2024-2025 Growth Corporates Working Capital Index: North America Edition,” commissioned by Visa and conducted by PYMNTS, revealed an uptick in the adoption and efficient use of external working capital solutions among firms in […] The post Working Capital Efficiency Rises 2.5% Among North American Middle-Market Companies appeared first on PYMNTS.com. North American middle-market firms are demonstrating resilience, fueled in part by an increasing and more strategic use of financial tools. [contact-form-7] The “2024-2025 Growth Corporates Working Capital Index: North America Edition,” commissioned by Visa and conducted by PYMNTS, revealed an uptick in the adoption and efficient use of external working capital solutions among firms in the United States and Canada. Based on insights from 276 chief financial officers and treasurers across eight industry segments, the study found that adoption of these solutions increased by 15% across the region in 2024, contributing to a 2.5% improvement in overall working capital efficiency. North America now ranks second globally in working capital efficiency among regions analyzed in the index, achieving an average score of 52, indicating a primary focus on planned and strategic objectives over tactical ones. This marked the second year of the study examining the working capital efficiency of this market segment. Often referred to as middle-market companies, Growth Corporates typically generate between $50 million and $1 billion in annual revenue and possess unique characteristics, including a focus on growth while sometimes being underserved by traditional providers. The report series evaluates their working capital needs and the available solutions based on in-depth qualitative and quantitative research. The survey included 196 respondents in the U.S. and 80 in Canada, representing industries such as healthcare, agriculture, commercial travel, fleet and mobility, marketplaces/retail, manufacturing/construction, and professional/facility services. Key data points from the report include: Eight in 10 surveyed North American Growth Corporates used working capital solutions, with the share of firms using them increasing 18% in the U.S. and 10% in Canada. Increases in adoption were seen in healthcare (up 46%) and agriculture (up 31%). Meanwhile, manufacturing and construction maintained high utilization rates at 97%, and fleet and mobility at 94%. Overall working capital efficiency across North America rose by 2.5%, with smaller firms (revenue between $50 million and $250 million) experiencing a 10% increase. The agriculture sector saw a 17% increase in efficiency. Top-performing Growth Corporates, comprising 17% of the surveyed firms, reported average bottom-line benefits of $9.7 million. These firms demonstrate superior metrics, including 48% shorter cash conversion cycles, 42% shorter days inventory outstanding and 22% shorter days payables outstanding compared to lower-performing counterparts. They also saved an average of $181,023 in borrowing costs by securing lower interest rates than bottom performers, a sum representing 24% of bottom performers’ working capital financing costs. The data suggests a reassessment of working capital sources. In the U.S., corporate/virtual cards saw a 54% increase in use among Growth Corporates, valued for their flexibility and convenience. Bank lines of credit also grew in use in the U.S. (up 95%) and Canada (up 51%), while working capital loans decreased by 33% in Canada. Overall, bank-related solutions gained prominence in Canada. Looking ahead, over 8 in 10 North American Growth Corporates plan to continue using working capital solutions, with flexible options like corporate and virtual cards expected to see the greatest increases in utilization. Growth Corporates cited costs and lengthy approvals as the two biggest drawbacks when selecting solutions, and many expressed a desire for smoother, digital-first application processes and personalized, adaptable financing options from their banks. While some sectors anticipate economic headwinds like a global recession or supply chain disruptions, the most efficient firms project further metric improvements, likely fueled by their strategic use of working capital. The report also details how working capital solutions are increasingly used for strategic growth initiatives, including inventory purchases and expansion opportunities, rather than solely for tactical needs. The post Working Capital Efficiency Rises 2.5% Among North American Middle-Market Companies appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "1523066035673054214",
        "title": "Credit Card Swipe Fee Fight Complicates Stablecoin Bill Passage",
        "url": "https://www.bloomberg.com/news/articles/2025-06-03/credit-card-swipe-fee-fight-complicates-stablecoin-bill-passage",
        "site": "bloomberg.com",
        "time": 1748986200000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "An effort by retailers and their allies in the Senate to mandate competition to Visa Inc. and Mastercard Inc. in credit card processing has complicated efforts to swiftly pass the stablecoin bill supported by the crypto industry and President Donald Trump. Visa Inc. and Mastercard Inc. credit cards are arranged for a photograph in Tiskilwa, Illinois, U.S., on Tuesday, Sept. 18, 2018. Visa and Mastercard agreed to pay as much as $6.2 billion to end a long-running price-fixing case brought by merchants over card fees, the largest-ever class action settlement of an antitrust case.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "5559672801350407629",
        "title": "New Klarna Card Marries BNPL Flexibility to Visa Debit Rails",
        "url": "https://www.pymnts.com/buy-now-pay-later/2025/new-klarna-card-marries-bnpl-flexibility-visa-debit-rails/",
        "site": "pymnts.com",
        "time": 1748948429000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Klarna is piloting a card that spends like debit but can flip into pay later mode, extending the buy now, pay later (BNPL) model from the checkout screen to the in-store experience. Unveiled Tuesday (June 3) at Money20/20 Europe, the Klarna Card is built on Visa’s Flexible Credential, a network capability that lets a single […] The post New Klarna Card Marries BNPL Flexibility to Visa Debit Rails appeared first on PYMNTS.com. Klarna is piloting a card that spends like debit but can flip into pay later mode, extending the buy now, pay later (BNPL) model from the checkout screen to the in-store experience. Unveiled Tuesday (June 3) at Money20/20 Europe, the Klarna Card is built on Visa’s Flexible Credential, a network capability that lets a single piece of plastic surface multiple funding sources, Klarna said in a Tuesday press release provided to PYMNTS. Issued by WebBank and housed in a Federal Deposit Insurance Corp.-insured wallet, the card lets testers in the United States pay from stored cash or activate Klarna’s Pay in 4 and pay later plans at any of the over 150 million merchants that already accept Visa. A wider launch in the U.S. and Europe is slated for later this year, the release said. More than 5 million consumers have joined the waitlist. Visa’s Flexible Credential works behind the scenes. Consumers can pay up front in debit mode or activate Klarna’s installments. Eventually, cardholders will be able to select paid tiers that layer in cash back and merchant discounts, per the release. “We consistently hear from consumers that they want the freedom to choose how and when to pay — whether that’s paying now with debit or spreading the cost over time,” Klarna Chief Marketing Officer David Sandstrom said in the release. “They want simplicity, flexibility and transparency — all in one place. That’s exactly what has made Klarna’s payment methods so popular online, and now we’re bringing that same experience to a physical card.” In the release, Visa framed the pilot as the latest proof point for letting one credential do the work of many. “Millions of people around the world have embraced the choice and control offered by Visa’s Flexible Credential, and we’re delighted to extend this to even more U.S. consumers, as well as bringing it to Europe for the first time,” Visa Head of Product and Solutions for Europe Mathieu Altwegg said in the release. PYMNTS has tracked Visa’s all-in-one credential since its launch in Japan with Olive last year and its November expansion with the Affirm Card in the U.S. Visa Chief Consumer Product Officer Mark Nelsen told PYMNTS in November that 70% of Olive-card users in Japan actively flip from debit to credit for higher-ticket items and back again for daily spending. The move underscored Visa’s thesis that issuers will soon need a single card that can morph from debit to credit to installments on demand — precisely the experience Klarna is now testing with its own card. For all PYMNTS digital transformation coverage, subscribe to the daily Digital Transformation Newsletter. The post New Klarna Card Marries BNPL Flexibility to Visa Debit Rails appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3435257424670994882",
        "title": "Zilch Partners With Visa to Launch Physical Payments Card",
        "url": "https://www.pymnts.com/news/payment-methods/2025/zilch-partners-with-visa-to-launch-physical-payments-card/",
        "site": "pymnts.com",
        "time": 1748896888000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "London-based Zilch, an ad-enabled payments technology company that provides virtual payment cards to one in seven U.K. working adults, is set to launch its first physical payments card in September. The launch of the physical card is enabled by Zilch’s new strategic multi-year partnership with Visa, which the companies announced in a Monday (June 2) press release […] The post Zilch Partners With Visa to Launch Physical Payments Card appeared first on PYMNTS.com. London-based Zilch, an ad-enabled payments technology company that provides virtual payment cards to one in seven U.K. working adults, is set to launch its first physical payments card in September. The launch of the physical card is enabled by Zilch’s new strategic multi-year partnership with Visa, which the companies announced in a Monday (June 2) press release emailed to PYMNTS. The partnership will also enable Zilch to launch other new products, capture a greater share of customers’ spend and drive its continued growth, according to the release. “This move will allow us to fully deploy our ad-enabled payments technology across both digital and physical retail, bringing measurable savings to consumers and margin efficiencies to merchants,” Zilch CEO and Co-founder Philip Belamant said in the release. “With nearly 80% of U.K. adults still not regularly using mobile wallets, the physical card is a strategic unlock to greater transaction volume.” The U.K. has historically been a “PC-first” economy compared to others, where smartphones represented a “leapfrog” technology, according to the PYMNTS Intelligence report, “2025 Global Digital Shopping Index: U.K. Edition.” The “digital shopping days” metric, which measures engagement across seven digital browsing and purchasing activities online and in-store, shows U.K. shoppers engage in fewer mobile digital shopping days per month than the average of the eight countries surveyed, per the report. Zilch’s new physical card will give greater flexibility to customers who prefer to use a physical card, according to the company’s press release. It also enables Zilch to be used for home maintenance, hotel check-ins, car rentals and other key transactions, the release said. Because the card will work seamlessly across Visa’s global network, it will allow Zilch customers to shop anywhere in the world that Visa is accepted, online or offline, while continuing to earn rewards and access flexible repayment options, per the release. Mandy Lamb, managing director, U.K. and Ireland at Visa, said in the release: “FinTechs are shaping the future of commerce, and we’re proud to support U.K. unicorns such as Zilch with their growth ambitions as they provide innovative services to consumers and businesses, while driving financial inclusion through their core offering.” The post Zilch Partners With Visa to Launch Physical Payments Card appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-7265675974738623986",
        "title": "Glossary Cuts Through Jargon Surrounding A2A Payments",
        "url": "https://www.pymnts.com/news/payment-methods/2025/glossary-cuts-through-jargon-surrounding-a2a-payments/",
        "site": "pymnts.com",
        "time": 1748881715000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "A burst of announcements, from Visa’s “buyer-protected” account-to-account (A2A) service in the U.K. to fresh funding for variable recurring payments, has pushed bank-to-bank transfers back onto corporate agendas. Yet the vocabulary can feel like alphabet soup. Below is a glossary that puts the main terms in context, shows how they differ and notes where each […] The post Glossary Cuts Through Jargon Surrounding A2A Payments appeared first on PYMNTS.com. A burst of announcements, from Visa’s “buyer-protected” account-to-account (A2A) service in the U.K. to fresh funding for variable recurring payments, has pushed bank-to-bank transfers back onto corporate agendas. Yet the vocabulary can feel like alphabet soup. Below is a glossary that puts the main terms in context, shows how they differ and notes where each stands after the latest news. Pay by Bank A checkout option that lets a merchant pull money straight from a shopper’s current account, using open-banking APIs to verify balances in real time. It promises card-like convenience without card interchange. J.P. Morgan and Mastercard switched on a U.S. pilot in late 2023, focusing on billers and recurring spend, while Visa this week added chargeback-style guarantees to its U.K. pay-by-bank rail — an effort to overcome trust hurdles that have slowed consumer adoption. Account-to-Account (A2A) Payments An umbrella label for any credit push or debit pull that moves money directly between deposit accounts, bypassing card networks. A2A spans everything from ACH debits to instant-payment rails and relies increasingly on open-banking data for risk checks. Visa’s new service frames A2A as a retail alternative to cards, while corporate treasurers view it as a cheaper rail for supplier payouts. Wire Transfers High-value, irrevocable transfers settled through real-time gross-settlement systems (Fedwire or CHIPS in the U.S., correspondent banks plus Swift cross-border). Wires carry the strongest finality and highest fees, making them the workhorse for M&A closings and wholesale liquidity moves. The big change is technical: Swift will phase out legacy MT messages in favor of ISO 20022 formats by Nov. 22, 2025, promising richer data and better sanctions screening. Automated Clearing House (ACH) The batch network that underpins most U.S. payroll, bill pay and B2B invoices, ACH is governed by Nacha. ACH is cheap but not instant; settlement takes up to two business days unless firms pay extra for Same-Day ACH. Even so, volumes keep climbing: the network handled 8.5 billion payments worth $22.1 trillion in the first quarter of 2025, while Same-Day ACH grew nearly 20 percent year on year. Instant Payments Rails that clear and settle within seconds, 24/7. In the U.S., The Clearing House’s RTP network targets commercial use cases, while the Federal Reserve’s FedNow Service is onboarding banks of all sizes. FedNow said its volumes and participant count continued to “grow sharply” in the first quarter, giving CFOs a path to real-time cash positioning — and giving merchants the speed consumers already expect at checkout. Open Banking A regulatory and commercial framework that requires banks to share account data and, increasingly, to initiate payments through secure APIs once customers give permission. In practical terms, it is the plumbing behind pay-by-bank, A2A risk checks and variable recurring payments. The U.K.’s early rollout has made it the test bed; the U.S. awaits a final rule under Section 1033 of the Dodd-Frank Act. Visa’s decision to bolt buyer protections onto U.K. open-banking rails underscores how far the model has come — and what gaps remain. Variable Recurring Payments (VRP) Often described as “direct debit on steroids,” VRP lets a trusted third party pull different amounts from a customer’s account within caps the customer sets. The U.K. already mandates VRP for “sweeping” funds between a consumer’s own accounts; the next frontier is commercial VRP for subscription services and utility bills. In May, 31 banks and FinTechs agreed to fund an independent body to run that workstream, signaling that a broader rollout is finally imminent. Peer-to-Peer (P2P) Payments Consumer-to-consumer transfers, typically routed over ACH for settlement but delivered in real time at the user interface. In the U.S., Zelle processed 3.6 billion transactions totaling more than $1 trillion in 2024, up roughly a quarter from 2023. The network’s scale shows how quickly users embrace A2A when the user experience is slick and fees are nil, and it offers a template for retail pay-by-bank at the point of sale. The post Glossary Cuts Through Jargon Surrounding A2A Payments appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4348813742419579634",
        "title": "Visa Launches A2A Payments With Guarantees",
        "url": "https://www.pymnts.com/visa/2025/visa-launches-a2a-payments-with-guarantees/",
        "site": "pymnts.com",
        "time": 1748861659000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa A2A’s latest update, announced this morning (June 2), connects card-style buyer protections onto pay-by-bank transfers, promising U.K. consumers and merchants a safety net that the market’s open-banking rails have largely lacked. According to Visa, its A2A platform is “market-ready” for bill and subscription payments, with eCommerce to follow. Built on Pay.UK’s Faster Payment System, […] The post Visa Launches A2A Payments With Guarantees appeared first on PYMNTS.com. Visa A2A’s latest update, announced this morning (June 2), connects card-style buyer protections onto pay-by-bank transfers, promising U.K. consumers and merchants a safety net that the market’s open-banking rails have largely lacked. According to Visa, its A2A platform is “market-ready” for bill and subscription payments, with eCommerce to follow. Built on Pay.UK’s Faster Payment System, the service lets consumers authorize recurring bank transfers inside their mobile-banking apps and integrates Visa’s dispute-resolution rules to reimburse customers when errors occur. That recourse, long standard on card rails, could help coax mainstream users toward open-banking payments. Businesses stand to gain near-real-time settlement, instant alerts when a customer revokes permission and richer data fields for reconciliation. Visa is pitching the product as an open model in which banks and FinTechs can plug in and help modernize pay-by-bank while maintaining a commercial structure “that works for all participants.” The company argues wider adoption could unlock £328 billion in economic output over the next five years — an estimate that underscores the stakes for the U.K. as it tries to keep its FinTech edge. The first wave of partners, including data-aggregator Plaid, is slated to bring Visa A2A to market later this year. “This partnership brings together Visa’s trusted rails and Plaid’s open-banking network to make pay-by-bank as simple and secure as card on file. It’s a new standard for how consumers and businesses move money — fast, protected, and ready to scale,” said Zak Lambert, Plaid Europe’s head of product. PYMNTS has tracked Visa’s A2A journey from its €1.8 billion acquisition of Swedish open-banking platform Tink in 2021 through May 2024 when the network rolled out “Visa Protect for A2A Payments,” an AI-driven fraud screen that Visa said detected 54 percent more scams than banks’ own systems, to a September 2024 deep-dive in which Visa Europe product chief Mehret Habteab described how early bill-payment pilots were giving utilities and telecoms real-time visibility while letting consumers fine-tune payment mandates on the fly. Today’s U.K. rollout is Visa’s most direct challenge yet to the notion that open-banking payments must sacrifice protection for lower cost. Visa plans to layer one-click A2A checkout onto eCommerce “in phases” later this year — extending its guarantee to online retail at a moment when rising fraud has tempered enthusiasm for direct-from-account payments. The post Visa Launches A2A Payments With Guarantees appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6539255547074500684",
        "title": "Needing Dollars, Iran-Backed Militias Turn to Visa and Mastercard",
        "url": "https://www.wsj.com/world/middle-east/iran-visa-mastercard-dollars-sanctions-militias-0ecea0b9?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1748739600000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6993881753536646310",
        "title": "ZA Bank to Enable ‘Visa Click to Pay’ in Several Asia-Pacific Markets",
        "url": "https://www.pymnts.com/news/payments-innovation/2025/za-bank-to-enable-visa-click-to-pay-in-several-asia-pacific-markets/",
        "site": "pymnts.com",
        "time": 1748567632000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Hong Kong-based digital bank ZA Bank has become the first card-issuing bank to enable Visa Click to Pay in Hong Kong and will do the same in 11 more Asia-Pacific markets in the future. Click to Pay enables cardholders to complete online transactions in seconds, without having to manually enter their card information, Visa said […] The post ZA Bank to Enable ‘Visa Click to Pay’ in Several Asia-Pacific Markets appeared first on PYMNTS.com. Hong Kong-based digital bank ZA Bank has become the first card-issuing bank to enable Visa Click to Pay in Hong Kong and will do the same in 11 more Asia-Pacific markets in the future. Click to Pay enables cardholders to complete online transactions in seconds, without having to manually enter their card information, Visa said in a Monday (May 26) press release. In the Asia-Pacific region, major acquirers, including AsiaPay, and merchants have geared up to offer Visa Click to Pay, according to the release. “ECommerce in Asia Pacific has been accelerated by mobile phone ownership, digital advancements and connectivity in Asia Pacific,” T.R. Ramachandran, head of products and solutions, Asia Pacific at Visa, said in the release. “Our partnership with ZA Bank is a great example of Visa’s ongoing industry collaboration to bring innovative payment solutions that benefit the consumer, merchant and issuer.” With Visa Click to Pay, the data needed for online shopping is securely stored with Visa, so cardholders don’t have to store their information on third-party sites, according to the release. Because it is a card-level feature that comes ready with Visa cards, Click to Pay requires no additional setup and no signups with third-party eCommerce or merchant sites, the release said. Consumers need only their registered email, phone number or Visa Payment Passkey to check out online. For merchants, Visa Click to Pay improves business by reducing friction and the cart abandonment that friction can cause, per the release. “Visa will continue to uplift the consumer retail and online experience while bringing greater commercial success and more innovations to our bank and merchant partners across the region,” Ramachandran said in the release. Visa reported in July that the focus on simpler, secure checkout experience is gaining momentum. The company’s integration of its Click to Pay and Visa Payment Passkey service enables customers to authenticate themselves using biometrics. “Already, we have hundreds of issuers enabled for passkeys in Europe and a number of issuers who represent more than 50% of our commerce payments volume in Europe piloting the solution,” Visa CEO Ryan McInerney said during a July earnings call. When Worldpay and Visa announced the launch of Click to Pay for online merchants in the U.K. in March, Worldpay said it has found that 83% of online shoppers expect a one-click checkout experience. The post ZA Bank to Enable ‘Visa Click to Pay’ in Several Asia-Pacific Markets appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6179355880040571978",
        "title": "Federal Judge Skeptical of Visa’s Push to Toss US Antitrust Case",
        "url": "https://www.bloomberg.com/news/articles/2025-05-29/federal-judge-skeptical-of-visa-s-push-to-toss-us-antitrust-case",
        "site": "bloomberg.com",
        "time": 1748544682000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "The federal judge overseeing the Justice Department’s antitrust lawsuit against payments giant Visa Inc. expressed skepticism at the company’s effort to dismiss the case at the current early stage of the litigation. Visa cards.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6942358306885143258",
        "title": "Karat Financial is bringing business banking to creators",
        "url": "https://techcrunch.com/2025/05/28/karat-financial-is-bringing-business-banking-to-creators/",
        "site": "techcrunch.com",
        "time": 1748458800000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "v"
        ],
        "description": "Karat Financial, the company known for its credit cards for creators, is launching a creator-focused business banking product. Powered by digital bank Grasshopper, Karat’s banking product is a natural extension of its credit card offering with Visa. “Six years in, the problem we’re solving is still the same,” co-founder and co-CEO Eric Wei told TechCrunch. […]",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3028683803459578222",
        "title": "Visa Names Antony Cahill To Lead European Business",
        "url": "https://www.pymnts.com/visa/2025/visa-names-antony-cahill-to-lead-european-business/",
        "site": "pymnts.com",
        "time": 1748343446000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "7091604091310134147"
        ],
        "description": "Visa has named banking veteran Antony Cahill to head its European operations. Cahill replaces European CEO Charlotte Hogg, who is leaving the company after eight years to pursue a new opportunity, the payments giant announced in a Tuesday (May 27) news release. “We are grateful to Charlotte for all she has done to advance our […] The post Visa Names Antony Cahill To Lead European Business appeared first on PYMNTS.com. Visa has named banking veteran Antony Cahill to head its European operations. Cahill replaces European CEO Charlotte Hogg, who is leaving the company after eight years to pursue a new opportunity, the payments giant announced in a Tuesday (May 27) news release. “We are grateful to Charlotte for all she has done to advance our business in Europe,” said Visa CEO Ryan McInerney. “With Antony’s experience in the region, deep understanding of the diversity and complexity of our markets, and strong relationships with our partners, he is uniquely qualified to lead Visa Europe.” Cahill joined Visa in 2018 as managing director for Europe, and later became deputy CEO for the region. Since 2023, he has served as president of the company’s value-added services (VAS) unit, which has grown into a $9 billion business. As PYMNTS noted in a report last year, Visa has 250 VAS offerings, including things like Verifi, which helps merchants prevent and resolve disputes and chargebacks, and open banking, through the company’s acquisition of Tink. Speaking with PYMNTS CEO Karen Webster, Cahill likened these offerings to a set of multivitamins or personal trainers. Companies like Tink help Visa’s partners maintain “maximum fitness and improve their service levels and customer experience.” The industry has “never moved faster,” he added. “It’s never been more competitive, and consumer expectations have never been higher.” Breaking down the business, Cahill said a third of Visa’s VAS activity is tied to helping client firms (merchants included) address the “pain points” of payments. “And two-thirds,” he added, “comes from helping our issuers move into great new areas of opportunity — to reframe their business and open up new revenue pools.” That’s squarely focused on increasing their Gen Z ranks, the report added. While banks typically generate the bulk of their income from older and more financially established consumers, refocusing their product mix for younger consumers has become a high priority. That’s particularly true as they have more digital-first and digital-only payments and banking options to pick from. “Generation Z was born digitally native,” Cahill said. “They’ve never known an experience without their handheld mobile devices — and their lives revolve around those devices.” Before joining Visa, Cahill served as chief operating officer at National Australia Bank, following a 12-year stint with the Australia and New Zealand Banking Group. Visa says an internal search for Cahill’s replacement has begun, and the company expects to name his successor soon. He will transition into his new role in early June. The post Visa Names Antony Cahill To Lead European Business appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "7091604091310134147",
        "title": "Visa names veteran Antony Cahill as CEO of European operations",
        "url": "https://seekingalpha.com/news/4452398-visa-names-veteran-antony-cahill-as-ceo-of-european-operations",
        "site": "seekingalpha.com",
        "time": 1748331690000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-4893382905493211284",
        "title": "Report: European Commission Looking Into Visa and Mastercard Fees",
        "url": "https://www.pymnts.com/news/regulation/2025/report-european-commission-looking-into-visa-and-mastercard-fees/",
        "site": "pymnts.com",
        "time": 1748023126000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "The European Commission is reportedly looking into fees charged by Visa and Mastercard in a move that could lead to a formal probe. The competition regulator sent requests for information to market participants last week, asking about fees they impose on financial institutions that provide services to retailers using the Visa and Mastercard networks, Bloomberg […] The post Report: European Commission Looking Into Visa and Mastercard Fees appeared first on PYMNTS.com. The European Commission is reportedly looking into fees charged by Visa and Mastercard in a move that could lead to a formal probe. The competition regulator sent requests for information to market participants last week, asking about fees they impose on financial institutions that provide services to retailers using the Visa and Mastercard networks, Bloomberg reported Friday (May 23), citing unnamed sources. The questions focus on whether retailers have a choice in accepting Visa and Mastercard payments, whether merchants get value from the fees that are passed on to them, and whether the charges are transparent, according to the report. The commission told Bloomberg that “the investigation is ongoing,” without providing specifics. Visa said in the report that its fees “reflect the immense value that we provide to financial institutions, merchants and consumers in Europe,” including security and reliability. Mastercard told Bloomberg that it “offers consumers and businesses choice, ways to pay and be paid that are hassle-free and worry-free, secure and most convenient for them.” It was reported May 14 that a group of trade associations representing European retailers asked the European Commission to take action against Visa and Mastercard under EU antitrust laws, alleging that the companies charge high fees and don’t provide transparency on those fees. The letter also called for price controls on interchange fees, transparency and non-discriminatory obligations for international card schemes (ICSs), and a tool for regulators to scrutinize ICSs’ actions, according to the report. “International Card Schemes (ICS) have been able to increase their fees without competitive challenge or regulatory scrutiny,” the letter said, per the report. “They have also rendered their system of fees and rules so complex and opaque that players are unable to understand, let alone challenge, what they are paying for and why.” Mastercard was hit with a $648.3 million fine by the EU in 2019, with the EU alleging that the payments company raised the costs of card payments artificially. It was reported at the time that the fine was part of an effort on the part of European regulators to stamp out fees that U.S. credit card companies charge. The post Report: European Commission Looking Into Visa and Mastercard Fees appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "1868679853961787989",
        "title": "Visa, Mastercard Fees Hit by New Round of EU Antitrust Scrutiny",
        "url": "https://www.bloomberg.com/news/articles/2025-05-23/visa-mastercard-fees-hit-by-new-round-of-eu-antitrust-scrutiny",
        "site": "bloomberg.com",
        "time": 1748007389000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "-5103228521605484026",
            "-9031338486653252570",
            "-2334480904329112775",
            "6946464783854818704",
            "-4893382905493211284"
        ],
        "description": "Visa Inc. and Mastercard Inc. fees are under fresh scrutiny from European Union antitrust enforcers, less than a decade after a series of probes ended with hefty fines and an agreement to cut some of their controversial levies.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-1261532858471886271",
        "title": "Banking Circle Lets Visa Access Its Local Clearing Rails",
        "url": "https://www.pymnts.com/partnerships/2025/banking-circle-lets-visa-access-its-local-clearing-rails/",
        "site": "pymnts.com",
        "time": 1747934827000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Payments bank Banking Circle launched a partnership with Visa’s Visa Direct. This collaboration lets Visa Direct access Banking Circle’s “extensive” local clearing rails around the world, thus strengthening Visa’s payment reach for its customers, the companies said in a Thursday (May 22) news release. The arrangement lets Visa Direct use Banking Circle’s single API technology […] The post Banking Circle Lets Visa Access Its Local Clearing Rails appeared first on PYMNTS.com. Payments bank Banking Circle launched a partnership with Visa’s Visa Direct. This collaboration lets Visa Direct access Banking Circle’s “extensive” local clearing rails around the world, thus strengthening Visa’s payment reach for its customers, the companies said in a Thursday (May 22) news release. The arrangement lets Visa Direct use Banking Circle’s single API technology to access direct and local clearing rails via a “single, secure and trusted provider,” according to the release. “Our partnership with Visa Direct represents an important milestone in our firm’s mission to increase speed, efficiency and reduce costs associated with cross-border transactions,” Banking Circle CEO Laust Bertelsen said in the release. “Partnering with a business of Visa Direct’s scale and stature as a payments industry leader reinforces the growth of Banking Circle’s capabilities and highlights the trust in, and significance of, our single API.” In other cross-border payments news, there is an opportunity for processors to expand into new capabilities tied to cross-border commerce thanks to payment integration. “Consumers demand simplicity and seamlessness in their everyday financial lives and the commerce experience,” PYMNTS reported April 30. “Consider the Starbucks app, a single point of integration that ties in everything from ordering one’s morning java, to paying for it, to redeeming loyalty rewards.” Brandon Ferris, product lead at Thredd, told PYMNTS that more brands are looking for ways to control and enhance the end-user experience. “[Brands] want things like a native wallet … and specifically within payments, you’re seeing the blurring of lines between debit or credit or money movement,” he said. The challenge for payment processors is to expand the range of value-added services they provide to those client firms and find the right partners with which to team up as they allow for smooth money movement. “What’s shifting is how clients think about their relationships with processors,” Ferris said, adding that “they are looking for a processor and partner who can do it all — they don’t want to be in a position where they have to go out and find five, seven or 10 different vendors. They want one set of APIs and an integrated experience. The processors are starting to capitalize on that customer need.” The post Banking Circle Lets Visa Access Its Local Clearing Rails appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4912465759760631427",
        "title": "Samsung Wallet Adds ‘Tap to Transfer’ Feature for P2P Payments",
        "url": "https://www.pymnts.com/real-time-payments/2025/samsung-wallet-adds-tap-to-transfer-feature-for-p2p-payments/",
        "site": "pymnts.com",
        "time": 1747860218000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Samsung Wallet in the U.S. now simplifies peer-to-peer (P2P) payments with the help of Visa Tap technology and the Visa Direct money movement solution. With the launch of this Samsung Tap to Transfer, Samsung becomes the first partner to deploy Visa’s Tap to P2P, Visa said in a Wednesday (May 21) press release. This feature creates interoperability between […] The post Samsung Wallet Adds ‘Tap to Transfer’ Feature for P2P Payments appeared first on PYMNTS.com. Samsung Wallet in the U.S. now simplifies peer-to-peer (P2P) payments with the help of Visa Tap technology and the Visa Direct money movement solution. With the launch of this Samsung Tap to Transfer, Samsung becomes the first partner to deploy Visa’s Tap to P2P, Visa said in a Wednesday (May 21) press release. This feature creates interoperability between digital wallets, allowing users to transfer funds within a minute, according to the release. “Tap to Transfer allows Samsung Galaxy users to send money to the bank accounts of friends or family simply by tapping their phones together or by tapping a friend’s participating contactless debit card, regardless of the receiver’s device or digital wallet,” the release said. “This means no app navigation, no manual entry of card details, no wait times and no more hassle if a friend doesn’t have the same P2P app.” Tap to P2P is the latest application of Visa’s Tap technology, which “allows consumers to tap their card on NFC-enabled consumer devices, unlocking a number of new Tap innovations from Visa,” Geraldine Mitchley, vice president and head of Visa Tap global enablement at Visa, said in the release. An earlier use case of this technology, the Tap to Phone contactless payment solution, saw a 200% increase in adoption in the year ended March 3, Visa reported at the time. Mark Nelsen, global head of consumer products at Visa, told PYMNTS CEO Karen Webster at the time: “Tap to Phone is a tech equalizer for business. Walk into some of the world’s largest retailers or go to your local farmer’s market and they’re using this same technology to accept payments right on their phone.” The movement of funds through the new Tap to Transfer is facilitated by Visa Direct, which works behind the scenes to move funds to the recipient’s bank account, according to Visa’s Wednesday press release. “This literally puts the power of money movement in the hands of consumers,” Jim Filice, vice president and head of NA money movement at Visa, said in the release. Samsung announced May 6 that it was set to add Tap to Transfer to Samsung Wallet this month, saying this P2P payments feature is likely to be used for things like paying friends back for buying group tickets or sending them a portion of a dinner bill. “Many users want the flexibility to accomplish their most frequent and important tasks on their mobile device,” Drew Blackard, senior vice president of mobile product management at Samsung Electronics America, said at the time in a press release. The post Samsung Wallet Adds ‘Tap to Transfer’ Feature for P2P Payments appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-747278855592824568",
        "title": "Visa launches commercial integration program to boost fintech",
        "url": "https://seekingalpha.com/news/4450884-visa-launches-commercial-integration-program-to-boost-fintech",
        "site": "seekingalpha.com",
        "time": 1747830942000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-7304128676577500302",
        "title": "Visa Launches AR Manager Tool, Targeting Suppliers’ Biggest Business Payments Bottleneck",
        "url": "https://www.pymnts.com/accounts-receivable/2025/visa-launches-ar-manager-tool-targeting-suppliers-biggest-business-payments-bottleneck/",
        "site": "pymnts.com",
        "time": 1747825243000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "B2B payments are the lifeblood of global business, and few innovations have scaled as rapidly (and as unevenly) as virtual cards across B2B. “Virtual cards are growing tremendously in the market, with estimates that range from anywhere between 15% to 25%. But while they’re a great tool for buyers, they can be a resource drain […] The post Visa Launches AR Manager Tool, Targeting Suppliers’ Biggest Business Payments Bottleneck appeared first on PYMNTS.com. B2B payments are the lifeblood of global business, and few innovations have scaled as rapidly (and as unevenly) as virtual cards across B2B. “Virtual cards are growing tremendously in the market, with estimates that range from anywhere between 15% to 25%. But while they’re a great tool for buyers, they can be a resource drain for suppliers,” Abhishek, global head of B2B Acceptance at Visa Commercial Solutions, told PYMNTS CEO Karen Webster in an interview conducted as Visa announced its new AR Manager automation tool. Virtual cards have long been a double-edged sword. Loved by buyers for their control, security and working capital benefits, they can often burden suppliers with tedious onboarding processes and the manual reconciliation of virtual card payments from multiple buyers. “Suppliers will get an email, search for the password, go to a website, retrieve a card number, go to their ePOS, enter that number, retrieve the amount, and then wait for the money to show up,” Abhishek said. There’s an immense amount of resource drain, which is a pain point that is multiplied by the number of virtual card payments received across a variety of buyers they may do business with, he said. As Webster pointed out, “when you’re doing things manually, there’s a lot of opportunity for mistakes. And when there are mistakes, you don’t get paid right away.” For Visa, this pain point represents an opportunity. Visa AR Manager is a new platform designed to automate the accounts receivable (AR) process for suppliers accepting virtual cards. As Abhishek told Webster, AR Manager is a “home-grown” innovation built by Visa versus partnering or building on someone else’s infrastructure. The launch of AR Manager is aimed at reducing supplier friction and boosting overall acceptance of virtual cards across B2B by standardizing the way that suppliers accepting virtual cards, and for the buyers using them, get paid more efficiently. “The capability is ubiquitous,” Abhishek said. “It works with all issuers, all acquirers and all suppliers, which has been the vision from day one.” The broader goal of Visa’s AR Manager is to activate a network effect using suppliers as the catalyst for change. “We are now in a position to say [to suppliers], if your financial institution is ready, we can help you,” Abhishek said. “And we’re encouraging suppliers to let their institutions know [they’re ready].” Webster said this creates a dynamic shift in the market. “That doesn’t always happen with virtual card products,” she said. “It’s interesting to see suppliers now putting pressure on issuers to help standardize how they’re paid across their buying communities [using virtual cards].” That network effect has the potential to change what was once reluctance on the part of suppliers to accept virtual cards. As suppliers see the value in eliminating manual processes and making payments fast, Visa is betting they will start to request virtual cards to expedite cash flow and put pressure on buyers and their banks to create a better vendor payments experience. It’s a dynamic that Abhishek said could persuade suppliers to create the efficiencies virtual cards present within their own organizations. Fixing the Friction in Supplier Virtual Card Acceptance Abhishek said the supplier-side friction that Visa is targeting isn’t just inconvenient; it’s expensive. According to Visa’s internal estimates, processing a single virtual card transaction manually can take five to 15 minutes. Over thousands of payments, this translates into an operational burden. Visa AR Manager automates the entire process, from payment receipt to enterprise resource planning (ERP) reconciliation, creating a seamless “straight-through” experience for suppliers, he said. The company’s journey from concept to commercial availability began about 18 months ago, when Visa launched a limited pilot to test email-based reconciliation automation. The feedback from early adopters was encouraging but also pointed to the need for a more scalable and flexible platform, he said. “We’ve expanded our capability from purely email-based automation to batch file-based automation,” Abhishek said. “In the future, it will become API-based… For those who already accept, the platform makes it easier. For those who don’t, it removes the hurdle for acceptance… They just need to send us sample batch files or emails.” The platform has been built to require zero development work on the part of participating financial institutions, something that Webster called a “valuable asset,” noting that a four- to 12-week onboarding period could otherwise become “four to 12 years” if custom development were required. The real value becomes clear when reconciling those payments with ERP systems, which is a task often mired in complexity and risk of mismatch, Abhishek said. Moving Toward Seamless Payments One of the most potentially transformative promises of Visa AR Manager is its potential to improve suppliers’ cash flow and working capital metrics, which are often throttled by payment delays or reconciliation backlogs. “Cash flow is the lifeblood of any corporation,” Abhishek said. “If a payment comes to someone who’s out of the office, on vacation or in meetings, it just sits there and ages. With AR Manager, the moment the payment is received, it’s automatically processed. We’ve seen days sales outstanding (DSO) go down for corporates who’ve moved to this solution.” This isn’t just about convenience; it’s about operational efficiency. One of the unexpected challenges Visa encountered during the build was the variation in how virtual card data is formatted. “We thought there might be four or five email templates,” Abhishek said. “Suppliers sent us hundreds. Every buyer has their own format. Every AP solution, their own format. Every financial institution, their own. Suddenly you have thousands of formats.” That revelation underscores the scale of the problem Visa set out to solve — and why automation at the AR layer could become a cornerstone of commercial payments modernization. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Visa Launches AR Manager Tool, Targeting Suppliers’ Biggest Business Payments Bottleneck appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "8866303226002139230",
        "title": "Visa Debuts Program to Help Businesses Embed Payments",
        "url": "https://www.pymnts.com/visa/2025/visa-debuts-program-help-businesses-embed-payments/",
        "site": "pymnts.com",
        "time": 1747825200000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa launched Visa Commercial Integrated Partners, a program to help businesses embed payments into their products and platforms. The program is designed to cover companies ranging from ERP platforms that streamline reconciliation processes to connected commerce applications that enable in-vehicle fleet transactions, Visa said in a Tuesday (May 21) news release provided to PYMNTS. “Visa […] The post Visa Debuts Program to Help Businesses Embed Payments appeared first on PYMNTS.com. Visa launched Visa Commercial Integrated Partners, a program to help businesses embed payments into their products and platforms. The program is designed to cover companies ranging from ERP platforms that streamline reconciliation processes to connected commerce applications that enable in-vehicle fleet transactions, Visa said in a Tuesday (May 21) news release provided to PYMNTS. “Visa Commercial Integrated Partners is providing the ecosystem, technology and framework for innovative FinTechs and other business application providers to integrate payment functionalities into their platforms with ease and enable Visa credentials offered by Visa Commercial issuers,” the release said. “This also benefits Visa business partners in the program by reducing their development time and costs, enabling FinTechs to focus on innovation and enhancing customer experiences, while providing their customers with the ability to make payments with existing commercial card credentials,” the release added. Financial institutions can use Visa Commercial Integrated Partners to provide customers with payment solutions, such as payments in ERPs, expense management, mobile and vehicle apps, tokenization via virtual cards, and more elaborate transaction controls and enhanced data on settlements, according to the release. Vehicle-embedded payments tech company CarIQ is among the program’s inaugural partners, the release said. “Our digital payment infrastructure enables issuing banks to offer commercial customers a fleet solution that will enable them to connect their fleet vehicles directly to their existing Visa line of credit,” Car IQ founder and CEO Sterling Pratz said in the release. “We believe transforming the vehicle into a Visa payment credential for fuel, tolls and services will help banks recapture fleet spend that is currently lost to legacy card programs and private networks.” The rise of embedded payments is helping transform the business models of several verticals, including legal and financial services companies, accounting firms, nonprofits and logistics operators. For the payments processors working with those firms — and collaborating with independent software vendors (ISVs) and other providers — helping them give customers the payment options where and when they want them is critical. In an interview with PYMNTS, Stax Chief Transformation Officer Adam Gray said that “as an industry, we are always trying to serve new markets — and for embedded payments, there are historically underserved markets that we’re seeing growth.” For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Visa Debuts Program to Help Businesses Embed Payments appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "1828036419920127756",
        "title": "Nearly Half of SMB Lenders Overlook Embedded Opportunity, Study Finds",
        "url": "https://www.pymnts.com/smbs/2025/nearly-half-of-smb-lenders-overlook-embedded-opportunity-study-finds/",
        "site": "pymnts.com",
        "time": 1747641645000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Many lenders appear to be significantly underestimating the burgeoning opportunity presented by embedded lending, potentially ceding market share and bottom-line growth. According to a recent report, “Embedded Lending: From the Lender’s Perspective,” commissioned by Visa and produced by PYMNTS, embedded lending involves integrating credit tools directly into a merchant or provider’s platform, allowing borrowers to […] The post Nearly Half of SMB Lenders Overlook Embedded Opportunity, Study Finds appeared first on PYMNTS.com. Many lenders appear to be significantly underestimating the burgeoning opportunity presented by embedded lending, potentially ceding market share and bottom-line growth. According to a recent report, “Embedded Lending: From the Lender’s Perspective,” commissioned by Visa and produced by PYMNTS, embedded lending involves integrating credit tools directly into a merchant or provider’s platform, allowing borrowers to apply for credit at the point of payment for a product or service. This differs from traditional lending, where consumers use existing credit cards or personal loans. While embedded lending is becoming a prominent feature in both consumer and SMB segments across six major economies surveyed — Australia, Germany, India, Japan, the United Kingdom and the United States — a sizable share of lenders, particularly those serving SMBs, have not fully embraced its potential. Roughly 45% of lenders serving SMBs currently do not offer any embedded lending product. Even among those offering embedded options, interest in launching new embedded lending products in the next two years is notably low, with only about 1 in 5 lender respondents indicating they are very or extremely interested. The report, based on a survey of 361 lenders conducted from Feb. 20 to March 15, 2024, highlights that lenders offering embedded solutions are largely overlooking the SMB segment by focusing primarily on consumers. For example, 83% of lenders offer embedded lending products to customers, compared to 55% that serve SMBs. Furthermore, lenders are widely underutilizing external platform integrations, such as with eCommerce platforms or in-store point-of-sale systems, which are crucial for reaching new customers and facilitating embedded experiences directly within the transaction flow. Only 58% of lenders serving consumers have at least one third-party platform integration, and this figure is just 64% for those serving SMBs. This underutilization persists even among integrated lenders; only 37% of consumer lenders, for instance, have integrated with eCommerce platforms. This contrasts sharply with substantial consumer and SMB demand, as 43% of consumers and 37% of SMBs surveyed are very or extremely interested in switching to a provider that offers embedded lending. Lenders with increased net profits in 2023 were found to be more interested in new embedded lending products and more likely to have embedded lending in their portfolios. Key data points from the report include: Nearly half (45%) of lenders serving SMBs do not currently offer any embedded lending product. Only 22% of lenders lending to consumers and 22% of lenders lending to SMBs express very or extremely high interest in offering new embedded lending products in the next two years. A significant share of consumers (43%) and SMBs (37%) are very or extremely interested in switching to a provider that offers embedded lending options. The report also delves into the obstacles deterring lenders from entering the embedded lending space, citing technology integration and infrastructure challenges (34%), operational and scalability issues (23%), and risk management and credit assessment (22%) as the biggest concerns for those not currently offering such products. It notes varying challenges across different countries. The report also identifies specific embedded lending products lenders are most interested in offering in the future, including embedded personal loans (67% of consumer lenders not currently offering) and embedded microloans or microfinance products (67% of SMB lenders not currently offering). The data underscores a significant opportunity for lenders to better align their embedded lending strategies with market demand and leverage external integrations more effectively. The post Nearly Half of SMB Lenders Overlook Embedded Opportunity, Study Finds appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "3750749707579198419",
        "title": "Visa shares uptick for seven consecutive sessions",
        "url": "https://seekingalpha.com/news/4449026-visa-shares-uptick-for-seven-consecutive-sessions",
        "site": "seekingalpha.com",
        "time": 1747328822000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "-8269697255787144504"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5854203055069081819",
        "title": "Report: European Retailers Seek Antitrust Case Against Mastercard and Visa",
        "url": "https://www.pymnts.com/antitrust/2025/european-retailers-seek-antitrust-case-against-mastercard-visa/",
        "site": "pymnts.com",
        "time": 1747259773000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "A group of trade associations representing European retailers reportedly asked the European Commission to take action against Mastercard and Visa under European Union antitrust rules, alleging that the companies charge high fees and don’t provide transparency on those fees. In a letter dated Tuesday (May 13) and addressed to the commission’s antitrust chief, financial services […] The post Report: European Retailers Seek Antitrust Case Against Mastercard and Visa appeared first on PYMNTS.com. A group of trade associations representing European retailers reportedly asked the European Commission to take action against Mastercard and Visa under European Union antitrust rules, alleging that the companies charge high fees and don’t provide transparency on those fees. In a letter dated Tuesday (May 13) and addressed to the commission’s antitrust chief, financial services commissioner and economy chief, the associations also called for price controls on interchange fees, transparency and non-discriminatory obligations for International Card Schemes (ICSs), and a tool for regulators to scrutinize ICSs’ actions, Reuters reported Wednesday (May 14), citing a copy of the letter. “International Card Schemes (ICS) have been able to increase their fees without competitive challenge or regulatory scrutiny,” the letter said, per the report. “They have also rendered their system of fees and rules so complex and opaque that players are unable to understand, let alone challenge, what they are paying for and why.” Reached by PYMNTS, a Mastercard spokesperson declined to comment on the report, saying the company had not seen or received the letter. Visa did not immediately reply to PYMNTS’ request for comment. In a statement provided to Reuters, Visa said its fees reflect the value of its services, adding: “This includes extremely high levels of security and fraud prevention, near-perfect operational resilience and reliability, and a wide range of consumer protections and high-quality, innovative products and services that serve consumer and merchant needs.” According to the report, the letter was signed by five lobbying groups: EuroCommerce, Ecommerce Europe, Independent Retail Europe, the European Association of Corporate Treasurers and the European Digital Payments Industry Alliance. The associations did not immediately reply to PYMNTS’ request for comment. Mastercard and Visa process about two-thirds of card payments in the eurozone, and retailers’ complaints in the past have led the EU to investigate alternatives to American payment providers, the report said. It was reported in November that the European Commission launched a probe into whether Mastercard and Visa’s fees are hurting merchants. An antitrust case brought by EU regulators could lead to fines of up to 10% of a company’s global earnings. The post Report: European Retailers Seek Antitrust Case Against Mastercard and Visa appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "3333917250493539943",
        "title": "Why Restaurants Are Moving to OpenTable",
        "url": "https://www.nytimes.com/2025/05/14/dining/opentable-restaurants.html",
        "site": "nytimes.com",
        "time": 1747213243000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "v"
        ],
        "description": "With backing from Visa, the reservations platform is staking its claim on in-demand restaurants and paying them handsomely to jump ship from Resy. In the credit card wars, popular restaurants are being used as cultural currency.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "6396695757541977562",
        "title": "Visa's venture arm takes stake in stablecoin infrastructure startup BVNK",
        "url": "https://seekingalpha.com/news/4443238-visas-venture-arm-takes-stake-in-stablecoin-infrastructure-startup-bvnk",
        "site": "seekingalpha.com",
        "time": 1746632731000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3405388087277167257",
        "title": "Visa Invests in BVNK’s Efforts to Promote Stablecoin Payments",
        "url": "https://www.pymnts.com/cryptocurrency/2025/visa-invests-bvnk-efforts-promote-stablecoin-payments/",
        "site": "pymnts.com",
        "time": 1746538269000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Stabelcoin infrastructure platform BVNK received an investment from Visa. The new capital comes on the heels of a $50 million Series B funding round in December, according to a Tuesday (May 6) press release provided to PYMNTS. The amount of the investment was not disclosed. “We’re proud to support BVNK as they help accelerate global […] The post Visa Invests in BVNK’s Efforts to Promote Stablecoin Payments appeared first on PYMNTS.com. Stabelcoin infrastructure platform BVNK received an investment from Visa. The new capital comes on the heels of a $50 million Series B funding round in December, according to a Tuesday (May 6) press release provided to PYMNTS. The amount of the investment was not disclosed. “We’re proud to support BVNK as they help accelerate global adoption of stablecoin payments,” Rubail Birwadker, head of growth products and partnerships at Visa, said in the release. “Stablecoins are fast becoming a part of global payment flows, and Visa invests in new technologies and builders like BVNK, staying at the forefront of what’s next in commerce to better serve our clients and partners.” Stablecoins are being adopted rapidly, the release said. There was $27 trillion in total stablecoin transaction volume globally across 1.25 billion transactions in 2024, per Visa Onchain Analytics. BVNK processes more than $12 billion annually for companies like Ferrari and Rapyd. “We’re experiencing a once-in-a-generation shift to a new foundational payment technology, powered by stablecoins,” BVNK co-founder and CEO Jesse Hemson Struthers said in the release. “At BVNK, we’re building the infrastructure to make these new rails accessible to businesses, empowering them to operate at the speed of today’s economy.” Stablecoins allow for fast, borderless transfers of value minus the friction of traditional banking rails. Someone who wants to move money from a trading desk in Singapore to one in London during a weekend can make the transaction in minutes using stablecoins. “This isn’t about replacing existing systems. It’s about providing an additional option,” FV Bank CEO Miles Paschini told PYMNTS in January. “Where stablecoins offer superior benefits, customers will naturally gravitate toward them.” As banks increasingly integrate blockchain capabilities, customers will have more choice in transferring value, he said. “However, regulation is fragmented,” PYMNTS wrote Wednesday (April 30). “The Federal Reserve’s latest stability report calls out nonbank firms, private credit and stablecoins as increasing sources of risk to the traditional banking ecosystem and potential triggers for financial shocks and runs.” At the time of its Series B round in December, BVNK, headquartered in London, announced its expansion to the United States, opening offices in San Francisco and New York. In March, the company debuted what it called the first embedded wallet unifying fiat and stablecoins globally. The single platform allows direct access to blockchains and payment systems like Swift and ACH. The post Visa Invests in BVNK’s Efforts to Promote Stablecoin Payments appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4794373088293664102",
        "title": "Visa launches ‘Intelligent Commerce’ platform, letting AI agents swipe your card—safely, it says",
        "url": "https://venturebeat.com/ai/visa-launches-intelligent-commerce-platform-letting-ai-agents-swipe-your-card-safely-it-says/",
        "site": "venturebeat.com",
        "time": 1746468077000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa launches Intelligent Commerce platform enabling AI assistants to make secure purchases with your credit card, transforming online shopping with personalized automation and consumer-controlled spending limits. Visa launches Intelligent Commerce platform enabling AI assistants to make secure purchases with your credit card, transforming online shopping with personalized automation and consumer-controlled spending limits.Read More",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6000218806576075194",
        "title": "Mastercard And Visa Unleash AI Agents To Shop For You",
        "url": "https://www.forbes.com/sites/torconstantino/2025/05/05/mastercard-and-visa-unleash-ai-agents-to-shop-for-you/",
        "site": "forbes.com",
        "time": 1746446400000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "v"
        ],
        "description": "Mastercard and Visa debut AI agents that can research, recommend and pay for purchases — ushering in a new era of autonomous shopping and agentic commerce. Mastercard and Visa debut AI agents that can research, recommend and pay for purchases — ushering in a new era of autonomous shopping and agentic commerce.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "2093084462685007653",
        "title": "Visa, Mastercard, PayPal Fuel Agentic AI Commerce Boom",
        "url": "https://www.pymnts.com/news/artificial-intelligence/2025/visa-mastercard-paypal-fuel-agentic-ai-commerce-boom/",
        "site": "pymnts.com",
        "time": 1746207394000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Three of the world’s largest payment companies, Visa, Mastercard and PayPal, are racing into the next frontier in digital commerce: agentic AI. This week, all three announced they were deploying agentic commerce, a fast-emerging trend in which AI agents not only assist consumers with shopping but also complete transactions on their behalf. “These technologies have […] The post Visa, Mastercard, PayPal Fuel Agentic AI Commerce Boom appeared first on PYMNTS.com. Three of the world’s largest payment companies, Visa, Mastercard and PayPal, are racing into the next frontier in digital commerce: agentic AI. This week, all three announced they were deploying agentic commerce, a fast-emerging trend in which AI agents not only assist consumers with shopping but also complete transactions on their behalf. “These technologies have the potential to radically transform commerce, to radically transform how we all shop, how we all buy, and how commerce works at its most fundamental layers,” said Visa CEO Ryan McInerney at a livestreamed company product unveiling. Agentic commerce will be rolling out in the next few quarters, McInerney said in a separate interview with Bloomberg TV. Visa is working with Anthropic, Microsoft, Mistral, OpenAI, Perplexity and others to integrate payment capabilities into AI chatbots. When people use AI chatbots to shop, they will also be able to use AI agents to pay for purchases — something not possible yet. Absent were eCommerce giant Amazon and Google, whose core search business risks eroding from AI chatbots’ popularity. The three companies’ agentic commerce initiatives are: Visa Intelligent Commerce is a platform built to support AI agents in executing trusted, tokenized transactions globally. Mastercard’s Agent Pay replaces payment information with digital tokens for security. Consumers can set parameters under which the AI agent is allowed to make purchases. PayPal Agent Toolkit enables developers to integrate its payment processes into the agentic AI workflow. At the heart of Visa and Mastercard’s agentic commerce capabilities is the idea of tokenization, creating a new 16-digit series of numbers — or a cryptographically protected token — linked to the consumer’s original card and giving it to the AI agent to use. It’s like giving the AI agent its own credit card but with strict, parental-style controls. Consumers decide when to activate it, what the agent can buy and how much it can spend. It only works for that AI agent. According to the PYMNTS Intelligence report “Why Network Tokenization is eCommerce’s Newest Essential,” network tokens, provisioned by the major payment card networks in partnership with issuing banks, enable merchants to protect sensitive card payment information while reducing costs and boosting sales. PayPal’s approach is different. It offers a developer toolkit and access tokens that let AI agents interact directly with PayPal’s platform through APIs. APIs are pieces of code that let software programs quickly integrate a capability, like plug and play. A Profound Shift in Payments “The rise of agentic commerce represents a seismic shift in digital retail, following the waves of eCommerce and mobile, with profound implications for consumers, retailers and financial institutions,” Jerry Sheldon, an analyst at IHL, told PYMNTS. Martin Balaam, CEO of Pimberly, which curates product data for retailers, manufacturers and distributors, said agentic commerce is revolutionary. “It’s a chance to meet customers right at the moment of intent — no more hoping they click through a catalog or keyword ad,” Balaam told PYMNTS. “AI can surface exactly the right SKU based on a nuanced request,” such as, “Show me eco-friendly running shoes under $100.” “Search as we know it will inevitably give way to intent understanding,” Balaam said. “Instead of 10 blue links, shoppers will get a curated set of product suggestions, comparisons and even proactive deals based on their profile and behavior.” That also means retailers must optimize for this new landscape to ensure that consumers are directed to their products, Neil Saunders, managing director and retail analyst at GlobalData, told PYMNTS. Winners will be those retailers that feed the AI agent the right data, such as “real-time inventory, pricing, product and purchasing” information so they show up in the AI agent’s recommendations,” Sheldon said. Those who don’t risk losing out. AI agents can better match consumers to what they want, so this could “significantly” reduce returns, he said. The Way to Scale For consumers, an AI agent acts as a concierge that can plan, shop and pay for them, saving them time and effort. But to get them to engage in the technology, gaining their trust is paramount. “Agentic commerce is poised to redefine convenience and efficiency in retail, but its success will depend on building trust, ensuring transparency, and working hand-in-hand with regulators to protect consumers,” Sheldon said. According to Saunders, “People will be very comfortable with allowing agents to do things like searching for the best options, finding the best prices, and even arranging delivery and so forth. When comes to payment, he said, “consumers like to remain in control, and payment companies need to ensure that this is put in place along with safeguards.” Sheldon said the following features are needed to scale agentic commerce. Reliable trust layer: Payment networks building the trust infrastructure for agentic commerce must include robust agent verification, real-time behavioral monitoring, and clear audit trails to ensure accountability and prevent unauthorized activity. Transparent boundaries: Consumers need clear visibility into what’s automated versus what requires human approval. Explainable decisions: When an AI chooses brand X over brand Y, consumers will want to understand the decision factors — price, quality, brand reputation, sustainability, delivery speed and the like. Payment providers must work with retailers to standardize this data disclosure. Failsafe recourse: Real-time cancellation protocols and robust dispute resolution will be essential for consumer confidence. For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. The post Visa, Mastercard, PayPal Fuel Agentic AI Commerce Boom appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "7468041131039355486",
        "title": "This Week in AI: Visa, Mastercard and PayPal Go All in on Agentic Commerce",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/this-week-in-ai-visa-mastercard-and-paypal-go-all-in-on-agentic-commerce/",
        "site": "pymnts.com",
        "time": 1746205603000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "2093084462685007653"
        ],
        "description": "This week brings fresh news on the digital payments front, with Visa, Mastercard and PayPal unveiling their agentic commerce programs. Their moves represent a significant shift to the payments landscape, fueled by agentic artificial intelligence (AI) systems that can pay on behalf of consumers. Also this week, a PYMNTS Intelligence report showed that 90% of […] The post This Week in AI: Visa, Mastercard and PayPal Go All in on Agentic Commerce appeared first on PYMNTS.com. This week brings fresh news on the digital payments front, with Visa, Mastercard and PayPal unveiling their agentic commerce programs. Their moves represent a significant shift to the payments landscape, fueled by agentic artificial intelligence (AI) systems that can pay on behalf of consumers. Also this week, a PYMNTS Intelligence report showed that 90% of health care executives are seeing positive ROI for generative AI, which is fueling their GenAI investments for the future. Finally, Apple said it needs more time to upgrade Siri and warned of a Q3 tariff hit. Visa Launches ‘Visa Intelligent Commerce’ Visa introduced an agentic AI system that would equip AI agents with the ability to pay for purchases and bookings on behalf of consumers, not just shop for them. Called “Visa Intelligent Commerce,” the program opens the network’s rails to developers building AI agents that search, recommend and make payments using special cards that link back to the user’s original card. People have been increasingly using AI chatbots to shop and plan for things like vacation travel, according to Visa. But the missing link has been a payment mechanism, until now. “This is going to transform shopping and buying — we’re letting AI developers and engineers use the Visa network to allow AI agents to find, and buy, on [the consumer’s] behalf in a seamless and safe way,” Mark Nelsen, Visa’s global head of consumer products, told PYMNTS’ Karen Webster. Read more: Visa Gives AI Shopping Agents ‘Intelligent Commerce’ Superpowers Mastercard Introduces ‘Agent Pay’ Mastercard has launched an agentic AI-driven payments program called “Agent Pay.” The new offering uses Mastercard’s Agentic Tokens, which the company said builds upon tokenization capabilities that power global commerce solutions like mobile contactless payments. Mastercard is working with Microsoft and IBM on this technology, with other AI leaders to follow. The company will also work with checkout players like Braintree and Checkout.com to enhance tokenization capabilities. “This helps unlock an agentic commerce future where consumers and businesses can transact with trust, security, and control,” the company said in a news release. See also: Mastercard Debuts Agent Pay to Promote ‘Agentic Commerce Future’ PayPal Explores Agentic Commerce PayPal introduced the PayPal Agent Toolkit, which enables developers to integrate its payment processes into the agentic AI workflow. The company offers a developer toolkit and access tokens that let AI agents interact directly with PayPal’s platform through application programming interfaces (APIs). “The future is here,” PayPal CEO Alex Chriss said in this week’s earnings call. “Now any business can create agentic experiences that allow customers to pay, track shipments, manage invoices and more, all powered by PayPal and all within an AI client.” More here: PayPal Details Agentic Commerce Initiatives and Strategic Focus on Value-Added Services GenAI Use in Healthcare Brings Positive ROI According to recent research from PYMNTS Intelligence, the healthcare sector is bullish about GenAI, and most have already deployed the technology in key areas like product innovation and customer service. The report polled C-suite executives at healthcare companies generating at least $1 billion in annual revenue. Companies are both seeing and expecting positive ROI, which fuels future plans for additional investments in the technology. The report also showed that 59% of healthcare executives said they would increase their GenAI investment in the next year, a figure higher than the 52% cross-industry average. Related: 90% of Healthcare Execs Already See Positive ROI From GenAI Investments Apple Warns of $900 Million Tariff Hit Apple CEO Tim Cook is asking consumers to be patient since the company needs “more time” to upgrade Siri up to the standards set by competitors like Amazon’s Alexa and voice-enabled AI chatbots. “We need more time to complete our work on these features so they meet our high-quality bar,” Cook said during Apple’s earnings call with analysts. “We are making progress, and we look forward to getting these features into customers’ hands.” Cook also said that Apple expects to see a $900 million increase in costs due to tariffs during its fiscal third quarter, basing that number on current tariff policy. “We estimate the impact, assuming that the current global tariff rates, policies and applications don’t change for the balance of the quarter, to be $900 million to our cost,” Cook said. Cook also disputed the rebuke from a federal judge who said this week that Apple was in “willful violation” of a 2021 injunction related to the Epic Games lawsuit. The court had ordered Apple to let developers find a way to get paid by users without going through the Apple App Store, to avoid Apple’s 30% fee. The judge said Apple then assessed a 27% fee for outside sales. Cook said Apple disagrees with the ruling and will appeal. See also: Apple Needs ‘Time’ to Upgrade Siri; Services Revenue Dampened by Cost Hikes The post This Week in AI: Visa, Mastercard and PayPal Go All in on Agentic Commerce appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "2757273424096035995",
        "title": "Rain Joins Visa’s Pilot Program for Stablecoin Settlement",
        "url": "https://www.pymnts.com/cryptocurrency/2025/rain-joins-visa-pilot-program-stablecoin-settlement/",
        "site": "pymnts.com",
        "time": 1746119384000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Rain, a global card-issuing platform built for stablecoins, joined Visa’s pilot program for stablecoin settlement. By fully tokenizing its credit card receivables and transitioning all settlement transactions for its Visa cards to USDC, Rain can now settle with Visa seven days a week, 365 days a year, the companies said in a Thursday (May 1) […] The post Rain Joins Visa’s Pilot Program for Stablecoin Settlement appeared first on PYMNTS.com. Rain, a global card-issuing platform built for stablecoins, joined Visa’s pilot program for stablecoin settlement. By fully tokenizing its credit card receivables and transitioning all settlement transactions for its Visa cards to USDC, Rain can now settle with Visa seven days a week, 365 days a year, the companies said in a Thursday (May 1) press release. The capability enhances Rain’s ability to help its partners — FinTechs and wallets — meet the growing demand for real-time global payments by issuing and using on-chain cards and settling in stablecoins, according to the release. Rain provides the back-end infrastructure that enables these partners to build and launch stablecoin-linked card programs, per the release. “By participating in Visa’s USDC settlement program, we are now able to conduct settlement seven days a week, 365 days a year, operating outside of traditional banking hours,” Rain CEO and co-founder Farooq Malik said in the release. “USDC settlement allows us to be more capital efficient — helping to reduce the need for collateral while providing our counterparties the same level of protection.” Rubail Birwadker, head of growth products and partnerships at Visa, said in the release that blockchain technology and stablecoins are reducing the complexity of moving money across borders. “Our work with Rain to help bring payments on-chain and enable seven-day settlement is a big step toward helping to simplify global payments,” Birwadker said. Visa said in September 2023 that it was conducting pilot programs to test the movement of millions of USDC stablecoins between its partners over the Solana and Ethereum blockchain networks. The company said that by using stablecoins like USDC and global blockchain networks like Solana and Ethereum, it aimed to improve the speed of cross-border settlement and provide a modern option for clients to easily send or receive money from Visa’s treasury. On Wednesday (April 30), Visa said it partnered with Bridge — a stablecoin orchestration platform owned by Stripe — to launch a card-issuing product that enables cardholders to use their stablecoin balance to make purchases at any merchant location that accepts Visa. It launched this offering in six countries in Latin America and plans to expand it to Europe, Africa and Asia in the coming months. The post Rain Joins Visa’s Pilot Program for Stablecoin Settlement appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "9049480358334976831",
        "title": "World partners with Tinder, Visa to bring its ID-verifying tech to more places",
        "url": "https://techcrunch.com/2025/04/30/world-partners-with-tinder-visa-to-bring-its-id-verifying-tech-to-more-places/",
        "site": "techcrunch.com",
        "time": 1746065400000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "v"
        ],
        "description": "World, the biometric ID company best known for its eyeball-scanning Orb devices, at an event late on Wednesday announced several partnerships aimed at driving sign-ups and demonstrating the applications of its tech. World is partnering with Match Group, the dating app conglomerate, to verify the IDs of Tinder users in Japan. Via collaborations with Kalshi […]",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3810304533211707115",
        "title": "Visa and Bridge Partner to Enable Stablecoin-Linked Cards",
        "url": "https://www.pymnts.com/cryptocurrency/2025/visa-and-bridge-partner-to-enable-stablecoin-linked-cards/",
        "site": "pymnts.com",
        "time": 1746053572000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa and Bridge have partnered to launch a card-issuing product that enables cardholders to use their stablecoin balance to make purchases at any merchant location that accepts Visa. With this collaboration, FinTech developers using Bridge — a stablecoin orchestration platform owned by Stripe — can offer stablecoin-linked Visa cards to their end customers, the companies […] The post Visa and Bridge Partner to Enable Stablecoin-Linked Cards appeared first on PYMNTS.com. Visa and Bridge have partnered to launch a card-issuing product that enables cardholders to use their stablecoin balance to make purchases at any merchant location that accepts Visa. With this collaboration, FinTech developers using Bridge — a stablecoin orchestration platform owned by Stripe — can offer stablecoin-linked Visa cards to their end customers, the companies said in a Wednesday (April 30) press release. This offering now enables the issuing of these card programs in six countries in Latin America: Argentina, Colombia, Ecuador, Mexico, Peru and Chile, according to the release. It will be expanded to countries in Europe, Africa and Asia in the coming months. “We’re focused on integrating stablecoins into Visa’s existing network and products in a frictionless and secure way,” Visa Chief Product and Strategy Officer Jack Forestell said in the release. “Partnering with Bridge represents a significant move in helping to make stablecoins useable in everyday life, giving consumers more choice in how they manage and spend their money.” Bridge CEO and Co-Founder Zach Abrams said in the release that this collaboration will enable anyone to use stablecoins with just a tap of the card with which they are already familiar. “This is a massive unlock for developers who can now build truly scalable issuing products for their users,” Abrams said. Abrams and Stripe CEO Patrick Collison announced Oct. 21 that Stripe planned to acquire Bridge. Collison said at the time that the move was part of Stripe’s plan to “build the world’s best stablecoin infrastructure,” while Abrams said the acquisition would enable Bridge and Stripe to “solve bigger problems, support more developers and help more consumers and businesses all across the world.” Stripe completed the acquisition in February. Visa CEO Ryan McInerney said Tuesday (April 29) that stablecoins are an area of promise due to their capabilities around interoperability and programmability. “We have continued to expand our interoperability, including with our first seven-day-a-week stablecoin settlement, recently surpassing $200 million in cumulative stablecoin settlement volume,” McInerney said during the company’s quarterly earnings call. Mastercard said Monday (April 28) that it partnered with two more companies — OKX and Nuvei — to further its efforts to power stablecoin transactions for consumers and merchants. The post Visa and Bridge Partner to Enable Stablecoin-Linked Cards appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-1129087183085953096",
        "title": "Visa and Mastercard unveil AI-powered shopping",
        "url": "https://techcrunch.com/2025/04/30/visa-and-mastercard-unveil-ai-powered-shopping/?.tsrc=rss",
        "site": "techcrunch.com",
        "time": 1746049231000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "v"
        ],
        "description": "Artificial intelligence is not just infiltrating the startup world. Now credit card giants Visa and Mastercard are getting into the AI game. Visa announced on Wednesday “Intelligent Commerce,” which it says enables AI “to find and buy.” AI agents will be able to shop and make purchases on behalf of consumers, based on preselected preferences. In a statement, Visa chief product and strategy officer Jack Forestell said: “Each consumer sets the limits, and Visa helps manage the rest.” Visa says tha",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "6860970658183448250",
        "title": "Bloomberg Talks: Ryan McInerney (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-30/bloomberg-talks-ryan-mcinerney-podcast",
        "site": "bloomberg.com",
        "time": 1746041845000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "Source: Bloomberg, 8:31",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "2267121258745956686",
        "title": "Visa partners with Stripe's Bridge to help fintechs launch their own stablecoin-linked card programs in multiple countries at once, starting in Latin America (Emily Mason/Bloomberg)",
        "url": "http://www.techmeme.com/250430/p35#a250430p35",
        "site": "techmeme.com",
        "time": 1746040501000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "v"
        ],
        "description": "Emily Mason / Bloomberg: Visa partners with Stripe's Bridge to help fintechs launch their own stablecoin-linked card programs in multiple countries at once, starting in Latin America — The platform will allow developers to launch card programs in multiple countries at once, starting with Argentina, Colombia …",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6444593340591419718",
        "title": "Visa announces Visa Intelligent Commerce, opening its payment network to developers building AI agents to find and buy products for users (Sabrina Ortiz/ZDNET)",
        "url": "http://www.techmeme.com/250430/p34#a250430p34",
        "site": "techmeme.com",
        "time": 1746039900000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "v"
        ],
        "description": "Sabrina Ortiz / ZDNET: Visa announces Visa Intelligent Commerce, opening its payment network to developers building AI agents to find and buy products for users — AI has transformed everyday tasks such as writing, coding — even shopping. Now, Visa is introducing an initiative to prepare its payment network …",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6322798884067468639",
        "title": "Visa Launches AI Agents for Shopping",
        "url": "https://www.bloomberg.com/news/videos/2025-04-30/visa-launches-ai-agents-for-shopping-video",
        "site": "bloomberg.com",
        "time": 1746036633000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa announced that it is allowing customers to use AI platforms to make purchases and is collaborating with Anthropic, Microsoft Corp, OpenAI and other AI firms on the product launch. Visa CEO Ryan McInerney speaks with Bloomberg Technology's Caroline Hyde about how the company is enabling AI agents to help customers save time on finding and paying for the ideal item or service online. (Source: Bloomberg)",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6719960604053247307",
        "title": "Visa’s new tech lets AI shop—and pay—for you",
        "url": "https://www.fastcompany.com/91326008/visas-new-tech-lets-ai-shop-and-pay-for-you",
        "site": "fastcompany.com",
        "time": 1746036120000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "v"
        ],
        "description": "Are you ready to hand over your wallet to AI and let it do your shopping for you? Maybe not—but the technology to do it is hitting the market. On Wednesday, Visa announced Visa Intelligent Commerce, which effectively allows AI agents to find and buy goods or services on behalf of consumers. While Visa itself doesn’t create the AI agents, what it’s done is create the e-commerce backbone to allow it to happen. Consumers could use AI tools to track down potential purchases, but then those platforms would hand control back over to the human to complete the transaction. The big change with Visa’s technology is that, with the proper permissions enabled, AI agents can complete the purchase without going back to their human handler. The value-add, Visa’s Chief Product and Strategy Officer Jack Forestell tells Fast Company, is that it “frees up the cognitive load and time, delivering massively better outcomes, and more value—it’s going to deliver better shopping experiences.” For example, a shopper can now request that an AI agent buy a bouquet for their mom as a Mother’s Day gift, and the entire process requires little, if any additional input from the shopper. The AI may be able to find the particular flowers the consumer’s mother likes, at a desired price point, and have them delivered on or before Mother’s Day. The shopper can breathe easy, and not put too much thought or effort into the transaction—something that their mother’s probably wouldn’t want to know. As for the tech itself, Forestell says that getting AI agents set up to make payments involves “getting a payment card credential to an agent,” which he says is “tech that’s similar to Apple Pay or Google Pay—the agent gets a token that can only be used by that agent.” From there, and from Visa’s standpoint, two things need to occur: Visa needs to get a “buy signal” from a merchant that indicates an agent is making a purchase, and “the confirmation” that the transaction has completed. While there will be some lag between users adopting agentic payments en masse, as merchants, consumers, and financial institutions learn to trust them and use them efficiently. But Forestell says “APIs will be available on Wednesday,” so people and companies can begin to work with the technology.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-1413830338066357024",
        "title": "Visa Powers AI Shopping Agents With ‘Intelligent Commerce’ Payment Rails",
        "url": "https://www.pymnts.com/visa/2025/visa-powers-ai-shopping-agents-with-intelligent-commerce-payment-rails/",
        "site": "pymnts.com",
        "time": 1746036050000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "4794373088293664102",
            "-6000218806576075194",
            "-6444593340591419718"
        ],
        "description": "Visa wants the next wave of agentic artificial intelligence (AI) to do more than curate a dream vacation or the perfect outfit to wear for it. It wants it to pick up the tab. Unveiled Wednesday (April 30) at the company’s Global Product Drop, the Visa Intelligent Commerce program opens the network’s rails to developers […] The post Visa Powers AI Shopping Agents With ‘Intelligent Commerce’ Payment Rails appeared first on PYMNTS.com. Visa wants the next wave of agentic artificial intelligence (AI) to do more than curate a dream vacation or the perfect outfit to wear for it. It wants it to pick up the tab. Unveiled Wednesday (April 30) at the company’s Global Product Drop, the Visa Intelligent Commerce program opens the network’s rails to developers building AI agents that search, recommend and now pay on behalf of consumers. The stakes are considerable. Generative AI (GenAI) platforms are influencing what people buy. The missing link is a payment mechanism that is both invisible to consumers and accepted, quite literally, by merchants. “This is going to transform shopping and buying — we’re letting AI developers and engineers use the Visa network to allow AI agents to find, and buy, on [the consumer’s] behalf in a seamless and safe way,” Mark Nelsen, Visa’s global head of consumer products, told PYMNTS’ Karen Webster on the eve of the announcement. At the center of the effort is an AI-ready card, a credential developers can spin up through a bundle of Visa application programming interfaces (APIs). As Nelsen put it: “The APIs will have an AI-ready card. In a hypothetical search for the cheapest flight to Cancún, for example, a traveler uploads an existing Visa credential, while in the background Visa authenticates the cardholder with payment passkeys, tokenizes the 16-digit number and seats the token inside the AI agent.” That behind-the-scenes swap shields account data, eliminating the clunky step of keying in card numbers every time the agent hops to a new site. It also takes card-on-file commerce to an entirely new, contextually powered ecosystem, allowing consumers to leave their physical and digital wallets at home. Five Building Blocks Nelsen walked through an inventory of five modules that developers can cherry-pick or adopt wholesale. Modules, he said, are built on three decades of Visa’s work in using AI to fight fraud. Visa says its AI engines blocked roughly $40 billion in fraud last year. Visa Intelligent Commerce imports the same models into agent-driven transactions. Authentication: Confirms the AI agent is authorized to act for a specific consumer, extending identity verification to AI commerce. Tokenization: Replaces card data with network tokens that work anywhere Visa is accepted while keeping sensitive details under wraps. Payment Instructions: Lets the user preset dollar limits, merchant categories or real-time approval prompts — guardrails that load directly into VisaNet. Personalization: With the shopper’s consent, the module shares basic spend patterns so the agent can rank offers by preferred airline, hotel-price comfort zone or dining habits. Signals: Streams transaction signals back to Visa in real time to trigger risk controls and aid dispute resolution. Nelsen emphasized that, together, the tools aim to make AI-powered buying as routine and secure as tapping a phone at checkout. Personalization Power But here’s where it can get interesting and where AI agents and AI cards can simplify the complexity of shopping. GenAI chatbots can already present a short list of hiking boots or boutique hotels. What they can’t yet do is close the sale without punting the consumer to a checkout page. Or in the case of a complex search that asks for the most stylish hiking boots for the summer trip to Cinque Terre, and what restaurants are best to watch the sunset, there are multiple searches, steps and a big gap from information and intent to purchase. That gap, Nelsen argued, is where cart abandonment and lost revenue lurk. “We ask the consumer … whether they would like to share information around their spend behavior with the agent so that it knows their preferences, such as the airline you prefer and the typical amount of money that you spend on hotels. ‘Where do you like to go for dinner?’” he said. “That’s personalization.” Once a shopper sets, for instance, a $500 ceiling for a hotel or an airline ticket, the AI agent scours sites, picks seats or rooms and pays, constrained by the limits embedded in the token created by the AI card. “[Visa] verifies your instruction,” Nelsen said, “and loads that instruction into VisaNet, and the agent will work on their behalf. … If everything matches, we’ll send the transaction to the issuing bank to be approved.” Nelsen said that a consumer has all the security, control and protections in place that come with using their Visa card, even though it is the AI agent that is “making” the transaction. The same tokenization that reassures consumers also signals to merchants that the purchase request is legitimate, not a bot fraudster. Users can require the AI agent to ping them for approval above a certain spend, or to pause before purchasing from unfamiliar sellers. Speed to Market Unlike fledgling AI startups, Visa doesn’t have to lay new rails. Its tokenization framework already covers more than 200 countries and territories, and the Intelligent Commerce APIs are live now for partners ranging from Anthropic and OpenAI to Microsoft, Samsung and Stripe. “Any Visa credential can work,” Nelsen said, because the underlying technology has been field-tested for years. That global footprint means an AI agent could book a table at an impossible-to-get-into Manhattan restaurant — or a last-minute villa on Italy’s Lake Como — without exposing card data or tripping fraud filters. Merchants, bruised by fraud losses and rising customer-acquisition costs, want conversions. Consumer want friction-free checkout. And regulators want proof that AI won’t introduce new risk. Visa’s bet is that sliding its fraud models and dispute-resolution tools under the hood will let all three constituencies adopt AI commerce faster. “It’s not only safe for the consumers,” Nelsen said. “It’s safe for the whole ecosystem, for the banks and the merchants as well. We’re excited about what the program will enable.” And, he added, “search used to be simple, and then it got complicated — now we can make it personalized and simple at the same time.” Visa isn’t predicting how quickly consumers will surrender purchase decisions to software agents, but it is positioning itself as the payments backbone when they do. By turning card numbers into tokens, layering on spend controls and piping in real-time fraud defenses, Intelligent Commerce tries to ensure the AI agent economy is born with same adult-grade security that exists in the digital and mobile ecosystems today. Developers can start coding today. Pilots are expected to surface in the coming months. If the model sticks, shopping bots could soon move from novelty to necessity, with Visa swiping the AI-powered card. The post Visa Powers AI Shopping Agents With ‘Intelligent Commerce’ Payment Rails appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6149094004191776016",
        "title": "Visa CEO Says AI Shopping to Push Advertising, Payments to Adapt",
        "url": "https://www.bloomberg.com/news/articles/2025-04-30/visa-ceo-says-ai-shopping-to-push-advertising-payments-to-adapt",
        "site": "bloomberg.com",
        "time": 1746036000000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa Inc. Chief Executive Officer Ryan McInerney said advertising will be forced to evolve as shoppers turn to artificial intelligence agents to help them browse products and make purchases. Ryan McInerney, chief executive officer of Visa.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "7897898095844632430",
        "title": "Visa and Stripe’s Bridge Partner to Streamline Stablecoin Cards",
        "url": "https://www.bloomberg.com/news/articles/2025-04-30/visa-and-stripe-s-bridge-partner-to-streamline-stablecoin-cards",
        "site": "bloomberg.com",
        "time": 1746036000000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "-3435257424670994882",
            "-3810304533211707115",
            "2267121258745956686"
        ],
        "description": "Visa Inc. is partnering with Stripe Inc.’s Bridge to launch a platform allowing fintechs to quickly start their own stablecoin-linked card programs for customers. Visa cards arranged in New York, US, on Thursday, Sept. 26, 2024. The US Justice Department sued Visa Inc., alleging the global payments giant illegally monopolized the debit card market, in the Biden administration’s first major antitrust case in the financial services industry. Photographer: Gabby Jones/Bloomberg",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-4116714879584704973",
        "title": "Visa outlines plans for 2025 growth with $30B share repurchase program",
        "url": "https://seekingalpha.com/news/4437522-visa-outlines-plans-for-2025-growth-with-30b-share-repurchase-program",
        "site": "seekingalpha.com",
        "time": 1745973760000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4884611022535208726",
        "title": "Visa’s earnings send the message that spending is still healthy",
        "url": "https://www.marketwatch.com/story/visas-earnings-send-the-message-that-spending-is-still-healthy-b815d015?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1745973600000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "v"
        ],
        "description": "Spending growth has been strongest among the affluent, but Visa has seen resilient trends overall.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3511628224955786118",
        "title": "Visa: Tap to Pay Tops 76% of Face-to-Face Transactions Globally",
        "url": "https://www.pymnts.com/visa/2025/visa-tap-to-pay-tops-76-percent-of-face-to-face-transactions-globally/",
        "site": "pymnts.com",
        "time": 1745972475000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa’s fiscal second quarter results underscored the continued displacement of cash in face-to-face commerce, the widening embrace of tap-to-pay technologies and rising commercial volumes — and notably, there’s been no consumer spending slowdown, according to management commentary on the earnings call Tuesday (April 29). Supplemental materials revealed that U.S. payments volume grew 6% and international […] The post Visa: Tap to Pay Tops 76% of Face-to-Face Transactions Globally appeared first on PYMNTS.com. Visa’s fiscal second quarter results underscored the continued displacement of cash in face-to-face commerce, the widening embrace of tap-to-pay technologies and rising commercial volumes — and notably, there’s been no consumer spending slowdown, according to management commentary on the earnings call Tuesday (April 29). Supplemental materials revealed that U.S. payments volume grew 6% and international payments volume grew 9%. Cross-border volume, excluding intra Europe, rose 13% in constant dollars. Within the U.S., debit volumes were up 9% (in constant dollar terms) outpacing credit volumes of 4%. Ryan McInerney, CEO, said on the conference call with analysts that total credentials were up 7%, and the firm added 1 billion tokens to 13.7 billion. “Nearly 50% of our eCommerce transactions, globally, are tokenized,” he said. Tap to Everything and Stablecoins Visa’s “tap to everything” strategy continues to bear fruit, McInerney said, adding that tap to phone added 2 million transacting device terminals since the last quarter. Tap to Pay penetration is at 76% globally, he said, with the U.S. passing 60% for the first time. McInerney also pointed to stablecoins as an area of promise as “two important capabilities are interoperability and programmability. We have continued to expand our interoperability, including with our first seven day a week stablecoin settlement, recently surpassing $200 million in cumulative stablecoin settlement volume,” he said. Commercial volumes were up 6% in constant dollars, with Visa Direct transactions up 28% to 3 billion transactions. “To capture the accounts receivable and accounts payable opportunity, we are utilizing product innovations such as embedded finance solutions to meet payers where they manage their business to drive adoption of cards,” McInerney said. Value-added services revenues were up 22%. Consumer Resilience McInerney said that “halfway through our fiscal year, consumer spending has been resilient and strong, but there is much uncertainty. Focusing on the U.S., in Q2 and through April 21, we have not seen any signs of overall consumer spending weakening. While spending growth differs among consumer spend bands, with the most affluent growing the fastest, all spend bands remain resilient and consistent with past quarters.” He noted that some spending categories such as travel and lodging have seen some deceleration of growth, “but overall discretionary and nondiscretionary spend remains strong.” Asked later in the call about consumer behavior, CFO Chris Suh said, “Here was some evidence of pull forward in certain categories. Electronics is one of them, and it was mostly in … the first part of April.” Suh said on the call that in the U.S., eCommerce spending grew faster than face-to-face spend. He added that “restaurant growth remained stable and retail and fuel growth improved with strong and stable total discretionary and nondiscretionary spend growth, reflecting resilience in consumer spending.” In terms of cross-border volumes, eCommerce spending was up 14% and travel spending grew by 12%. Looking ahead and for guidance, Suh said, “The potential impacts from tariffs have led to higher levels of economic uncertainty. That being said, what we’ve seen thus far in our results is relative resilience in consumer spending.” Cross-border volumes are projected to be in range of the March and April averages, while overall net revenues will be in the low double digits, in line with the fiscal second quarter. “While we are certainly not immune to macroeconomic impacts, our incredibly diverse business model has proven to be resilient in the face of a variety of environments,” McInerney maintained. Visa’s shares were up about 0.7% in after-hours trading on Tuesday. The post Visa: Tap to Pay Tops 76% of Face-to-Face Transactions Globally appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-400205370546840003",
        "title": "Visa Earnings Top Estimates as Spending on Network Stays Strong",
        "url": "https://www.bloomberg.com/news/articles/2025-04-29/visa-earnings-top-estimates-as-spending-on-network-stays-strong",
        "site": "bloomberg.com",
        "time": 1745957974000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa Inc.’s fiscal second-quarter earnings beat analysts’ estimates as spending on its payment network remained resilient despite macroeconomic uncertainties. A Visa debit card. Photographer: Gabby Jones/Bloomberg",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3809497897949187681",
        "title": "Visa, Mastercard earnings expected to show solid Y/Y growth amid tariff uncertainty",
        "url": "https://seekingalpha.com/news/4436353-visa-mastercard-earnings-expected-to-show-solid-yy-growth-amid-tariff-uncertainty",
        "site": "seekingalpha.com",
        "time": 1745862817000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-7283161912083492285",
        "title": "Visa’s Earnings Could Impress, But Tariff Risks Loom Large",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/28/visas-earnings-could-impress-but-tariff-risks-loom-large/",
        "site": "forbes.com",
        "time": 1745830800000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa (NYSE:V) is scheduled to announce its earnings on April 29. According to consensus estimates, revenues are anticipated to increase by roughly 9% compared... Visa (NYSE:V) is scheduled to announce its earnings on April 29. According to consensus estimates, revenues are anticipated to increase by roughly 9% compared...",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3558965361130284839",
        "title": "Visa Leverages the Listening Economy to Solve Customer Pain Points",
        "url": "https://www.pymnts.com/opinion/2025/visa-leverages-the-listening-economy-to-solve-customer-pain-points/",
        "site": "pymnts.com",
        "time": 1745827249000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Empathy combined with creativity leads to products that help clients unlock their potential, Visa Global Head of Acceptance Solutions Rob Cameron writes in a new PYMNTS eBook, “The Listening Economy: How Customer Conversations Are Transforming Financial Services.” The world of payments is expanding rapidly, with a massive surge in digitization, artificial intelligence (AI) and […] The post Visa Leverages the Listening Economy to Solve Customer Pain Points appeared first on PYMNTS.com. Empathy combined with creativity leads to products that help clients unlock their potential, Visa Global Head of Acceptance Solutions Rob Cameron writes in a new PYMNTS eBook, “The Listening Economy: How Customer Conversations Are Transforming Financial Services.” The world of payments is expanding rapidly, with a massive surge in digitization, artificial intelligence (AI) and emerging sectors like the creator economy generating immense opportunities to boost growth and profitability. However, the payments industry has also become more complex, which can be daunting. Payments are no longer just about completing a sale — the expectation today is for seamless, digital-first experiences. Our customers see the opportunities but are often challenged to execute given competing priorities and limited budgets. Small businesses, in particular, struggle to keep up with the rapid advancements and the intricacies involved. This puts companies like Visa in a unique position. Everything we do starts with our clients’ needs. We must empathize with customers and see the world from their perspective. Simultaneously, we need vision, creativity and foresight to innovate and build future-proof products. This dual approach helps us create products that help clients unlock their potential. For example: Building Seamless Payments Experiences With new ways to pay entering the scene all the time, merchants need a seamless solution to accept all payment types and avoid losing sales at checkout. Visa’s answer to this customer challenge is a new Unified Checkout Experience. The launch of our next-generation Unified Checkout product streamlines and simplifies the digital payment process for our customers. It can be set up in just a few hours using our “deploy ready” payment acceptance code and integrations to a vast array of software solutions across industries and geographies. With built-in payment orchestration support for a multitude of payment types, it delivers strong eCommerce conversion rates with an intuitive checkout experience. Enhancing Fraud Protection Amid Rising Cost of Fraud Fraud costs billions to the global financial ecosystem each year — and fraudsters are just getting smarter and more determined, reaching unprecedented success rates. In addition, the barrier to entry is getting lower with generative AI. But fraud is just one consideration when acquirers consider the risks associated with any given merchant. Increasingly, merchants are also expecting payouts in real time. A new solution to help with this is the ARIC Risk Hub, which is powered by our recent acquisition of Featurespace. It can help acquirers manage end to end merchant risk, while enabling dynamic settlement. This can help acquirers to ultimately accept more good merchants and get them funded faster. Delivering Actionable Intelligence We deliver actionable intelligence: data insights customers can use to drive profitability. Our reimagined Authorize.net platform, for example, helps businesses analyze data, summarize insights and adapt to rapidly changing customer trends. It was born out of the need to better support small businesses and resellers, ensuring they have the tools and resources they need to succeed. It is an all-in-one solution designed to enable small businesses to deliver next-generation payment experiences without tying up their limited resources. The post Visa Leverages the Listening Economy to Solve Customer Pain Points appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "675545691495868058",
        "title": "Visa Product Design System will empower developers and designers",
        "url": "https://venturebeat.com/gaming-business/visa-product-design-system-will-empower-developers-and-designers/",
        "site": "venturebeat.com",
        "time": 1745452500000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa is one of those giant businesses that spans all commerce, but it has a program today that applies to developers and designers -- including game folks. Visa is one of those giant businesses that spans all commerce, but it has a program today that applies to developers and designers -- including game folks.Read More",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5247604591400098980",
        "title": "Cardlay Joins Visa Ready to Expand Fleet Spend Management Solutions",
        "url": "https://www.pymnts.com/news/b2b-payments/2025/cardlay-joins-visa-ready-expand-fleet-spend-management-solutions/",
        "site": "pymnts.com",
        "time": 1745418161000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Danish FinTech company Cardlay joined the Visa Ready partner program to help businesses manage their fleet expenses with native digital B2B fleet card management and integrated spend management. The collaboration brings together Cardlay’s spend management solution and Visa’s payments infrastructure, enabling fleet operators to consolidate all their fuel and non-fuel-related payments within a single platform, […] The post Cardlay Joins Visa Ready to Expand Fleet Spend Management Solutions appeared first on PYMNTS.com. Danish FinTech company Cardlay joined the Visa Ready partner program to help businesses manage their fleet expenses with native digital B2B fleet card management and integrated spend management. The collaboration brings together Cardlay’s spend management solution and Visa’s payments infrastructure, enabling fleet operators to consolidate all their fuel and non-fuel-related payments within a single platform, the companies said in a Wednesday (April 23) press release. “By combining Cardlay’s modular platform with Visa’s powerful infrastructure, we’re able to empower companies with advanced tools to streamline operations, optimize costs and support sustainable, data-driven growth in the mobility sector,” Cardlay Chief Sales Officer Kasper Guul Laursen said in the release. With the Cardlay spend management module and the Visa Ready for Fleet program, businesses can enforce policies and controls with the help of enhanced data insights and automated data capture; securely issue, distribute and control unrestricted B2B fleet cards; and eliminate the need for multiple cards, according to the release. The solution also includes electric vehicle charging integrations, street parking integrations, loyalty program integrations and CO2/ESG reporting, per the release. Visa Ready provides its technology company partners with a certification program that helps them build and launch payment solutions that meet Visa’s global standards for security and functionality and allows them access to Visa’s product and go-to-market expertise, according to the program’s website. “Visa is at its strongest when we combine our core assets with those of our partners,” Richard Campion, head of fleet and B2B mobility at Visa Europe, said in the Wednesday press release. “Through the Visa Ready for Fleet program, Visa is creating an ecosystem of partners who can deliver a suite of solutions for our fleet and mobility clients.” The new integration expands on a partnership that began in October, when Cardlay said it was working with Visa to improve spend management for commercial card issuers by offering clients “fully embedded” commercial cards and expense management solutions. Visa said in March that it would add tokenization and custom provisioning for mobile transactions to its Fleet cards, enabling issuers and FinTechs to integrate encrypted and tokenized card information into Apple Pay mobile wallets. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Cardlay Joins Visa Ready to Expand Fleet Spend Management Solutions appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-4216303370363366434",
        "title": "Visa Just Opened Access to Its Product Design System; What’s In It for FinTechs",
        "url": "https://www.pymnts.com/visa/2025/visa-just-opened-access-to-its-product-design-system-whats-in-it-for-fintechs/",
        "site": "pymnts.com",
        "time": 1745406001000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "675545691495868058",
            "-8139110138332880144"
        ],
        "description": "Payment innovation needs payments infrastructure, and payments infrastructure needs usability. These are the twin engines of scalability, and design contributes heavily to the user experience (UX) layer. “One of the most difficult things to do is creating exemplary experiences and doing that consistently across a global, regionally diverse product landscape. Visa’s design system helps us […] The post Visa Just Opened Access to Its Product Design System; What’s In It for FinTechs appeared first on PYMNTS.com. Payment innovation needs payments infrastructure, and payments infrastructure needs usability. These are the twin engines of scalability, and design contributes heavily to the user experience (UX) layer. “One of the most difficult things to do is creating exemplary experiences and doing that consistently across a global, regionally diverse product landscape. Visa’s design system helps us do both,” Robb Nielsen, Visa’s senior vice president and global head of design, told PYMNTS CEO Karen Webster. Design systems aren’t new to tech, but applying them at a global scale and in a highly regulated industry like financial services remains no small feat. It’s not surprising that Visa has managed it. What might be surprising is that on Wednesday (April 23), Visa opened up its proprietary system, the Visa Product Design System (VPDS), to the rest of the payments world. Nielsen described the design system not as Visa’s treasure chest of trade secrets, but as its platform for spreading proven, high-performance patterns across teams and regions. Visa’s UX framework includes coded components built in modern frameworks like React, Angular and Flutter. They’re not just design mockups but plug-and-play building blocks ready to be dropped into production environments. If it sounds like the FinTech version of Canva, that’s because it kind of is. “UX designers want something that’s built on a modern stack, that’s highly performant, highly accessible,” Nielsen said. “We’ve taken the time to make sure our components are built just that way so that users can take them off the shelves and run.” Payments Innovation Playbook for UX at Scale In an industry where infrastructure innovation often gets the spotlight, Visa’s move signals something deeper: The UX layer is the next competitive frontier in payments. And Visa’s not just pulling back the curtain. It’s offering the entire toolkit to its design system: a deeply integrated, rigorously tested framework for building consistent, accessible, and elegant digital payment experiences. “There’s goodness there for the communities of designers, startups and engineers who can take the VPDS system and not spend time thinking about things that have already been solved,” Nielsen said. “They can build their own innovations on top of a design system that exists for them.” Opening the design system also represents a deeper strategic shift for Visa: a move from platform operator to ecosystem enabler. It’s a vision that echoes the company’s earlier approach to infrastructure, where it invited FinTechs and banks to build on top of its global network, now applied to the experience layer. After all, whether a startup or an incumbent is looking to accelerate a new offering, time-to-market is everything, yet launching financial products can remain dauntingly complex. “You’ve got the infrastructure. You’ve got the network. Now you’ve got the user experience,” Nielsen said. “Focus on how you want to monetize that. Don’t spend your time reinventing the presentation layer.” Ecosystem Thinking, Not Empire Building The system’s maturity isn’t theoretical. Before this public launch, Visa quietly battle-tested it across internal products by making its own teams use it. The open-source VPDS already played a pivotal role in the development of flagship Visa products like Flexible Credential. “One of the best ways to trial it is to use it yourself,” Nielsen said. “Use it through volunteers, and then force people to use it. And when you’re forced to use something, you get very vocal about how well it’s working.” That internal use provided valuable feedback not just from designers but from the engineers who needed to plug the components into real-world APIs and workflows. The result is a system hardened by the demands of live deployment, not lab environments. “The design system supports all of our products pretty similarly,” Nielsen explained. “Designers sit with product peers and really imagine what that desired experiential outcome should be. And then we talk with customers, use the user-centered design process, test for usability, and refine. That’s where we get patterns we can stamp into the system.” The release also comes at a moment of tectonic change in how consumers interact with software. GenAI, voice interfaces, and biometrics are reshaping expectations and not just about how experiences look, but how much effort they require at all. Ultimately, the value of the system lies not in what Visa has built, but in what others will build on top of it. That’s why it’s open to everyone — developers, designers, enterprises and startups alike via design.visa.com. And while the system itself doesn’t intrinsically spark innovation, Nielsen believes it removes the barriers that block it. By eliminating the noise of user interface complexity, he said, Visa is helping product teams everywhere tune in to what really matters: building the future of payments, faster and better. The post Visa Just Opened Access to Its Product Design System; What’s In It for FinTechs appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-1074733935012714607",
        "title": "Capital One and Discover Can Merge, Regulators Say",
        "url": "https://www.nytimes.com/2025/04/18/business/capital-one-discover-merger.html",
        "site": "nytimes.com",
        "time": 1744998194000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "v"
        ],
        "description": "Two regulators signed off on the $35 billion deal, which the banks say will create a competitor to Visa and Mastercard. But consumer advocates warn that the deal may raise costs. The Federal Reserve Board and the Office of the Comptroller of the Currency allowed Capital One to acquire Discover Financial Services in a deal announced in February 2024.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "8703382167580250215",
        "title": "Visa-backed African unicorn Moniepoint tackles remittances. But is it late to the game?",
        "url": "https://techcrunch.com/2025/04/16/visa-backed-african-unicorn-moniepoint-tackles-remittances-but-is-it-late-to-the-game/",
        "site": "techcrunch.com",
        "time": 1744792534000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "v"
        ],
        "description": "When Visa invested in Nigerian fintech Moniepoint earlier this year, it didn’t just validate the newly minted unicorn — it signaled a bold new direction. As part of that deal, the Nigerian fintech best known for building one of Africa’s largest business banking platforms, hinted at plans to integrate with Visa Direct, a move that […]",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "5958677846832966178",
        "title": "Report: Visa to Join Global Dollar Network Stablecoin Consortium",
        "url": "https://www.pymnts.com/cryptocurrency/2025/visa-join-global-dollar-network-stablecoin-consortium/",
        "site": "pymnts.com",
        "time": 1744657825000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa is reportedly joining the Global Dollar Network (USDG) stablecoin consortium. The company will become the first traditional finance player to join the consortium that shares out yield to participants that create connectivity and liquidity, CoinDesk reported Monday (April 14), citing unnamed sources. Reached by PYMNTS, a Visa spokesperson said in an email that the […] The post Report: Visa to Join Global Dollar Network Stablecoin Consortium appeared first on PYMNTS.com. Visa is reportedly joining the Global Dollar Network (USDG) stablecoin consortium. The company will become the first traditional finance player to join the consortium that shares out yield to participants that create connectivity and liquidity, CoinDesk reported Monday (April 14), citing unnamed sources. Reached by PYMNTS, a Visa spokesperson said in an email that the company does not comment on rumor or speculation. USDG members include Paxos, Robinhood, Kraken, Galaxy Digital, Anchorage Digital, Bullish and Nuvei, according to the CoinDesk report. It was reported in November that the Global Dollar Network introduced a joint stablecoin pegged to the U.S. dollar and aimed to accelerate the use of stablecoins worldwide and promote an asset that provides proportionate economic benefits to its partners. In a Nov. 4 press release announcing the launch of the consortium, the Global Dollar Network said membership is open to custodians, exchanges, payment FinTechs, merchants, protocols, card networks, banks and investment platforms. It added that the network will focus on the Global Dollar (USDG), which is a stablecoin issued out of Singapore by Paxos. “Stablecoins are replatforming the financial system and revolutionizing how people interact with U.S. dollars and payments,” Paxos CEO and co-founder Charles Cascarilla said in the release. “However, the leading stablecoins are unregulated and retain all the reserve economics. Global Dollar Network will return virtually all rewards to participants and is open for anyone to join.” Stablecoins have started to decouple themselves from crypto exchanges and position themselves as a component of real-world financial infrastructure, PYMNTS reported in March. This change comes amid signs of broader adoption of stablecoins in mainstream financial activities including B2B payments, capital markets, lending, cross-border payments and treasury management. Visa launched a new platform in October that enables banks to issue fiat-backed tokens, such as stablecoins and tokenized deposits. The Visa Tokenized Asset Platform (VTAP) is designed to use the payment company’s expertise in technologies like smart contracts to let banks issue and transfer fiat-backed tokens over blockchain networks. “Visa has been at the forefront of digital payments for nearly 60 years, and with the introduction of VTAP, we are once again setting the pace for the industry,” Vanessa Colella, global head of innovation and digital partnerships at Visa, said at the time. The post Report: Visa to Join Global Dollar Network Stablecoin Consortium appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-8185970502489031839",
        "title": "Mynt Gets Visa Investment and Joins Reseller Network",
        "url": "https://www.pymnts.com/partnerships/2025/mynt-gets-visa-investment-joins-reseller-network/",
        "site": "pymnts.com",
        "time": 1744297293000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "5958677846832966178"
        ],
        "description": "Spend management solution provider Mynt launched a new partnership with Visa. The collaboration will allow the Stockholm-based company to address the rising demand from small- to medium-sized businesses (SMBs) for efficient spend management tools, according to a Thursday (April 10) press release. “The partnership will enable Visa to better meet its clients’ needs and the […] The post Mynt Gets Visa Investment and Joins Reseller Network appeared first on PYMNTS.com. Spend management solution provider Mynt launched a new partnership with Visa. The collaboration will allow the Stockholm-based company to address the rising demand from small- to medium-sized businesses (SMBs) for efficient spend management tools, according to a Thursday (April 10) press release. “The partnership will enable Visa to better meet its clients’ needs and the underserved SMB market,” the release said. Visa will invest in Mynt’s Series B funding round, and Mynt will become a reseller partner for Visa. This will let Visa resell Mynt’s software-as-a-service (SaaS) solutions directly to issuers, per the release. Mynt’s platform offers auto-reconciliation and integration into accounting software, providing spend insights and easing administrative burdens, according to the release. “Another great example of Nordic FinTech innovation where Visa is deepening collaboration with Mynt, where our combined capabilities will enable our clients and partners to bring market-leading propositions and service to [SMBs] across Europe,” said Philip Konopik, regional managing director of Visa Nordics and Baltics, in the release. The two companies previously worked together to expand the adoption of Mynt’s embedded card solution. The tool allows enterprise resource planning fleet and fuel companies and banks to offer embedded corporate card and spend management solutions to their SMB customers in Europe. The partnership comes as SMBs face increased financial pressure. Half of SMBs in the United States “rely on their day-to-day sales just to keep the lights on,” PYMNTS wrote this week. “Nearly 1 in 5 are pessimistic about their odds of survival over the next two years. Almost 7% think they might not make it.” Just 28% of SMBs have business cards. Of that group, 64% of businesses with access to any form of financing use their corporate cards to withdraw cash for operations. Although credit cards potentially carry high interest rates, they “offer a quick and relatively easy way to access funds,” PYMNTS wrote. “At the same time, 4 in 10 businesses with access to financing also rely on their owners’ personal credit cards,” blurring the lines between personal and business finances and potentially putting both at risk. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Mynt Gets Visa Investment and Joins Reseller Network appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4329972749184513945",
        "title": "U.S. Transaction Shares for Visa, Mastercard, and Amex",
        "url": "https://www.wsj.com/finance/banking/visa-wanted-a-vast-empire-first-it-had-to-beat-back-its-foes-3b3067f3?mod=article_inline",
        "site": "wsj.com",
        "time": 1743723302000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "v"
        ],
        "description": "Following up on the previous item, here’s a WSJ report from October on Visa’s dominant position in the payments industry: Visa, based in San Francisco, has built its network over more than 60 years — going back to clunky manual credit-card readers and carbon-paper copies of receipts. It accounts for around 60% of the total dollar amount of U.S. debit-card purchases and about 50% of U.S. credit-card purchases, according to the Nilson Report, a trade publication. Its closest competitor, Mastercard, accounts for around 22% and 23%, respectively. Visa’s profit totaled $17.3 billion in its 2023 fiscal year, after more than tripling in the last decade. Amex accounts for about 19% of U.S. credit card transactions (and doesn’t support debit), and Discover is down around 3 or 4%. I really thought Visa and Mastercard had comparable market share, but it turns out Visa is far bigger, and it’s Mastercard and Amex that are around the same size. ★ Following up on the previous item, here’s a WSJ report from October on Visa’s dominant position in the payments industry: Visa, based in San Francisco, has built its network over more than 60 years — going back to clunky manual credit-card readers and carbon-paper copies of receipts. It accounts for around 60% of the total dollar amount of U.S. debit-card purchases and about 50% of U.S. credit-card purchases, according to the Nilson Report, a trade publication. Its closest competitor, Mastercard, accounts for around 22% and 23%, respectively. Visa’s profit totaled $17.3 billion in its 2023 fiscal year, after more than tripling in the last decade. Amex accounts for about 19% of U.S. credit card transactions (and doesn’t support debit), and Discover is down around 3 or 4%. I really thought Visa and Mastercard had comparable market share, but it turns out Visa is far bigger, and it’s Mastercard and Amex that are around the same size. ★",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-6751212587827795956",
        "title": "Visa unveils a trio of new tools to make the payments process easier",
        "url": "https://www.fastcompany.com/91310307/visa-unveils-a-trio-of-new-tools-to-make-the-payments-process-easier",
        "site": "fastcompany.com",
        "time": 1743681600000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "v"
        ],
        "description": "At Visa’s ETA Transact event on April 3, the payments giant introduced three new products designed to simplify and secure payment acceptance. These innovations—Authorize.net 2.0, Unified Checkout, and the ARIC Risk Hub—all aim to enhance efficiency and fraud protection for businesses navigating an increasingly complex commercial landscape. By integrating the three new tools, Visa seeks to service businesses end to end—from integrating with existing platforms to accepting more payments, reducing checkout friction, and managing risk efficiently. “Visa is looking to wherever appropriate to invest in next-generation technologies and uplift our products,” says Rob Cameron, global head of Visa Acceptance Solutions. Authorize.net 2.0 A major overhaul of one of the first internet platforms for e-commerce payments, Authorize.net 2.0 enhances the user experience while connecting businesses with banks and merchant acquirers across the United States. New AI-driven tools further enhance the platform by automating tasks and optimizing payment strategies. Businesses can now issue invoices simply by speaking to Authorize.net, which will generate the invoice, locate the customer, and prepare the invoice for sending—eliminating manual entry. Subscription-based businesses, such as tutoring services, will benefit from the platform’s streamlined setup to accept payments and then charge customers on a recurring basis. “This saves time and allows small-business owners to operate more efficiently,” Cameron says. Unified Checkout Unified Checkout is Visa’s next-generation solution for online payments, designed to create a seamless experience for merchants and customers that reduces lost sales at the checkout point. By automatically adapting the checkout page to match a business’s website, the system ensures a consistent look and feel while improving security. “It’ll look at your existing website, and then it’ll configure a checkout page so it looks like you’re still in the same environment, even though we’ve insulated the website from the credit card data and all the things that websites don’t actually want for security,” Cameron says. Businesses can customize the checkout button order based on insights, prioritizing payment methods like Apple Pay to match customer preferences. With “25 out-of-the-box, different payment types,” including Klarna’s buy now, pay later services, the system helps reduce cart abandonment by ensuring customers find their preferred payment method. The platform also enhances customer retention through tokenization, allowing returning customers to shift from “guest checkout to remember me next time” for a smoother purchasing experience. ARIC Risk Hub Visa’s 2024 acquisition of Featurespace led to the development of ARIC (adaptive, real-time, individual, change identification) Risk Hub, a fraud-detection and risk-management tool that enhances acquirers’ ability to monitor risk and protect merchants. ​​Featurespace’s powerful, adaptive AI helps identify risky transactions and builds profiles around genuine customer activity to increase approvals and stop bad actors in real time. This system enables “dynamic settlement,” meaning businesses can receive payments based on risk assessments. “If I decide you’re low risk, maybe I’ll decide to settle you instantly and I’ll give you money right away,” Cameron says, noting that for higher-risk businesses—such as those selling furniture that won’t be delivered for months—reserves can be adjusted dynamically. The platform’s ongoing monitoring allows financial institutions to approve more merchants up front. Without it, strict barriers are needed to block risky merchants. However, by continuously analyzing transactions and merchant behavior, acquirers can make smarter decisions over time. Cameron says this can ultimately boost revenue by increasing approval rates. Additionally, ARIC Risk Hub provides fraud prevention through acquirer-backed monitoring services. If a merchant receives a suspicious order, the system can detect risks and issue a warning, which, Cameron notes, “allows acquirers to actually provide monitoring services to protect their merchants.”",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-139871469438841185",
        "title": "Visa to Launch New Unified Checkout and Fraud Detection Solutions",
        "url": "https://www.pymnts.com/news/payments-innovation/2025/visa-to-launch-new-unified-checkout-and-fraud-detection-solutions/",
        "site": "pymnts.com",
        "time": 1743625121000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa has unveiled three new value-added services designed to make accepting payments easier and more secure. The services are meant for acquirers, payment facilitators, retailers, marketplaces and shops, the company said in a Thursday (April 3) press release emailed to PYMNTS. With Authorize.net 2.0, Visa has reimagined its Authorize.net by adding a streamlined user interface, […] The post Visa to Launch New Unified Checkout and Fraud Detection Solutions appeared first on PYMNTS.com. Visa has unveiled three new value-added services designed to make accepting payments easier and more secure. The services are meant for acquirers, payment facilitators, retailers, marketplaces and shops, the company said in a Thursday (April 3) press release emailed to PYMNTS. With Authorize.net 2.0, Visa has reimagined its Authorize.net by adding a streamlined user interface, artificial intelligence (AI) capabilities, improved dashboards for management, and support for in-person card readers and tap to phone, according to the release. This enhanced service will be available in the U.S. in the second quarter and in additional countries in 2026. Unified Checkout is a new experience that can be launched in a few hours and will orchestrate more than 25 card and alternative payment options, enabling merchants to accept more payment types and boost their eCommerce conversion rates with an intuitive checkout experience, the release said. It will be available in the U.S. and in pilot state in additional markets in the third quarter. The ARIC Risk Hub uses adaptive AI to help protect acquirers and their merchants against fraud and financial crime by helping to identify risky transactions and build profiles around genuine customer activity, per the release. This service is available globally as of Thursday. “Leveraging new technology to accept payments more efficiently and securely can be what sets a business apart in today’s rapidly digitalizing world,” Antony Cahill, president of value-added services at Visa, said in the release. “With our new services, we’re helping businesses harness data-driven insights, simplify the checkout experience and fight fraud more effectively than ever.” Visa’s Value-Added Services include risk and security solutions, advisory and other services, issuing solutions and acceptance solutions, the company said in February. Together, these offerings earned $8.8 billion in revenue for Visa in 2024, and the company sees them as a $520 billion potential annual revenue opportunity, it said in a presentation released in conjunction with its Visa Investor Day 2025. “What we’ve essentially done is we’ve built a Visa payment stack, built on top of VisaNet and our network of networks, and on top of that, what we explain to investors is, we built Visa-as-a-Service,” Visa CEO Ryan McInerney told CNBC at the time in an interview. The post Visa to Launch New Unified Checkout and Fraud Detection Solutions appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4878171994270990677",
        "title": "How Apple Gets a Lift From Visa’s $100M Credit Card Offer",
        "url": "https://www.barrons.com/articles/apple-card-visa-mastercard-goldman-sachs-2de46360?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1743604320000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5009251728145831628",
        "title": "Report: Visa Offers $100 Million to Get Apple Credit Card Business",
        "url": "https://www.pymnts.com/credit-cards/2025/report-visa-offers-100-million-to-get-apple-credit-card-business/",
        "site": "pymnts.com",
        "time": 1743556243000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa reportedly offered Apple about $100 million to get the tech giant’s credit card business, which is held by Mastercard. The offer came as the payment network and rival American Express are trying to win the Apple card business, and Mastercard is fighting to keep it, The Wall Street Journal (WSJ) reported Tuesday (April 1), […] The post Report: Visa Offers $100 Million to Get Apple Credit Card Business appeared first on PYMNTS.com. Visa reportedly offered Apple about $100 million to get the tech giant’s credit card business, which is held by Mastercard. The offer came as the payment network and rival American Express are trying to win the Apple card business, and Mastercard is fighting to keep it, The Wall Street Journal (WSJ) reported Tuesday (April 1), citing unnamed sources. Reached by PYMNTS, a Visa spokesperson said the company does not comment on rumors or speculation. The Apple card business is in play because the bank behind it, Goldman Sachs, is exiting the consumer lending sector, according to the WSJ report. While Apple is looking for a new bank, it plans to select a payment network first, the report said. The payment networks are competing for the business because not only is Apple one of the biggest co-branded credit card programs — with about $20 billion in balances — but the company plays a growing role in many consumers’ payments and other financial needs, per the report. Apple debuted its credit card in 2019 in conjunction with Goldman Sachs and Mastercard, PYMNTS reported at the time. At launch, key features of the card included no fees, daily cash-back rewards, and the ability to sign up for the card with an iPhone in the Wallet app and get the card within minutes, issued straight to the phone. It was reported in July 2023 that Goldman Sachs’ credit card partnership with Apple could be nearing an end, and that the banking giant was in discussions with American Express to take over the credit card and other collaborations between Goldman and Apple. Goldman had announced plans in late 2022 to scale back its consumer banking offerings, though its agreement with Apple remained untouched at the time. In January, it was reported that Apple was in talks with Barclays and credit card issuer Synchrony Financial to replace Goldman Sachs. Goldman Sachs CEO David Solomon said at the time that while the bank had a contract with Apple to run the partnership until 2030, there was a possibility that it could end before then. The bank was narrowing its strategic focus and exiting some businesses. The post Report: Visa Offers $100 Million to Get Apple Credit Card Business appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-913378975066164833",
        "title": "Sources: Visa has offered Apple ~$100M to become the network for the Apple Card; Amex is also competing, while Mastercard tries to keep its role as the network (AnnaMaria Andriotis/Wall Street Journal)",
        "url": "http://www.techmeme.com/250401/p34#a250401p34",
        "site": "techmeme.com",
        "time": 1743539656000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "4878171994270990677",
            "-8138082149980342979",
            "-5009251728145831628",
            "7601480423194153701"
        ],
        "description": "AnnaMaria Andriotis / Wall Street Journal: Sources: Visa has offered Apple ~$100M to become the network for the Apple Card; Amex is also competing, while Mastercard tries to keep its role as the network — Visa, Amex and Mastercard are all competing to be the network for Apple's credit card — Visa has offered Apple …",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "7601480423194153701",
        "title": "Visa, American Express seek to swipe Apple credit card from Mastercard - report",
        "url": "https://seekingalpha.com/news/4427715-visa-american-express-seek-to-swipe-apple-credit-card-from-mastercard---report",
        "site": "seekingalpha.com",
        "time": 1743538675000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-1041603054144750844",
        "title": "Visa deposits $375M into U.S. litigation escrow account",
        "url": "https://seekingalpha.com/news/4427141-visa-deposits-375m-into-u-s-litigation-escrow-account",
        "site": "seekingalpha.com",
        "time": 1743453537000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "8862177644662598933",
        "title": "Jason Blackhurst to Succeed Featurespace CEO Martina King After Visa Acquisition",
        "url": "https://www.pymnts.com/personnel/2025/jason-blackhurst-succeed-ceo-martina-king-featurespace-after-visa-acquisition/",
        "site": "pymnts.com",
        "time": 1743432589000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Featurespace, a provider of global fraud and financial crime solutions, announced a leadership change following its acquisition by Visa. CEO Martina King will retire and be succeeded by Jason Blackhurst, who will take on the role of senior vice president, head of Featurespace and acceptance risk solutions at Visa, Featurespace said in a Monday (March […] The post Jason Blackhurst to Succeed Featurespace CEO Martina King After Visa Acquisition appeared first on PYMNTS.com. Featurespace, a provider of global fraud and financial crime solutions, announced a leadership change following its acquisition by Visa. CEO Martina King will retire and be succeeded by Jason Blackhurst, who will take on the role of senior vice president, head of Featurespace and acceptance risk solutions at Visa, Featurespace said in a Monday (March 31) press release. During her 12 years as Featurespace’s CEO, King led the firm from its early stages to its current position as a leader in machine learning-powered fraud detection and a Visa solution, according to the release. Featurespace’s technology is now used by 100,000 businesses and processes 100 billion payment events per year. Blackhurst has been senior vice president of innovation and strategic partnership at Visa for 10 years, according to his LinkedIn profile. Before that, he had roles at Bank of America, Vesta, Polestar Communications and Concentrex. Blackhurst will relocate from the United States to the United Kingdom, where Featurespace is securing a six-year lease at its current head office in Cambridge and continuing its longstanding ties to the University of Cambridge, per the release. “I am excited to build upon Featurespace’s strong foundations and drive further innovation in the rapidly evolving fraud prevention landscape,” Blackhurst said in the release. “I have been inspired by how deeply the team thinks about problems and solutions under Martina’s leadership and hope to continue that legacy.” James Mirfin, senior vice president, global head of risk and identity solutions at Visa, said in the release: “If you’re going to solve dynamic problems, you need dynamic leadership and relationships — and Featurespace has built that over the past 12 years. Jason’s vision will be invaluable as we continue to deliver cutting-edge fraud prevention solutions to our clients globally.” Visa announced its plan to acquire Featurespace in September and completed the acquisition in December. The company said at the time that Featurespace’s business will become part of Visa’s Risk and Identity Solutions unit and that its products will be woven into Visa’s offering to expand on its fraud prevention solutions and use cases. Also in December, Featurespace was granted a U.S. patent for its adaptive behavioral analytics technology, an artificial intelligence-driven technology that improves fraud detection and prevents real-time scams. The human element can often be the most vulnerable yet potentially under-addressed aspect of financial scams, according to the PYMNTS Intelligence report “How Scammers Tailor Financial Scams to Individual Consumer Vulnerabilities.” The post Jason Blackhurst to Succeed Featurespace CEO Martina King After Visa Acquisition appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-1225635909854403481",
        "title": "QorPay Integrates Visa Platform Connect and Other Services",
        "url": "https://www.pymnts.com/visa/2025/qorpay-integrates-visa-platform-connect-and-other-services/",
        "site": "pymnts.com",
        "time": 1743207731000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "FinTech company QorPay collaborated with Cybersource to integrate Visa Platform Connect (VPC) and other Visa value-added services into QorPay’s payment ecosystem. QorPay is a provider of payment solutions, while Cybersource is an open, network-agnostic ecosystem from Visa Acceptance Solutions that offers modular payments services, the companies said in a Thursday (March 27) press release. With the addition of Visa’s technology to its […] The post QorPay Integrates Visa Platform Connect and Other Services appeared first on PYMNTS.com. FinTech company QorPay collaborated with Cybersource to integrate Visa Platform Connect (VPC) and other Visa value-added services into QorPay’s payment ecosystem. QorPay is a provider of payment solutions, while Cybersource is an open, network-agnostic ecosystem from Visa Acceptance Solutions that offers modular payments services, the companies said in a Thursday (March 27) press release. With the addition of Visa’s technology to its suite of products, QorPay can help organizations streamline transactions, orchestrate data, reduce risk of fraud and improve expense management, according to the release. “By integrating with Visa’s value-added services, we can empower businesses with a more secure, flexible and efficient way to manage payments, reinforcing our commitment to innovation in the FinTech space,” QorPay Executive Board Member Ken Paull said in the release. Bill Serino, senior vice president and head of Visa Value-Added Services in North America, said in the release: “Teaming up with QorPay is an exciting step for us, as we tap into Visa’s Acceptance Solutions suite to boost efficiency and security for businesses everywhere.” In another recently announced collaboration, payments security provider Bluefin said in January that it integrated its payment gateway with Visa Platform Connect. Bluefin said the integration is designed to provide a fast and secure connection for acquirers using the Visa platform, including payment processing in multiple currencies to Visa and other major card networks. The company said it will also use the Cybersource Decision Manager platform to help retailers reduce fraud and accept more valid orders across channels and geographies. “Bluefin is thrilled to be working with Visa Acceptance Solutions to deliver a true international multi-acquiring P2PE [point-to-point encryption] solution for retailers that removes the cost and complexity of building and managing separate integrations,” Tim Barnett, chief information officer at Bluefin, said in a Jan. 13 press release. Visa told investors in February that its Value-Added Services earned close to $9 billion in 2024 and has the potential to grow to $520 billion a year. The components of the Value-Added Services offering include risk and security solutions, advisory and other services, issuing solutions and acceptance solutions, the company said in a presentation released in conjunction with its Visa Investor Day 2025. The post QorPay Integrates Visa Platform Connect and Other Services appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "8873874907686275016",
        "title": "Lloyds Launches Virtual Card Partnership With Taulia",
        "url": "https://www.pymnts.com/partnerships/2025/lloyds-launches-virtual-card-partnership-with-taulia/",
        "site": "pymnts.com",
        "time": 1743084016000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "SAP-owned working capital management solutions provider Taulia has launched a virtual card partnership with Lloyds. This collaboration will see the companies issue Visa-enabled virtual cards, embedded across a variety of solutions available with the SAP business suite, Taulia announced in a Thursday (March 27) news release. “Through the partnership, Lloyds will extend credit to customers who have purchased the Taulia […] The post Lloyds Launches Virtual Card Partnership With Taulia appeared first on PYMNTS.com. SAP-owned working capital management solutions provider Taulia has launched a virtual card partnership with Lloyds. This collaboration will see the companies issue Visa-enabled virtual cards, embedded across a variety of solutions available with the SAP business suite, Taulia announced in a Thursday (March 27) news release. “Through the partnership, Lloyds will extend credit to customers who have purchased the Taulia Virtual Cards solution, allowing companies to issue virtual cards to suppliers worldwide in a seamless B2B payment process,” the release said. “Combining Taulia’s scalable technology with Lloyds’ reach, the partnership offers an innovative and fully embedded payment solution that caters to UK customer needs.” As the release notes, embedded finance technology integrates financial services into non-financial platforms and applications to help businesses enhance operations and improve on their customer experience. In this case, Taulia uses Visa’s APIs to integrate Visa virtual payment credentials, acceptance solutions and supplier enablement services into the end-user’s business and enterprise resource planning (ERP) applications. “Embedding virtual cards directly within the ERP landscape and having Lloyds as an issuing partner is a game-changer for corporate payments,” Taulia Chief Product Officer Danielle Weinblatt said in the announcement. “This collaboration redefines how businesses manage spend, bringing greater control, automation, and working capital optimization directly into their existing workflows.” As PYMNTS wrote recently, virtual cards are enjoying an increasingly important place in the corporate payments world, particularly at a time when misused or stolen cards account for a significant percentage of business fraud cases. Virtual cards, unlike their traditional counterparts, are generated digitally and meant for one-time or recurring use with customizable spending limits. “Virtual card numbers offer a modernized solution with flexibility in transaction amounts, merchant types and frequencies,” Marcos Gelfi, vice president and global head of commercial fraud/dispute products and cardholder solutions at Discover® Global Network, said in an interview with PYMNTS last fall. “By leveraging data and defining clear corporate policies, businesses can achieve greater efficiencies and robust fraud prevention,” Gelfi added. “The data that you capture is pretty important and can help you negotiate better with suppliers, and help you manage your budget better.” Recent research by Visa and PYMNTS Intelligence has shown that the increased popularity of virtual cards as a working capital solution, with use of these cards increasing by close to a third, year over year. The post Lloyds Launches Virtual Card Partnership With Taulia appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-7543000566799381983",
        "title": "Visa and Extend Form Middle-Market-Focused Virtual Card Pact",
        "url": "https://www.pymnts.com/news/b2b-payments/2025/visa-and-extend-form-middle-market-focused-virtual-card-pact/",
        "site": "pymnts.com",
        "time": 1743013303000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Virtual card and spend management platform Extend says it has launched a referral agreement with Visa. With Extend’s solution, the company said in a Wednesday (March 26) news release, firms defined by Visa as emerging middle-market companies can use virtual cards to manage spending, fight fraud and close their books more quickly. The release noted […] The post Visa and Extend Form Middle-Market-Focused Virtual Card Pact appeared first on PYMNTS.com. Virtual card and spend management platform Extend says it has launched a referral agreement with Visa. With Extend’s solution, the company said in a Wednesday (March 26) news release, firms defined by Visa as emerging middle-market companies can use virtual cards to manage spending, fight fraud and close their books more quickly. The release noted that many of these companies are seeking more control over their business-to-business (B2B) payments, which is why some projections show virtual card spending reaching $14 trillion worldwide by 2028, up from $3.1 trillion in 2023. “Our ongoing relationship with Visa is a key pillar in our effort to deliver powerful payment technology without asking customers to give up the business card they prefer or the bank they trust,” said Extend CEO Andrew Jamison. “With this referral agreement, we look forward to supporting more Visa-issuing banks and their emerging middle-market clients.” Added Leigh Radtke, vice president, head of North America product, Visa Commercial Solutions: “B2B payment experiences should mirror those we enjoy as consumers and provide businesses the controls and features essential for improving their operational effectiveness. Extend delivers this consumer-like experience in a way that resonates with the emerging middle-market segment in particular.” Research by PYMNTS Intelligence and Visa — from the second edition of the “Growth Corporates Working Capital Index” — shows increased popularity of virtual cards as a working capital solution, with the use of the cards growing by almost a third year over year. As PYMNTS wrote earlier this month, virtual cards offer a modern solution at a time when manual spend management presents a risk for fraud. Unlike traditional credit cards, these cards are digitally generated and created for one-time or recurring use with customizable limits on spending. Virtual card platforms can often integrate with enterprise resource planning (ERP) systems, accounting software and expense management tools, fostering a frictionless financial ecosystem. “Virtual card numbers offer a modernized solution with flexibility in transaction amounts, merchant types and frequencies,” Marcos Gelfi, vice president and global head of commercial fraud/dispute products and cardholder solutions at Discover® Global Network, said in an interview with PYMNTS. “By leveraging data and defining clear corporate policies, businesses can achieve greater efficiencies and robust fraud prevention,” Gelfi added. “The data that you capture is pretty important and can help you negotiate better with suppliers, and help you manage your budget better. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Visa and Extend Form Middle-Market-Focused Virtual Card Pact appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-7083052473728127458",
        "title": "Report: Sam Altman’s World Network Discusses Adding Visa Card Functionality",
        "url": "https://www.pymnts.com/crypto-wallet/2025/sam-altman-world-network-discusses-adding-visa-card-functionality/",
        "site": "pymnts.com",
        "time": 1742836194000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "World Network, the organization co-founded by Sam Altman that is part of the blockchain-based ecosystem that includes Worldcoin, is reportedly in talks with Visa to add on-chain card features to the organization’s self-custody cryptocurrency wallet. The company that oversees the ecosystem, Tools for Humanity, sent a request-for-product form to card issuers, CoinDesk reported Monday (March […] The post Report: Sam Altman’s World Network Discusses Adding Visa Card Functionality appeared first on PYMNTS.com. World Network, the organization co-founded by Sam Altman that is part of the blockchain-based ecosystem that includes Worldcoin, is reportedly in talks with Visa to add on-chain card features to the organization’s self-custody cryptocurrency wallet. The company that oversees the ecosystem, Tools for Humanity, sent a request-for-product form to card issuers, CoinDesk reported Monday (March 24), saying it had seen a copy of the form. Reached by PYMNTS, World Network declined to comment on the report. Neither Visa nor Tools for Humanity immediately replied to PYMNTS’ request for comment. With the addition of Visa card functionality, World Network wallets would enable a range of applications, including stablecoin payments to merchants in the Visa network, according to the report. World Network said March 6 that it beta launched a mini app called World Chat within its World App that enables users to chat with and send and receive crypto to and from other members of the World Network. “[Because] World Chat is integrated seamlessly with the World App wallet, it means you can send and receive crypto to and from anyone in the world as easily as sending a picture,” the company said in a blog post. On March 17, World Network said it partnered with gaming lifestyle product provider Razer to offer a secure, single sign-on “proof of human” technology called “Razer ID Verified by World ID” that is designed to verify human gamers and reduce the negative impact of bots on gaming. “By giving gamers a secure and private way to verify that they’re human, gamers can look forward to fair play with real players in a trusted environment that improves the gaming experience for everyone,” World Network said in a blog post. Worldcoin launched its digital wallet and identity technology in July 2023, with Altman and co-founder Alex Blania, CEO of Tools for Humanity, saying they aimed to provide a complete global financial platform, combat increasing income inequality and serve as a form of a universal basic income. The endeavor aims to use eye-scanning technology dubbed “The Orb” to launch a worldwide identification system. The post Report: Sam Altman’s World Network Discusses Adding Visa Card Functionality appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "3777875975779811551",
        "title": "Payment services company Visa plans data center in Nigeria",
        "url": "https://www.datacenterdynamics.com/en/news/payment-services-company-visa-plans-data-center-in-nigeria/",
        "site": "datacenterdynamics.com",
        "time": 1742831103000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "v"
        ],
        "description": "Company has already invested $1 billion in the country",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-7723481019259186302",
        "title": "Visa Stock To $220? - Although such a drastic move might appear extreme, it has happened ...",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/03/21/visa-stock-to-220/",
        "site": "forbes.com",
        "time": 1742547600000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "v"
        ],
        "description": "Although such a drastic move might appear extreme, it has happened before and could occur again. Although such a drastic move might appear extreme, it has happened before and could occur again.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-4661783519455786966",
        "title": "Worldpay and Visa Introduce Single-Click Checkout in the UK",
        "url": "https://www.pymnts.com/news/payment-methods/2025/worldpay-and-visa-introduce-single-click-checkout-in-the-uk/",
        "site": "pymnts.com",
        "time": 1742480752000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Worldpay and Visa have announced the launch of a new Click to Pay with Visa checkout feature for online merchants in the U.K. The Click to Pay option allows customers to complete transactions with a single click, eliminating the need to manually enter card details, according to a Thursday (March 20) press release. The feature […] The post Worldpay and Visa Introduce Single-Click Checkout in the UK appeared first on PYMNTS.com. Worldpay and Visa have announced the launch of a new Click to Pay with Visa checkout feature for online merchants in the U.K. The Click to Pay option allows customers to complete transactions with a single click, eliminating the need to manually enter card details, according to a Thursday (March 20) press release. The feature is available to Worldpay clients that use the company’s hosted payment pages, and Click to Pay can be activated without requiring additional development work from merchants, the release said. Worldpay research found most online shoppers, at 83%, expect a one-click checkout experience, per the release, and “Merchants can address cart abandonment as well as drive loyalty through convenience by making the checkout experience as swift as possible.” Cart abandonment, a pain point for online merchants, can be caused by lengthy checkout processes that can deter consumers. “In our research, we’ve found that nearly half of consumers who have abandoned their cart say there were too many steps in the checkout process,” Worldpay EMEA General Manager Pete Wickes said in the release. In addition to providing access to innovations such as Click to Pay, he said, “we go a step further by making it as easy as a switch of a button to turn it on without further integration work.” According to the release, the Click to Pay technology incorporates advanced security measures, including tokenization. The process encrypts payment information, making it unreadable to unauthorized parties. The release cited studies by VisaNet, Visa’s global electronic payments network, that indicate this method can increase authorization rates by over 10% and reduce fraud by 80% compared to manual card entry. Mandy Lamb, managing director of U.K. and Ireland at Visa, said in the release: “Visa cardholders globally can now experience the convenience of our Click to Pay solution, and we’re delighted to be able to bring it to more merchants and consumers by partnering with a leader like Worldpay.” As PYMNTS reported last month, Worldpay will be acquiring London-based artificial intelligence (AI)-powered fraud prevention platform Ravelin. Expected to close in the first quarter, the acquisition will bolster Worldpay’s payment solutions, enabling merchants to enhance security and accelerate growth, the companies said in a press release at the time. The post Worldpay and Visa Introduce Single-Click Checkout in the UK appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4227922787458148853",
        "title": "A Matter of Trust: How AI Is Reshaping Risk Assessment",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/a-matter-of-trust-how-ai-is-reshaping-risk-assessment/",
        "site": "pymnts.com",
        "time": 1742425323000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Financial services institutions have long relied on machine learning for risk management, but the threat landscape has grown exponentially in the age of generative artificial intelligence (AI), according to executives from Capital One, Visa and Alloy. Fraudsters now have access to AI tools, including synthetic identity generation and real-time phishing attacks, they said. But AI […] The post A Matter of Trust: How AI Is Reshaping Risk Assessment appeared first on PYMNTS.com. Financial services institutions have long relied on machine learning for risk management, but the threat landscape has grown exponentially in the age of generative artificial intelligence (AI), according to executives from Capital One, Visa and Alloy. Fraudsters now have access to AI tools, including synthetic identity generation and real-time phishing attacks, they said. But AI is also arming companies to supercharge their defensive capabilities, since trust and security are the foundation of financial transactions. “Trust is the very foundation of commerce,” said Rajat Taneja, president of technology at Visa. “When two unknown parties are transacting, they have to trust that the transaction will occur correctly, the money will be transferred properly, any dispute will be managed, and there’s someone handling fraud and scams.” Taneja said the first use case for AI in financial services was actually in risk management, and it remains a “critical tool to combat fraud, scams and enumeration attacks.” (Enumeration attacks are those that test different credentials such as passwords and usernames to gain unauthorized access.) The challenge is that criminals now also can use AI to attack. “We have ChatGPT, they have ‘FraudGPT,’” Taneja said. “It’s a constant battle.” FraudGPT is like the evil twin of ChatGPT: It is a malicious generative AI tool designed specifically for cybercriminal activities like creating phishing emails, undetectable malware and developing hacking tools. Subscription fees start at $200 per month and goes up to $1,700 per year. Visa, which processes more than $16 trillion annually, has used AI for fraud detection since 1992, according to Taneja. The latest advancements in GenAI let Visa develop models that detect fraud faster and more effectively. Shape-Shifting Adversary Prem Natarajan, chief scientist and head of enterprise AI at Capital One, likened AI-powered fraud to organisms with fast development cycles. Unlike traditional fraud techniques, modern AI-driven scams can adapt in real time. This ability to shift allows cybercriminals to continuously tweak their approaches based on what works. “It’s the first time we have a shape-shifter, in that, as it’s interacting with you, it can adapt itself,” he said during a panel discussion at the HumanX conference last week. Laura Spiekerman, co-founder of identity risk management company Alloy, emphasized that while deep fakes and identity fraud dominate headlines, a more worrisome trend is the speed at which AI allows fraudsters to operate. “We’ve seen synthetic fraud for six, seven, eight years now,” she said, explaining that this is when criminals build credible identities over time using half real credentials and half fake — and then cash out in large sums fraudulently. “What we’re seeing AI do is actually speed that up,” Spiekerman said. A key question in the discussion was when AI will be trusted enough to operate without human oversight. Natarajan said humans will always be involved, not just as reviewers but as end customers. “So the real question is how can we get signals from the end customer that we’re building trust with them with the AI we’re serving them?” Natarajan cited Capital One’s Chat Concierge, a multiagent conversational AI system designed for both car buyers and dealers. It not only provides information but also takes action on customer requests. Chat Concierge has been trained on Capital One data. “There is a human in the loop to make sure it doesn’t go awry,” Natarajan said. “We always use that as a guardrail.” Another use case is in call centers. Capital One is using AI to help its customer service representatives. “The moment when the agent picks up the call and starts talking with you is actually a high moment of impatience for the customer and a high-stress moment for the agent,” Natarajan said. With AI, Capital One can “simplify the agent’s experience in that moment and make it that much less stressful, transfer the burden from them to the system,” Natarajan added. AI and Compliance Taneja said Visa, which operates in 200 countries and processes 300 billion transactions annually, is investing in AI-driven compliance frameworks. “Compliance is a huge foundation for us,” Taneja said. “Compliance, both in the letter and spirit [of the law], is fundamental to the DNA of a platform like ours. And you have to do it in the spirit of making sure that your data complies with privacy, security [regulations] and ensuring every rule of every country you operate in is fully adhered to.” Spiekerman noted that financial institutions across the board, whether big or small, tend to react to fraud by shutting down operations rather than adapting their AI-driven fraud detection models. “When these financial institutions get hit with fraud, their answer is ‘shut it down,’” Spiekerman said. Instead, they should use AI to modify their response and selectively let some customers through. Looking ahead, Natarajan said AI will move from enabling “interactions to actions.” The future of AI in finance is one in which it can predict what actions to take, do those actions and complete them, he explained. At Visa, Taneja was excited about the idea of “agentic commerce,” where an AI agent does some aspects of the shopping process such as doing research, price matching, checking out warranties and finding goods the human user might like to buy. “The agentic commerce piece is very exciting,” Taneja said. “You get goosebumps thinking about what is coming next.” The post A Matter of Trust: How AI Is Reshaping Risk Assessment appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3301009588731074075",
        "title": "Visa Joins Forces With Australian Banks on B2B Payments",
        "url": "https://www.pymnts.com/news/b2b-payments/2025/visa-joins-forces-with-australian-banks-on-b2b-payments/",
        "site": "pymnts.com",
        "time": 1742241739000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa has teamed with four of Australia’s biggest banks to simplify B2B payments. The collaboration, announced Monday (March 17), will see the digital payments giant team with ANZ, HAB, HSBC and Westpac to launch Visa B2B Integrated Payments (VBIP) in Australia. “The solution, which is embedded into the SAP Business Technology Platform, will allow businesses […] The post Visa Joins Forces With Australian Banks on B2B Payments appeared first on PYMNTS.com. Visa has teamed with four of Australia’s biggest banks to simplify B2B payments. The collaboration, announced Monday (March 17), will see the digital payments giant team with ANZ, HAB, HSBC and Westpac to launch Visa B2B Integrated Payments (VBIP) in Australia. “The solution, which is embedded into the SAP Business Technology Platform, will allow businesses to automate many of their B2B payments,” the companies said in a news release. “This effectively removes the need for additional reconciliation, improving productivity for administration and finance teams, and creating more time to focus on business growth.” According to the release, Australian business owners using the SAP platform will be able to route commercial payments to all suppliers, including those that don’t accept card payments. In addition to the above-mentioned banks, Visa plans to add other local partners in the future. Chris Newkirk, Visa’s president of commercial and money movement solutions, said VBIP will help address the pain points faced by business owners at a time when Australians want B2B payments to be as pain-free as the ones they make as consumers. “For a growing company managing multiple suppliers, payment processes can be automated to reduce the risk of late fees, allowing them to focus on improving their product offerings and customer service while effectively managing supplier payments and cash flow” Newkirk said. In other B2B payment news, PYMNTS wrote Monday about the way new embedded finance solutions are changing the payment landscape. For example, B2B digital marketplaces “are becoming ecosystems where suppliers and buyers can transact with unprecedented ease,” with these platforms offering embedded services like buy now pay later (BNPL). These innovations, the report added, are designed to solve payment delays, a long-term challenge in B2B commerce. With their structured installment plans, BNPL solutions enhance liquidity and bolster buyer-supplier relationships. “There has definitely been an uptick in B2B-type platforms that are looking to add additional services to their product offering,” Justin Downey, vice president of product at Maverick, told PYMNTS. “There’s been a lot of development with third parties and ease of integration through APIs. Adding this payment piece to an existing offering just makes sense.” Historically, B2B payments have trailed their retail counterparts. Digital wallets, one-click checkouts and real-time payments dominate consumer transactions, while business payments are weighed down by antiquated systems. “The inertia is largely due to legacy banking infrastructures, regulatory complexities and entrenched business processes,” PYMNTS wrote. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Visa Joins Forces With Australian Banks on B2B Payments appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "7578676971965101360",
        "title": "Visa’s AI edge: How RAG-as-a-service and deep learning are strengthening security and speeding up data retrieval",
        "url": "https://venturebeat.com/ai/visas-ai-edge-how-rag-as-a-service-and-deep-learning-are-strengthening-security-and-speeding-up-data-retrieval/",
        "site": "venturebeat.com",
        "time": 1742225400000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa has reduced data retrieval from hours to mere minutes and blocked $40 billion in fraud thanks to gen AI tools. Visa has reduced data retrieval from hours to mere minutes and blocked $40 billion in fraud thanks to gen AI tools.Read More",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4879547205967137612",
        "title": "Visa to Add Tokenization and Digital Wallet Capabilities to Fleet Cards",
        "url": "https://www.pymnts.com/news/b2b-payments/2025/visa-add-tokenization-digital-wallet-capabilities-fleet-cards/",
        "site": "pymnts.com",
        "time": 1741890464000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa will soon add tokenization and custom provisioning for mobile transactions to its Fleet cards, enabling issuers and FinTechs to integrate encrypted and tokenized card information into Apple Pay mobile wallets. With this capability, issuers and FinTechs will be able to provide a seamless and secure experience for commercial fleet drivers and fleet managers, Gloria […] The post Visa to Add Tokenization and Digital Wallet Capabilities to Fleet Cards appeared first on PYMNTS.com. Visa will soon add tokenization and custom provisioning for mobile transactions to its Fleet cards, enabling issuers and FinTechs to integrate encrypted and tokenized card information into Apple Pay mobile wallets. With this capability, issuers and FinTechs will be able to provide a seamless and secure experience for commercial fleet drivers and fleet managers, Gloria Colgan, global head of products, Visa Commercial Solutions, wrote in an article posted Thursday (March 13) on LinkedIn. These enhancements will allow fleet data tags to be provided during the token provisioning process so that they and the token payment data can be passed to the point of sale, and will enable digital credentials to be pushed into mobile wallets, card-on-file merchants and Click to Pay to reduce the time to market, according to the article. The enhancements will be made generally available “soon,” per the article. “This innovation solves for a clear pain point within fleet today and allows for a plethora of client benefits, including instant issuance, a more seamless user experience for drivers, and robust controls and provisions for fleet managers,” Colgan said in the article. When the new enhancements were piloted from April to November, Highnote, a U.S.-based issuer-processor and program manager, participated and found that they help “put the power of payments into the hands of fleet drivers everywhere,” Highnote CEO and co-founder John MacIlwaine said in the article. “The world of fleet payments has represented the biggest opportunity to benefit from modernization,” MacIlwaine said. “Thanks to the power of payments innovation that’s quickly changing.” Digital wallets have introduced a more streamlined, secure and efficient way of conducting B2B payments. The integration of virtual cards with digital wallets gives chief financial officers the ability to control corporate spending, especially unplanned spending. A virtual corporate card can be provisioned directly to a digital wallet on an employee’s mobile phone, managed by the company and enabling contactless digital payments. “We have multiple tools in the toolkit, from an internal perspective, and as well as a partnership perspective, to expand acceptance on the commercial front,” Colgan told PYMNTS in an interview posted in August 2023. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Visa to Add Tokenization and Digital Wallet Capabilities to Fleet Cards appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-9186692553005380070",
        "title": "Trump’s DOJ Antitrust Chief Gail Slater Wins Senate Confirmation",
        "url": "https://www.bloomberg.com/news/articles/2025-03-11/trump-s-doj-antitrust-chief-gail-slater-wins-senate-confirmation",
        "site": "bloomberg.com",
        "time": 1741733456000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "v"
        ],
        "description": "The US Senate confirmed Gail Slater to lead antitrust enforcement at the Justice Department, installing a key official who will oversee lawsuits alleging illegal monopolization by companies including Alphabet Inc.’s Google, Apple Inc. and Visa Inc. Abigail Slater, US assistant attorney general nominee for US President Donald Trump, during a Senate Judiciary Committee confirmation hearing in Washington, DC, US, on Wednesday, Feb. 12, 2025. Democratic senators pressed President Donald Trump’s nominee for Deputy Attorney General, Todd Blanche, on politicization of the Justice Department and recent efforts to gather names of FBI agents who worked on cases related to the Jan. 6, 2021, attack on the US Capitol.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-7487995808436386207",
        "title": "Visa Says New Anti-Fraud Unit Blocked $350 Million in Scam Attempts",
        "url": "https://www.pymnts.com/fraud-prevention/2025/visa-says-new-anti-fraud-unit-blocked-350-million-in-scam-attempts/",
        "site": "pymnts.com",
        "time": 1741723632000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa says its new anti-fraud disruption department saved potential victims $350 million last year. The company’s scam disruption practice, announced Tuesday (March 11), part of Visa’s Payment Ecosystem Risk and Control (PERC), which itself blocked $40 billion in attempted fraud in 2024. “Visa has invested over $12 billion dollars in technology over the last five […] The post Visa Says New Anti-Fraud Unit Blocked $350 Million in Scam Attempts appeared first on PYMNTS.com. Visa says its new anti-fraud disruption department saved potential victims $350 million last year. The company’s scam disruption practice, announced Tuesday (March 11), part of Visa’s Payment Ecosystem Risk and Control (PERC), which itself blocked $40 billion in attempted fraud in 2024. “Visa has invested over $12 billion dollars in technology over the last five years, including to reduce fraud and enhance network security,” Paul Fabara, chief risk and client services officer at Visa, said in a news release. “At the same time, we have made a significant investment in our best weapon against scammers: our people. By combining our proprietary technology with the unique experiences and perspective our talent brings, we can more effectively identify and defeat even the savviest scammers.” According to the release, Visa Scam Disruption (VSD) includes a “cross-disciplinary team” that deploys strategies to mitigate a range of scams. The unit also conducts “proactive” scam investigations to identify and address scams before they hurt consumers. In addition, VSD employs generative artificial intelligence (GenAI) tools that can help “identify complex relationships and parse through mass amounts of data to identify true positive and impactful scam activity.” Meanwhile, PYMNTS wrote last week about an explosion in scams against banks and their customers, with criminals turning to new technologies and old-fashioned manipulation. “Fraudsters pull at human nature in a bid to gain access to accounts and drain them — pleading through texts, phone calls and AI prompts for donations, romance, bail to get out of jail and more,” that report said. “Scammers are industrious, becoming more businesslike, moving beyond blast emails toward a personalized approach as they pick their victims.” Research by PYMNTS Intelligence — from the report “The Impact of Financial Scams on Consumers’ Finances and Banking Habits” — found that two types of scams cause more financial damage than average. In first place are investment scams, which have a median loss of $1,104, followed by romance scams, with a median loss of $1,996. “Romance scams also string targets along for an average of 3.6 transactions, which is nearly twice as many as other methods,” PYMNTS wrote. This week also saw new findings from the Federal Trade Commission (FTC), showing that consumers reported more than $12.5 billion in fraud losses last year. That’s a 25% uptick over 2023, driven not by a rise in the number of reports but an increase in people who reported losing money to a fraud or scam. The post Visa Says New Anti-Fraud Unit Blocked $350 Million in Scam Attempts appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "5671336409709973703",
        "title": "Mastercard and Visa Pledge Vigilance Following Gambling Investigation",
        "url": "https://www.pymnts.com/credit-cards/2025/mastercard-visa-pledge-vigilance-following-gambling-investigation/",
        "site": "pymnts.com",
        "time": 1741618217000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Mastercard and Visa are probing claims that illegal gambling websites facilitated deposits through their networks. An investigation into the sites found that Mastercard and Visa were failing to prevent their networks from being used for those transactions, The Guardian reported last week. The investigation — by the group Investigate Europe — found that Mastercard was […] The post Mastercard and Visa Pledge Vigilance Following Gambling Investigation appeared first on PYMNTS.com. Mastercard and Visa are probing claims that illegal gambling websites facilitated deposits through their networks. An investigation into the sites found that Mastercard and Visa were failing to prevent their networks from being used for those transactions, The Guardian reported last week. The investigation — by the group Investigate Europe — found that Mastercard was offered as a payment method on nine casino and live sports betting websites targeting customers in the United Kingdom, while Visa was listed on two, per the report. The findings were part of a broader examination of a network of gambling sites operating in Europe despite being outlawed. A spokesperson for Mastercard told PYMNTS the company has “zero tolerance” for illegal activity on its network and is investigating the sites in question. Mastercard has no direct relationship with the merchants, and the payments were made via an acquirer. “Acquirers are responsible for performing due diligence on their customers and ensuring the merchant is properly registered on our network, and acts lawfully, including obtaining and maintaining the required regulatory licenses to operate in all jurisdictions they do business,” the spokesperson said. “Acquirers also must ensure their customers fully comply with Mastercard rules and to never use the network for transactions prohibited by applicable law.” Visa did not reply to PYMNTS’ request for comment. A Visa spokesperson told The Guardian the company would also be investigating the reports, adding that it has “no direct relationship with merchants” but works with partners to terminate merchants offering illegal services, and “constantly invests” in “best-in-class technology” to ensure compliance. Meanwhile, the gambling sector is getting a payments-centric makeover as sportsbooks and online gaming platforms compete for player loyalty. After sports betting was legalized throughout the United States, payments remained a hurdle, as issuing banks tended to block gambling-related transactions, Zak Cutler, president of global gaming at Paysafe, told PYMNTS last month. Even after gaming was legalized, approval rates remained low. Over time, however, major financial institutions began to recognize the legitimacy of online sports betting, bringing transaction approval rates from single digits to more than 90% at major banks at current rates. “Fast forward five years, and we’ve gone from very few ways to pay — with a ton of friction — to a well-optimized space with a variety of payment methods,” Cutler said. The post Mastercard and Visa Pledge Vigilance Following Gambling Investigation appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "6931777218414849139",
        "title": "Revolut and Visa file challenges against UK's Payment Systems Regulator, say it overstepped its powers with a plan to cap international digital transaction fees (Akila Quinio/Financial Times)",
        "url": "http://www.techmeme.com/250307/p17#a250307p17",
        "site": "techmeme.com",
        "time": 1741384201000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "v"
        ],
        "description": "Akila Quinio / Financial Times: Revolut and Visa file challenges against UK's Payment Systems Regulator, say it overstepped its powers with a plan to cap international digital transaction fees — Fintech argues watchdog has overstepped its powers with proposed cap on international transaction fees",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-4567181590578467286",
        "title": "Revolut and Visa Challenge UK Proposal to Cap Interchange Fees",
        "url": "https://www.pymnts.com/legal/2025/revolut-and-visa-challenge-uk-proposal-to-cap-interchange-fees/",
        "site": "pymnts.com",
        "time": 1741381979000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Revolut and Visa reportedly filed legal challenges against the U.K.’s Payment Systems Regulator (PSR), seeking to overturn the regulator’s proposed cap on interchange fees on cross-border online payments. The two companies argue that the regulator overstepped its powers with the plan it proposed in 2023, the Financial Times (FT) reported Friday (March 7). Revolut told […] The post Revolut and Visa Challenge UK Proposal to Cap Interchange Fees appeared first on PYMNTS.com. Revolut and Visa reportedly filed legal challenges against the U.K.’s Payment Systems Regulator (PSR), seeking to overturn the regulator’s proposed cap on interchange fees on cross-border online payments. The two companies argue that the regulator overstepped its powers with the plan it proposed in 2023, the Financial Times (FT) reported Friday (March 7). Revolut told the FT, per the report: “We disagree with the PSR’s assessment and believe it has acted beyond its statutory powers in imposing these caps. We have therefore requested the court to review, and ultimately overturn the PSR’s decision.” Visa said in the report: “We respect the PSR’s role as an economic regulator. This narrow legal action is focused only on the PSR’s legal authorization and process related to price setting to ensure a fair and thorough process, and give clarity to the industry. This is critical to future growth and investment in the U.K.” When the PSR announced its proposal to cap interchange fees on cross-border online payments, it said that after the U.K. left the European Union, both Visa and Mastercard raised interchange fees for online transactions between the EU and the U.K. to 1.15% for debit cards and 1.5% for credit cards, saying the hike was needed to contend with fraud and increased competition. “In this market review we have provisionally found that the fees charged by Mastercard and Visa to U.K. businesses which accept payments from within the EEA are likely too high,” Chris Hemsley, who was the PSR’s managing director at the time, said in a Dec. 13, 2023, press release. “In short, at this stage, we do not think this market is working well.” A Mastercard spokesperson provided a statement at the time saying the company did not agree with the PSR’s conclusions, and would “continue to educate them” on the importance of electronic payments to England’s economy. Visa also disputed the PSR’s findings, saying in a statement provided to PYMNTS: “Accepting reliable, secure and innovative digital payments represents enormous value to U.K. businesses, especially when selling overseas.” Friday’s FT report said the legal challenges came at a time when the PSR is being pressured by the government’s efforts to cut red tape and boost growth. The post Revolut and Visa Challenge UK Proposal to Cap Interchange Fees appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "7542432526076432769",
        "title": "Revolut and Visa file legal challenges against UK payments regulator",
        "url": "https://www.ft.com/content/ce16121f-e041-4002-b209-234182d7eab2",
        "site": "ft.com",
        "time": 1741369088000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "6931777218414849139",
            "-4567181590578467286"
        ],
        "description": "Fintech argues watchdog has overstepped its powers with proposed cap on international transaction fees",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5971902660860270924",
        "title": "Blumenthal demands records from Visa on X payment deal - report",
        "url": "https://seekingalpha.com/news/4418597-blumenthal-demands-records-from-visa-on-x-payment-deal-report",
        "site": "seekingalpha.com",
        "time": 1741366293000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "v"
        ],
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-217487685871399318",
        "title": "Sen. Blumenthal asks Visa for records of its payments deal with Elon Musk’s X",
        "url": "https://www.cnbc.com/2025/03/07/blumenthal-asks-visa-for-details-on-elon-musk-x-payments-deal.html",
        "site": "cnbc.com",
        "time": 1741359601000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "v"
        ],
        "similar_stories": [
            "-5971902660860270924"
        ],
        "description": "The Senate request is one of the first signs of scrutiny on Visa after a late January announcement that it had agreed to provide services to X.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-5017742347533279480",
        "title": "Visa and Mastercard Accused of Card Monopoly by UK Watchdog",
        "url": "https://www.pymnts.com/antitrust/2025/visa-mastercard-accused-card-monopoly-united-kingdom-payment-systems-regulator/",
        "site": "pymnts.com",
        "time": 1741272081000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa and Mastercard face regulatory action in the United Kingdom following a payments watchdog’s investigation. The Payment Systems Regulator (PSR) is considering “remedies” for the two companies after uncovering a lack of competition in the card payment market, according to a Thursday (March 6) press release. “Cards are a popular and convenient way to make […] The post Visa and Mastercard Accused of Card Monopoly by UK Watchdog appeared first on PYMNTS.com. Visa and Mastercard face regulatory action in the United Kingdom following a payments watchdog’s investigation. The Payment Systems Regulator (PSR) is considering “remedies” for the two companies after uncovering a lack of competition in the card payment market, according to a Thursday (March 6) press release. “Cards are a popular and convenient way to make payments in the U.K., so any issues in the card market can have a negative impact on … businesses and ultimately consumers,” PSR Managing Director David Geale said in the release. “We have found that there is a lack of competition in the market and evidence that Mastercard and Visa might have been able to charge U.K. businesses millions of pounds more than they would in a properly competitive market, impacting on their ability to invest and grow.” The findings showed that Visa and Mastercard face “ineffective competitive constraints” in supplying scheme and processing services to acquirers and merchants, the release said. Fees have jumped by at least 25% since 2017, costing U.K. businesses at least an extra 170 million pounds (about $219 million) per year. The companies have not offered “sufficiently clear and detailed information” on fees, leading to worsening outcomes for merchants and acquirers, especially in terms of raising their costs, per the release. “They then have little choice but to either pass these increased costs onto consumers or incur the costs themselves, impacting their ability to invest,” the release said. Reached for comment by PYMNTS, a Visa spokesperson said the company’s fees reflect the “immense value” the company provides merchants, consumers and financial institutions. “This includes extremely high levels of security and fraud prevention, near-perfect operational resilience and reliability, and a wide range of consumer protections and high-quality products and services that serve consumer and merchant needs,” the company said. “Through our investments, the U.K. has been a global pioneer in payments technology.” Mastercard did not reply to PYMNTS’ request for comment. The PSR’s action came as Mastercard’s and Visa’s place in the marketplace is being called into question elsewhere. For example, November brought a report that the European Commission was investigating whether the companies’ “scheme fees” were harming retailers. Also in November, the Senate Judiciary Committee convened a hearing on Visa’s and Mastercard’s fees, with Sen. Dick Durbin of Illinois, then-chair of the committee, accusing the companies of having a “stranglehold” on the credit card market. The post Visa and Mastercard Accused of Card Monopoly by UK Watchdog appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "4079606004434902958",
        "title": "Visa and Mastercard face regulatory ‘remedies’ over lack of competition",
        "url": "https://www.ft.com/content/a6145cab-3af5-42f6-83e0-6718d6563abd",
        "site": "ft.com",
        "time": 1741250820000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "v"
        ],
        "description": "UK payments regulator says card duopoly’s sharp fee increases are costing businesses £170mn",
        "tickers": [
            "v"
        ]
    },
    {
        "id": "-3012110645060249975",
        "title": "Visa Offers Mobile Commercial Payments Tool to Emirates NBD",
        "url": "https://www.pymnts.com/partnerships/2025/visa-offers-mobile-commercial-payments-tool-emirates-nbd/",
        "site": "pymnts.com",
        "time": 1741198224000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "v"
        ],
        "description": "Visa teamed with Dubai-based bank Emirates NBD to launch a commercial payment solution. The partnership makes Emirates NBD the first bank in the United Arab Emirates to offer Visa’s Commercial Pay Mobile module for its small business and corporate clients, according to a Wednesday (March 5) press release. “This initiative aligns with the UAE government’s […] The post Visa Offers Mobile Commercial Payments Tool to Emirates NBD appeared first on PYMNTS.com. Visa teamed with Dubai-based bank Emirates NBD to launch a commercial payment solution. The partnership makes Emirates NBD the first bank in the United Arab Emirates to offer Visa’s Commercial Pay Mobile module for its small business and corporate clients, according to a Wednesday (March 5) press release. “This initiative aligns with the UAE government’s vision of [digitizing] payments while at the same time providing a distinctive and unique proposition to Emirates NBD’s clients to enhance payment efficiencies enabling security, automation and reconciliation through tokenized credentials,” the release said. Visa Commercial Pay Mobile is designed to help corporate clients and small businesses manage expenses, allowing employees to make payments using Visa virtual cards on their mobile devices through digital wallets, according to the release. “…Emirates NBD and Visa’s virtual card capabilities are aimed at revolutionizing payments on card rails,” the release said. “These capabilities drive working capital benefits and tokenized solutions through secure channels. Additionally, they provide key insights for real-time decision making, business planning, and enable mobile payments.” The partnership came amid a surge in virtual card issuance, a trend that underscores how the cards are helping shape new commerce ecosystems for businesses and consumers. “The purely digital flow, from card design to issuance to use, underpins new payment experiences,” PYMNTS reported last month. “For the banks and the brands launching card products, the platform approach shortens the time to market to introduce, say, a BNPL card or a B2B-focused instrument that tailors spend management across a supply chain.” The ongoing embrace of credentials and program management through which platforms manage compliance and risk continues to serve as a growth engine for the enablers, as cards and credentials are delivered in real time. The benefits are seeing wider recognition. Among middle-market companies — defined as firms with annual sales of between $50 million to $1 billion — 56% of executives said flexible working capital solutions like virtual cards are essential to managing cash flow during unpredictable times. Still, the market is virtually untapped, as only 3.3% of middle-market firms in North America use virtual cards. For all PYMNTS B2B coverage, subscribe to the daily B2B Newsletter. The post Visa Offers Mobile Commercial Payments Tool to Emirates NBD appeared first on PYMNTS.com.",
        "tickers": [
            "v"
        ]
    }
]