[
    {
        "id": "-5414849719766925300",
        "title": "Celanese upgraded at Wells Fargo on turnaround potential in second half",
        "url": "https://seekingalpha.com/news/4458566-celanese-upgraded-at-wells-fargo-on-turnaround-potential-in-second-half",
        "site": "seekingalpha.com",
        "time": 1750097251000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "163804353877080315",
        "title": "Wix.com upgraded to Overweight due to upcoming products, price increase: Wells Fargo | $WIX",
        "url": "https://seekingalpha.com/news/4458375-wix-com-upgraded-to-overweight-due-to-upcoming-products-price-increase-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1750080137000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1208882349243640582",
        "title": "Green shoots for Sweetgreen as Wells Fargo sees recovery ahead",
        "url": "https://seekingalpha.com/news/4458342-green-shoots-for-sweetgreen-as-wells-fargo-sees-recovery-ahead",
        "site": "seekingalpha.com",
        "time": 1750079056000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2445737031577296473",
        "title": "Consistent Demand for Credit: O'Connor",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/consistent-demand-for-credit-o-connor-video",
        "site": "bloomberg.com",
        "time": 1749837138000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Maureen O'Connor, Global Head of High-Grade Debt Syndicate at Wells Fargo, says market is exceptionally firm for corporate debt and spreads are well-supported in the near-term. She speaks to Bloomberg's Sonali Basak on 'Real Yield.' (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-95531674728817915",
        "title": "Bon Market Whipsawed By Iran Strikes | Real Yield 6/13/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/real-yield-6-13-2025-video",
        "site": "bloomberg.com",
        "time": 1749836677000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Sonali Basak highlights the market-moving news you need to know. Today's guests: Columbia Threadneedle Global Head of Fixed Income Gene Tannuzzo, Nuveen CIO for Global Fixed Income Anders Persson, Wells Fargo Global Head of High-Grade Debt Syndicate Maureen O'Connor, Creditsights Head of Us IG and Macro Strategy Zachary Griffiths. (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6482041079378969481",
        "title": "A 2025 IPO market revival is underway. Big banks are poised to ride the wave",
        "url": "https://www.cnbc.com/2025/06/13/a-2025-ipo-market-rebound-is-underway-banks-should-gear-up-to-ride-the-wave.html",
        "site": "cnbc.com",
        "time": 1749828650000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Goldman Sachs are Wells Fargo are beneficiaries from the trend.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1433408200722557432",
        "title": "Wells Fargo upgrades Zscaler to Overweight as ARR remains on track to hit $5B",
        "url": "https://seekingalpha.com/news/4457946-wells-fargo-upgrades-zscaler-to-overweight-as-arr-remains-on-track-to-hit-5b",
        "site": "seekingalpha.com",
        "time": 1749820032000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5691048098930560574",
        "title": "Big Business Is Abandoning Its Climate Goals",
        "url": "https://www.bloomberg.com/features/2025-corporate-climate-broken-promises/",
        "site": "bloomberg.com",
        "time": 1749819632000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "From Amazon to Wells Fargo, a look at rampant backsliding on climate pledges.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6457472527519967330",
        "title": "Top five key portfolio recommendations for the rest of 2025 – Wells Fargo",
        "url": "https://seekingalpha.com/news/4457352-top-five-key-portfolio-recommendations-for-the-rest-of-2025-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1749663462000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-487312949688096387",
        "title": "Wells Fargo’s 2025 Midyear Outlook: What the future holds for US stocks through 2026",
        "url": "https://seekingalpha.com/news/4457327-wells-fargos-2025-midyear-outlook-what-the-future-holds-for-us-stocks-through-2026",
        "site": "seekingalpha.com",
        "time": 1749657516000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8894643513904959897",
        "title": "These 4 parts of the stock market will outperform through the end of 2025, Wells Fargo says",
        "url": "https://www.businessinsider.com/stock-market-outlook-sp500-winners-top-sectors-tariffs-economy-tech-2025-6",
        "site": "businessinsider.com",
        "time": 1749645195000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo revealed areas of the market it thinks will lead the S&P 500 through the volatility that it's expecting through the rest of 2025. The exterior of the New York Stock Exchange (NYSE) is seen on November 4, 2020 in New YorkKENA BETANCUR/AFP via Getty ImagesWells Fargo identifies four market sectors poised to outperform through the rest of 2025.Financials, aerospace, defense, energy, utilities, and technology are key focus areas.These sectors offer protection against tariff shocks and geopolitical uncertainties.Investing in the stock market in 2025 has been a wild ride, and there's more turbulence to come, according to Wells Fargo. But the firm has identified four corners of the market that are poised to outperform as the remainder of the year unfolds.In Wells Fargo's midyear outlook conference on Tuesday, chief investment officer Darell Cronk and other strategists shared their outlook for the rest of 2025. Wells Fargo has a 6,100 year-end price target for the S&P 500. With the index closing Tuesday at 6,038, just 2% away from all-time highs, the bank sees room for volatility between now and December.Investors looking to bolster their portfolios against tariff shocks and other economic challenges should look to these areas of the market for protection, the bank recommended.FinancialsInvestors might be wishing for rate cuts, but in the meantime, the financials sector is benefitting from elevated borrowing costs. Financials have been a classic beneficiary of the Trump trade, as the president has been pro-deregulation.Sameer Samana, senior global market strategist, pointed to a steepening yield curve and robust loan growth as tailwinds for banks.Wells Fargo is bullish on the transactions and payment processing subsector, as these companies have high margins and cash flow generation.Aerospace and defenseThe best-performing sector of the S&P 500 year-to-date is industrials, and Wells Fargo expects the corner of the market to continue its outperformance.Specifically within industrials, Tracie McMillion, the bank's head of global asset allocation strategy, likes aerospace and defense companies.\"Aerospace and defense are areas where we think there could actually be a benefit to geopolitical uncertainties,\" McMillion said.These companies tend to have low exposure to tariffs and economic growth concerns. Exposure to these companies can help investors hedge geopolitical risk from not only the trade war but also regional conflicts in Eastern Europe and the Middle East.It's a trade that's worked so far, as the software company Palantir is one of the market's best-performing stocks, having risen 76% this year in large part due to its lucrative government defense contracts.Energy and utilitiesMcMillion recommends reducing exposure to cyclical consumer discretionary stocks and favoring more defensive, domestic-oriented sectors such as energy and utilities. These companies can also provide a hedge against inflation thanks to their ties to real assets like oil.Midstream energy, electric utilities, and renewable energy companies \"operate some of the most difficult-to-replicate assets on the planet, including interstate pipelines and nuclear power plants,\" giving them a competitive advantage, the bank wrote in its midyear outlook report.Utilities companies are also positioned to benefit from increased energy demand from AI technologies and data centers, the bank said.TechnologyTechnology continues to be a stock market winner. Wells Fargo likes the information technology and communication services sectors for their high-quality companies and pricing power.\"We would continue to focus on large caps and mid-caps,\" Cronk said. \"We think they have enough scale to try and pass along pricing with respect to tariffs, and they have better balance sheets.\"Big Tech dominates the ranks of the market's largest companies, making them a safe choice for investors looking to seek refuge in US large cap equities.\"Those should be candidates for purchase on any pullbacks in the markets,\" McMillion said of those sectors.Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6815768520933319361",
        "title": "U.S. economy to avoid recession even after tariff hike - Wells Fargo",
        "url": "https://seekingalpha.com/news/4457110-us-economy-to-avoid-recession-even-after-tariff-hike---wells-fargo",
        "site": "seekingalpha.com",
        "time": 1749631229000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2910178427868903574",
        "title": "Wells Fargo Expects Consumer Loan Growth to Remain Flat or Slow",
        "url": "https://www.pymnts.com/loans/2025/wells-fargo-expects-consumer-loan-growth-remain-flat-slow/",
        "site": "pymnts.com",
        "time": 1749588079000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo reportedly expects consumer loan growth in the United States to remain flat or potentially decrease through the end of the year. [contact-form-7] “I wouldn’t expect large growth on the consumer side in any way, potentially even a net decline,” Wells Fargo Chief Financial Officer Mike Santomassimo said Tuesday (June 10) at the Morgan […] The post Wells Fargo Expects Consumer Loan Growth to Remain Flat or Slow appeared first on PYMNTS.com. Wells Fargo reportedly expects consumer loan growth in the United States to remain flat or potentially decrease through the end of the year. [contact-form-7] “I wouldn’t expect large growth on the consumer side in any way, potentially even a net decline,” Wells Fargo Chief Financial Officer Mike Santomassimo said Tuesday (June 10) at the Morgan Stanley U.S. Financials Conference, according to a Reuters report. When it comes to commercial loans, Santomassimo said the uncertainty around tariffs makes it difficult to predict the sector’s growth this year, according to the report. The news came on the same day it was reported that Citigroup Head of Banking Vis Raghavan said at the same conference that Citigroup is preparing for a possible decline in consumer financial health by putting aside more provisions for potential losses on loans. “Given the macro environment, etc., cost of credit compared to last quarter, we expect to be up a few hundred million,” Raghavan said, adding that the bank’s credit reserve build changes frequently based on its outlook. The Federal Reserve’s May Beige Book released Wednesday (June 4) showed mixed signals across the Federal Reserve districts in terms of consumer credit conditions. Overall, credit standards continued to ease, and loan interest spreads narrowed, indicating increased lending activity. Banking contacts reported healthy credit quality, sustained demand for loans and ongoing success in attracting deposits. Consumer credit data released by the Federal Reserve Friday (June 6) indicated that the aggregate tally of consumer credit surged by $17.9 billion, which outpaced consensus estimates of an $11.4 billion gain. The data indicated that consumers turned to credit to pay for goods and services during an April rush that showed they sped up purchases as tariffs took effect that month, PYMNTS reported at the time. At the Tuesday conference, Santomassimo also said Wells Fargo is seeing that there may be an improvement in dealmaking and that the bank is starting to see “a little bit of share growth,” according to the Reuters report. “We are certainly seeing lots of green shoots in terms of deals that we just wouldn’t have been a part of earlier,” Santomassimo said, per the report, referring to the fact that the bank was released this month from a cap on its assets that was imposed after its fake accounts scandal. The post Wells Fargo Expects Consumer Loan Growth to Remain Flat or Slow appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "3156598609479342859",
        "title": "Meta Platforms ups the ante in the AI race, and Wells Fargo sees 'green shoots' in a key business",
        "url": "https://www.cnbc.com/2025/06/10/meta-platforms-ups-the-ante-in-the-ai-race-and-wells-fargo-sees-green-shoots-in-a-key-business.html",
        "site": "cnbc.com",
        "time": 1749582134000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "-1208882349243640582"
        ],
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3683120182851529605",
        "title": "Micron's HBM4 sample shipment shows strategy in place for 2026 ramp: Wells Fargo",
        "url": "https://seekingalpha.com/news/4456981-microns-hbm4-sample-shipment-shows-strategy-in-place-for-2026-ramp-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1749581604000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4761121054509314919",
        "title": "Nvidia's Grace-Hopper drives supercomputer gains, but AMD holds ground: Wells Fargo",
        "url": "https://seekingalpha.com/news/4456977-nvidias-grace-hopper-drives-supercomputer-gains-but-amd-holds-ground-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1749580051000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-414745100235950567",
        "title": "Jamie Dimon Says Wells Fargo’s Asset Cap Was ‘Grossly Unfair’",
        "url": "https://www.bloomberg.com/news/articles/2025-06-10/jamie-dimon-says-wells-fargo-s-asset-cap-was-grossly-unfair",
        "site": "bloomberg.com",
        "time": 1749577843000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co.’s Federal Reserve-imposed asset cap that restricted its size for more than seven years was “grossly unfair,” said Jamie Dimon, longtime boss of its biggest rival. Jamie Dimon",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6942580795261059013",
        "title": "Wells Fargo CFO lays out growth opportunities from asset cap lift",
        "url": "https://seekingalpha.com/news/4456882-wells-fargo-cfo-lays-out-growth-opportunities-from-asset-cap-lift",
        "site": "seekingalpha.com",
        "time": 1749564053000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2202012770682313618",
        "title": "Wells Fargo Just Got Unshackled. What Next?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/10/wells-fargo-just-got-unshackled-what-next/",
        "site": "forbes.com",
        "time": 1749546000000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The recent uptick follows the announcement from the U.S. Federal Reserve last week stating that Wells Fargo will no longer be bound by the $1.95 trillion asset cap... The recent uptick follows the announcement from the U.S. Federal Reserve last week stating that Wells Fargo will no longer be bound by the $1.95 trillion asset cap...",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6931677225702806910",
        "title": "Can JPMorgan be unionized? Employees turn to their peers at Wells Fargo for advice.",
        "url": "https://www.businessinsider.com/jpmorgan-chase-union-drive-workers-alliance-wells-fargo-pizza-parties-2025-6",
        "site": "businessinsider.com",
        "time": 1749286861000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Outside the JPMorgan headquarters in Manhattan.Momo Takahashi / Business InsiderJPMorgan staffers are organizing a union amid dissatisfaction with return-to-office policies.The unionization effort follows a similar, prolonged attempt at Wells Fargo with limited success.Inside the effort, from free pizza to \"lessons learned\" from Wells Fargo.A budding movement is taking shape to unionize staffers at JPMorgan Chase, America's biggest bank by assets. If the yearslong unionization effort at Wells Fargo is any indication, they could have a long road ahead.Last week, JPMorgan's organizers hosted a virtual meeting with a unionizer who was involved in Wells Fargo's effort to \"share lessons learned,\" according to an email shared with members earlier this week. The Wells Fargo drive, which is also supported by a coalition called the Committee for Better Banks, has stretched on for two years with little success.The meeting resulted in the following advice, according to a post on the JPMC Workers Alliance's official website:\"Build trust before going public.\"\"Use natural workplace conversations (e.g. breaks, lunch, text conversations) to test the waters and build confidence.\"\"Talk outside of work with colleagues to gauge their sentiment.\"\"Keep management in the dark about the process.\"\"Push back against illegal management activity. Managers may not *SPIT: Surveil, Promise, Interfere, or Threaten with respect to unionizing activity or outcomes — but they may not know this.\"\"Reframe the risks to increase confidence: The status quo is the real hazard. Would they fire the whole department?\"JPMorgan's unionization effort was spawned in large part by the bank's return-to-office policies. Earlier this year, JPMorgan summoned the roughly 40% of its workers who were still on a COVID-era hybrid work schedule back to their desks five days a week, kicking off complaints from employees of the Polaris campus, a major technology hub for the firm. Unlike JPMorgan's investment bankers, tech workers had been working from home a couple of days a week.It's unclear how many JPMorgan workers have agreed to unionize as a result, but the JPMC Workers Alliance website boasts members from a number of US states, including New York, Delaware, Florida, Illinois, Ohio, Texas, as well as multiple cities in the United Kingdom.To build support, JPMorgan's organizers have been handing out flyers and hosting events, including a recent pizza party at JPMorgan's massive Polaris campus in Columbus, Ohio, which attracted hundreds of employees. New members are vetted by a group of organizers responsible for confirming their identities and welcoming them to the alliance's group chat on Discord, a messaging app popular with video gamers.The event drew an estimated 250 to 300 workers, said a JPMorgan employee affiliated with the union who requested anonymity to protect his job. As employees lined up to grab a slice, organizers approached them to discuss the labor movement and its goals, this person said.\"Happy International Workers Day,\" read the flyers, which were viewed by Business Insider. \"Did your leadership thank you today? You deserve better.\"The handouts asked questions like:\"Have you had to stand in the rain waiting for the shuttle?\"\"Was 30 days enough notice for you to find child care before RFTO?\" The acronym refers to the full-time return to work.\"Have you struggled to find an open desk?\"Have a tip? Contact this reporter via email at ralexander@businessinsider.com or SMS/Signal at 561-247-5758. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider Outside the JPMorgan headquarters in Manhattan.Momo Takahashi / Business InsiderJPMorgan staffers are organizing a union amid dissatisfaction with return-to-office policies.The unionization effort follows a similar, prolonged attempt at Wells Fargo with limited success.Inside the effort, from free pizza to \"lessons learned\" from Wells Fargo.A budding movement is taking shape to unionize staffers at JPMorgan Chase, America's biggest bank by assets. If the yearslong unionization effort at Wells Fargo is any indication, they could have a long road ahead.Last week, JPMorgan's organizers hosted a virtual meeting with a unionizer who was involved in Wells Fargo's effort to \"share lessons learned,\" according to an email shared with members earlier this week. The Wells Fargo drive, which is also supported by a coalition called the Committee for Better Banks, has stretched on for two years with little success.The meeting resulted in the following advice, according to a post on the JPMC Workers Alliance's official website:\"Build trust before going public.\"\"Use natural workplace conversations (e.g. breaks, lunch, text conversations) to test the waters and build confidence.\"\"Talk outside of work with colleagues to gauge their sentiment.\"\"Keep management in the dark about the process.\"\"Push back against illegal management activity. Managers may not *SPIT: Surveil, Promise, Interfere, or Threaten with respect to unionizing activity or outcomes — but they may not know this.\"\"Reframe the risks to increase confidence: The status quo is the real hazard. Would they fire the whole department?\"JPMorgan's unionization effort was spawned in large part by the bank's return-to-office policies. Earlier this year, JPMorgan summoned the roughly 40% of its workers who were still on a COVID-era hybrid work schedule back to their desks five days a week, kicking off complaints from employees of the Polaris campus, a major technology hub for the firm. Unlike JPMorgan's investment bankers, tech workers had been working from home a couple of days a week.It's unclear how many JPMorgan workers have agreed to unionize as a result, but the JPMC Workers Alliance website boasts members from a number of US states, including New York, Delaware, Florida, Illinois, Ohio, Texas, as well as multiple cities in the United Kingdom.To build support, JPMorgan's organizers have been handing out flyers and hosting events, including a recent pizza party at JPMorgan's massive Polaris campus in Columbus, Ohio, which attracted hundreds of employees. New members are vetted by a group of organizers responsible for confirming their identities and welcoming them to the alliance's group chat on Discord, a messaging app popular with video gamers.The event drew an estimated 250 to 300 workers, said a JPMorgan employee affiliated with the union who requested anonymity to protect his job. As employees lined up to grab a slice, organizers approached them to discuss the labor movement and its goals, this person said.\"Happy International Workers Day,\" read the flyers, which were viewed by Business Insider. \"Did your leadership thank you today? You deserve better.\"The handouts asked questions like:\"Have you had to stand in the rain waiting for the shuttle?\"\"Was 30 days enough notice for you to find child care before RFTO?\" The acronym refers to the full-time return to work.\"Have you struggled to find an open desk?\"Have a tip? Contact this reporter via email at ralexander@businessinsider.com or SMS/Signal at 561-247-5758. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2506222821583883052",
        "title": "Wells Fargo, Fed, DOJ v. Google, TikTok Ban: Votes and Verdicts",
        "url": "https://www.bloomberg.com/news/audio/2025-06-06/wells-fargo-fed-doj-v-google-tiktok-ban-votes-and-verdicts",
        "site": "bloomberg.com",
        "time": 1749231334000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The June 3 lifting of Wells Fargo’s asset cap imposed by the Federal Reserve in 2018 was among the key catalysts Bloomberg Intelligence analysts examined this week. BI’s litigation and policy team also discussed Michelle Bowman’s confirmation as Fed vice chair of supervision and what it means for deregulatory efforts for banks like JPMorgan and others. We also discussed closing arguments in the Justice Department’s antitrust case against Google over search, and the possible remedies the company Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1419295767450078012",
        "title": "Wells Fargo calls this e-commerce stock an 'under-the-radar' AI story",
        "url": "https://www.cnbc.com/2025/06/06/wells-fargo-calls-this-e-commerce-stock-an-under-the-radar-ai-story.html",
        "site": "cnbc.com",
        "time": 1749222023000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Analyst Andrew Bauch said this e-commerce company's AI partnerships help set it apart.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5125312389095036161",
        "title": "Wells Fargo sets expansion aspirations after asset cap lifted - report",
        "url": "https://seekingalpha.com/news/4455765-wells-fargo-sets-expansion-aspirations-after-asset-cap-lifted---report",
        "site": "seekingalpha.com",
        "time": 1749123749000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4835751431870901274",
        "title": "Treasuries Rally as Weak Data Reinforce Fed Wagers | The Close 6/04/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-06-04/the-close-6-04-2025-video",
        "site": "bloomberg.com",
        "time": 1749076804000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Mike Santomassimo, Wells Fargo CFO, Steve Quirk, Robinhood Markets, Akayla Gardner, Bloomberg News, Laura Martin, Needham & Company, Tobin Marcus, Wolfe Research, Jess Menton, Bloomberg News, Steve Sosnick, Interactive Brokers, Mickey Drexler, Alex Mill, Mary Ross Gilbert, Bloomberg Intelligence, Daniel Tannebaum, Oliver Wyman, Marvina Robinson, B. Stuyvesant Champagne, Katie Roof, Bloomberg News. (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4543947780367001876",
        "title": "Wells Fargo CFO on Asset Cap Lift, Consumers, Deposits",
        "url": "https://www.bloomberg.com/news/videos/2025-06-04/wells-fargo-cfo-on-asset-cap-lift-consumers-deposits-video",
        "site": "bloomberg.com",
        "time": 1749065674000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo CFO Mike Santomassimo reacts to the bank being released from a Federal Reserve asset cap that has restricted its size for over seven years. Speaking on “Bloomberg The Close,” Santomassimo also discusses the state of consumer spending and Wells Fargo’s deposits business.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7813697948071635023",
        "title": "Stock Movers:CrowdStrike, Wells Fargo, Hewlett Packard (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-04/stock-movers-crowdstrike-wells-fargo-hewlett-packard-podcast",
        "site": "bloomberg.com",
        "time": 1749050591000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 2:42 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3598797047936003236",
        "title": "Wells Fargo reaches ‘pivotal milestone’ as the Fed lifts an unprecedented restriction",
        "url": "https://www.fastcompany.com/91345879/wells-fargo-reaches-pivotal-milestone-fed-lifts-unprecedented-restriction",
        "site": "fastcompany.com",
        "time": 1749050208000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo was released from a punitive, seven-year-long $1.95 trillion cap on its assets on Tuesday after the U.S. Federal Reserve lifted the regulatory measure, allowing the bank to pursue unimpeded growth. The move handed a major victory to CEO Charlie Scharf, who has been cleaning up the bank since taking the top job in 2019, and sent the bank’s shares up 2.7% in after-hours trading as investors anticipated that the bank can now expand. Wells has said it wants to grow in areas such as credit cards, wealth management and commercial banking. “It will be a significant bump for the stock in the near term and also paves the way for long-term growth as they don’t have to manage their business around the asset cap now,” said Brian Mulberry, client portfolio manager at Zacks Investment Management, which holds Wells Fargo stock. The Fed imposed the unprecedented restriction in 2018 following years of high-profile missteps at the bank, including a far-ranging scandal in which employees opened millions of unauthorized accounts for customers. But the Fed said in a statement that the bank had made “substantial progress” in addressing its deficiencies, including improving its governance and risk-management programs, and completing a third-party review of its overhaul. The Fed board voted unanimously to lift the restriction, which was the first time the central bank had directly ordered a bank to stop growing in order to address widespread shortcomings. “This marks the end of a painful period for Wells Fargo, and also serves as a reminder for financial institutions to be sure customer interests are always aligned with growth goals,” said Stephen Biggar, banking analyst at Argus Research in New York. The decision is a major step in the bank’s longstanding efforts to repair the damage from scandals that erupted in 2016, drawing public criticism and billions of dollars in fines. Scharf called the move a “pivotal milestone.” “We are a different and far stronger company today because of the work we’ve done,” he said in a statement, adding that all full-time bank employees will receive a $2,000 award to commemorate the accomplishment. JPMorgan Chase Chief Executive Officer Jamie Dimon praised Scharf, once his protege and a former executive at the bank. “Charlie and his team deserve a lot of credit – having worked extremely hard to resolve the company’s heritage issues,” he said. MAJOR SHIFT While the bank still faces some additional oversight from the Fed as part of the 2018 order, the removal of the asset cap marks a major shift for the nation’s fourth-largest lender, after the scandals ousted multiple executives as regulators piled fines and restrictions on the bank for its wrongdoing. “This … removes a major regulatory overhang,” said Mac Sykes, portfolio manager at Gabelli Funds in New York. “It provides them a reputational boost which is helpful, provides more and different capital allocation opportunities and allows them to grow their balance sheet.” The bank came under regulatory scrutiny for years after scandal erupted in 2016, which revealed the bank also charged unnecessary mortgage fees and forced drivers to buy car insurance they did not need, often to meet sales goals. It paid billions in penalties and was also slapped with lawsuits from customers and shareholders. Before Scharf was hired as CEO, two former chief executives left in the wake of the controversy. The bank became a major focus of criticism in Washington as well, with numerous lawmakers calling for executives to be removed and for the bank possibly to be broken up. The lender cleared numerous consent orders this year, and over a dozen since 2019. Regulators impose consent orders, or public enforcement actions that are often accompanied by fines. The orders instruct banks to fix problems in a timely way. In 2024, Democratic U.S. Senator Elizabeth Warren warned the Fed not to remove the cap until the bank had fixed its risk and compliance issues. “The Fed’s decision to lift Wells Fargo’s asset cap and declare victory despite overwhelming evidence to the contrary is an outrageous giveaway to one of Wall Street’s most derelict banks,” she said on Tuesday. Scharf said last year the asset cap was curtailing the bank’s ability to take in more corporate deposits and expand its trading business at a time when peers have grown. The bank has been managing its wholesale deposits and markets businesses carefully to comply with the cap, and those are areas it would expect to expand when the restrictions are lifted, Scharf told analysts in October. The assets of Wells Fargo peer JPMorgan Chase swelled by nearly $2 trillion since the start of 2018, while those of Bank of America and PNC Financial added about $1 trillion and nearly $200 billion, respectively. Some saw the Fed’s action as good for the overall market. “Whenever you have a situation where stress is reduced or taken away from the system, especially for one of the largest banks in the country, that bodes well for the market and for the economy,” said Adam Sarhan, chief executive of 50 Park Investments in New York. —Pete Schroeder and Nupur Anand, Reuters",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2611714083738119091",
        "title": "Wells Fargo Stock Rises as Fed Lifts Asset Cap After 7 Years",
        "url": "https://www.barrons.com/articles/wells-fargo-asset-cap-lifted-stock-price-d7199f05?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749044640000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4803845568466757732",
        "title": "Stock Movers: Apple, Tesla, Wells Fargo (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-04/stock-movers-apple-tesla-wells-fargo-podcast",
        "site": "bloomberg.com",
        "time": 1749043725000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 4:24 Apple Inc Photographer: Craig Warga/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6285628465350855135",
        "title": "Wells Fargo stock rises as asset cap lift set to unlock new earnings drivers",
        "url": "https://seekingalpha.com/news/4455353-wells-fargo-stock-rises-as-asset-cap-lift-set-to-unlock-new-earnings-drivers",
        "site": "seekingalpha.com",
        "time": 1749042720000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "108725760386046234",
        "title": "These Stocks Are Moving the Most Today: Nvidia, Broadcom, Wells Fargo, Dollar Tree, CrowdStrike, HPE, Guidewire, and More",
        "url": "https://www.barrons.com/articles/stock-movers-c27da7cd?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749038760000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6506259819554341444",
        "title": "Wells Fargo CEO Scharf Enters Growth Era With Eye on Wall Street",
        "url": "https://www.bloomberg.com/news/articles/2025-06-04/wells-fargo-ceo-scharf-enters-growth-era-with-eye-on-wall-street",
        "site": "bloomberg.com",
        "time": 1749038493000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Charlie Scharf can finally play offense. Wells Fargo CEO Charlie Scharf",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3022194368632970199",
        "title": "Wells Fargo’s Asset Cap Has Been a Good Punishment",
        "url": "https://www.bloomberg.com/opinion/articles/2025-06-04/wells-fargo-s-asset-cap-has-been-a-good-punishment",
        "site": "bloomberg.com",
        "time": 1749035350000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The bank has emerged from its deserved reprimand much more disciplined. Regulators should use this tool again. Rehabilitation.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-304351421542186225",
        "title": "Stocks to Watch Wednesday: Nvidia, Wells Fargo, CrowdStrike",
        "url": "https://www.wsj.com/livecoverage/stock-market-today-trump-tariffs-trade-war-06-04-2025/card/stocks-to-watch-wednesday-nvidia-wells-fargo-crowdstrike-rcO0IokhTQZhCBGwpcYe?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1749029901000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1247559146228227347",
        "title": "What's Happening With JPMorgan Stock?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/04/whats-happening-with-jpmorgan-stock/",
        "site": "forbes.com",
        "time": 1749029400000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "In contrast, JPMorgan's competitor Wells Fargo (NYSE: WFC) has risen by 6% over the same duration. So, what has contributed to the strong performance of JPMorgan stock? In contrast, JPMorgan's competitor Wells Fargo (NYSE: WFC) has risen by 6% over the same duration. So, what has contributed to the strong performance of JPMorgan stock?",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1302596340598232382",
        "title": "Trump Blasts Xi, Musk on Tax Bill, Wells Fargo Cap (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-04/trump-blasts-xi-musk-on-tax-bill-wells-fargo-cap-podcast",
        "site": "bloomberg.com",
        "time": 1749029332000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 6:54 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6880372146342406869",
        "title": "Wells Fargo Limits Removed, South Korea's Lee is Sworn In, More",
        "url": "https://www.bloomberg.com/news/audio/2025-06-04/wells-fargo-limits-removed-south-korea-s-lee-is-sworn-in-more",
        "site": "bloomberg.com",
        "time": 1749006162000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 5:03 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-8066597440712322046",
        "title": "Wells Fargo Escapes Asset Cap, Musk Tax Bill Bombshell, More",
        "url": "https://www.bloomberg.com/news/audio/2025-06-04/wells-fargo-escapes-asset-cap-musk-tax-bill-bombshell-more",
        "site": "bloomberg.com",
        "time": 1748999472000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 5:08 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "414190948679811103",
        "title": "How Wells Fargo Emerged From Years of Regulatory Sanctions",
        "url": "https://www.bloomberg.com/news/articles/2025-06-03/why-wells-fargo-s-asset-cap-is-being-lifted-by-the-fed-7-years-after-scandals",
        "site": "bloomberg.com",
        "time": 1748993149000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Punishments imposed by the Fed after a fake-accounts scandal limited the bank’s growth and prompted an overhaul of its business. A customer uses an ATM at a Wells Fargo bank branch in San Francisco.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8616941532943035507",
        "title": "Federal Reserve lifts cap on Wells Fargo after fake account scandal fixes",
        "url": "https://www.axios.com/2025/06/03/wells-fargo-fake-accounts-federal-reserve",
        "site": "axios.com",
        "time": 1748992553000,
        "favicon_url": "https://static.tickertick.com/website_icons/axios.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo is shedding the last major link to the fake accounts scandal that dogged the bank: the Federal Reserve on Tuesday said that it would no longer cap how much the institution could grow. Why it matters: For the first time in seven years, Wells Fargo is free to expand its business — take in more deposits, lend more to businesses and make acquisitions — in ways that might help it better compete on Wall Street.What they're saying: \"The removal of the growth restriction reflects the substantial progress the bank has made in addressing its deficiencies,\" said the Fed, which regulates the bank, in a statement.Flashback: The Fed imposed a $2 trillion asset cap on Wells Fargo in 2018 — the most painful regulatory punishment imposed in the aftermath of the bank's fake accounts scandal.The scandal was the company's biggest in its century-old history: employees opened millions of fake accounts on behalf of consumers who did not authorize them to do so. Zoom in: An aggressive internal sales culture put pressure on employees. \"Spurred by sales targets and compensation incentives, employees boosted sales figures by covertly opening accounts,\" the Consumer Financial Protection Bureau said in 2016. The CFPB was the first federal agency to take crack down on the bank after Los Angeles filed a suit alleging the wrongdoing in 2015.Years of other scandals, record fines, congressional hearings and a criminal investigation followed.State of play: Wells Fargo said the removal of the asset cap was \"a pivotal milestone\" in its transformation.\"We are a different and far stronger company today because of the work we've done,\" said Charlie Scharf, the bank's third CEO since the height of the scandal, in a statement. \"We are excited to continue to move forward with plans to further increase returns and growth in a deliberate manner supported by the processes and cultural changes we have made,\" Scharf said, adding full-time employees would receive $2,000 bonuses. Wells Fargo is shedding the last major link to the fake accounts scandal that dogged the bank: the Federal Reserve on Tuesday said that it would no longer cap how much the institution could grow. Why it matters: For the first time in seven years, Wells Fargo is free to expand its business — take in more deposits, lend more to businesses and make acquisitions — in ways that might help it better compete on Wall Street.What they're saying: \"The removal of the growth restriction reflects the substantial progress the bank has made in addressing its deficiencies,\" said the Fed, which regulates the bank, in a statement.Flashback: The Fed imposed a $2 trillion asset cap on Wells Fargo in 2018 — the most painful regulatory punishment imposed in the aftermath of the bank's fake accounts scandal.The scandal was the company's biggest in its century-old history: employees opened millions of fake accounts on behalf of consumers who did not authorize them to do so. Zoom in: An aggressive internal sales culture put pressure on employees. \"Spurred by sales targets and compensation incentives, employees boosted sales figures by covertly opening accounts,\" the Consumer Financial Protection Bureau said in 2016. The CFPB was the first federal agency to take crack down on the bank after Los Angeles filed a suit alleging the wrongdoing in 2015.Years of other scandals, record fines, congressional hearings and a criminal investigation followed.State of play: Wells Fargo said the removal of the asset cap was \"a pivotal milestone\" in its transformation.\"We are a different and far stronger company today because of the work we've done,\" said Charlie Scharf, the bank's third CEO since the height of the scandal, in a statement. \"We are excited to continue to move forward with plans to further increase returns and growth in a deliberate manner supported by the processes and cultural changes we have made,\" Scharf said, adding full-time employees would receive $2,000 bonuses.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4437439143029264985",
        "title": "Bloomberg Businessweek Daily: Wells Fargo Cap Lifted (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-03/bloomberg-businessweek-daily-wells-fargo-cap-lifted-podcast",
        "site": "bloomberg.com",
        "time": 1748992430000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 44:43 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6968783798466904664",
        "title": "Wells Fargo has finally shed its dunce cap",
        "url": "https://www.ft.com/content/d2753189-89d0-495f-9490-345d47412615",
        "site": "ft.com",
        "time": 1748991257000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "But the chance to catch up to JPMorgan is probably gone forever",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2879427437226853780",
        "title": "Wells Fargo Asset Cap Lifted, Spending Bill Challenges, More",
        "url": "https://www.bloomberg.com/news/audio/2025-06-03/wells-fargo-asset-cap-lifted-spending-bill-challenges-more",
        "site": "bloomberg.com",
        "time": 1748991256000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 5:04 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7202826946063987270",
        "title": "Fed Removes Shackle Imposed on Wells Fargo After Series of Scandals",
        "url": "https://www.nytimes.com/2025/06/03/business/wells-fargo-asset-cap-federal-reserve.html",
        "site": "nytimes.com",
        "time": 1748990523000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "For seven years, the bank was forbidden to grow as punishment for misconduct including creating fraudulent bank accounts and mistakenly seizing homes. “We are a different and far stronger company today,” Wells Fargo’s chief executive, Charles W. Scharf, said.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5389704694141451647",
        "title": "Wells Fargo gets green light from the Fed to grow. What it means for the stock.",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=70d54573-cfa1-4357-bf46-2656aacfd594&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1748987969000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8879550060432926001",
        "title": "Wells Fargo just got a green light from the Fed to grow. Here’s what it means for its business and its stock.",
        "url": "https://www.marketwatch.com/story/wells-fargo-just-got-a-green-light-from-the-fed-to-grow-heres-what-it-means-for-its-business-and-its-stock-ecde4650?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1748987280000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "5389704694141451647"
        ],
        "description": "Wells Fargo & Co. on Tuesday cleared a major obstacle to its growth plans, opening the way for the bank to grow after years of restrictions related to its fake-accounts scandal.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-5714033693445257045",
        "title": "Wells Fargo's asset cap is finally gone. It's the news investors have been waiting for",
        "url": "https://www.cnbc.com/2025/06/03/wells-fargos-asset-cap-is-finally-gone-its-the-news-investors-have-been-waiting-for.html",
        "site": "cnbc.com",
        "time": 1748986146000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The Federal Reserve said Tuesday that Wells will no longer be subjected to a $1.95 trillion asset cap, a punishment brought on by the bank's past misdeeds.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-5377957102683431560",
        "title": "Musk Attacks Trump's Bill, Fed Lifts Wells Fargo Asset Cap, More",
        "url": "https://www.bloomberg.com/news/audio/2025-06-03/musk-attacks-trump-s-bill-fed-lifts-wells-fargo-asset-cap-more",
        "site": "bloomberg.com",
        "time": 1748984670000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 5:45 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1690333282472190299",
        "title": "Stock Movers: Wells Fargo, Broadcom, Dollar General (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-03/stock-movers-wells-fargo-broadcom-dollar-general-podcast",
        "site": "bloomberg.com",
        "time": 1748983190000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "-2248655171138601859",
            "7813697948071635023",
            "4803845568466757732"
        ],
        "description": "Source: Bloomberg, 7:44 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6478964492790884920",
        "title": "Federal Reserve lifts Wells Fargo’s asset cap",
        "url": "https://www.ft.com/content/cbe582d1-4413-4912-b6f0-c73905cd88a5",
        "site": "ft.com",
        "time": 1748982817000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "US central bank had imposed the limit in 2018 after the bank’s fake accounts scandal",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "180727977076079857",
        "title": "Fed Lifts Wells Fargo Asset Cap",
        "url": "https://www.bloomberg.com/news/videos/2025-06-03/fed-lifts-wells-fargo-asset-cap-video",
        "site": "bloomberg.com",
        "time": 1748982706000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo has been released from a Federal Reserve asset cap that has restricted its size for over seven years, allowing the bank to pursue growth again. Sally Bakewell has more on “Bloomberg The Close.” Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2123176520001255011",
        "title": "Wells Fargo's asset cap is lifted by Federal Reserve after seven years",
        "url": "https://seekingalpha.com/news/4455162-wells-fargos-asset-cap-is-lifted-by-federal-reserve-after-seven-years",
        "site": "seekingalpha.com",
        "time": 1748982690000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "3973538261951263567",
        "title": "Wells Fargo’s Asset Cap Lifted by Fed, Paving Way for Growth",
        "url": "https://www.bloomberg.com/news/articles/2025-06-03/wells-fargo-s-asset-cap-lifted-by-fed-paving-way-for-growth",
        "site": "bloomberg.com",
        "time": 1748980803000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. finally escaped a Federal Reserve asset cap that has restricted its size for more than seven years, unleashing the firm from the unprecedented punishment in a major win for Chief Executive Officer Charlie Scharf. A Wells Fargo bank branch in New York. Photographer: Jeenah Moon/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8519650014455784003",
        "title": "Cardinal Health, Cencora upgraded at Wells Fargo on industry outlook",
        "url": "https://seekingalpha.com/news/4455065-cardinal-health-stock-cencora-stock-upgraded-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1748967389000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-5287738516531248984",
        "title": "The U.S. dollar will stabilize after 10% decline – Wells Fargo’s Scott Wren",
        "url": "https://seekingalpha.com/news/4454428-the-u-s-dollar-will-stabilize-after-10-percent-decline-wells-fargo-s-scott-wren",
        "site": "seekingalpha.com",
        "time": 1748880132000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-22006607380006076",
        "title": "Regeneron slumps as Wells Fargo cuts on COPD trial data",
        "url": "https://seekingalpha.com/news/4453927-regeneron-stock-downgraded-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1748617263000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4591776143285141945",
        "title": "Wells Fargo to redeeem $450M of capital securities",
        "url": "https://seekingalpha.com/news/4453907-wells-fargo-to-redeeem-450m-of-capital-securities",
        "site": "seekingalpha.com",
        "time": 1748615831000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3782575916052286391",
        "title": "5 stocks to watch on Friday: NTAP, PD, WFC, CVS and CI | $CVS $NTAP $CI $WFC $PD",
        "url": "https://seekingalpha.com/news/4453844-5-stocks-to-watch-on-friday-ntap-pd-wfc-cvs-and-ci",
        "site": "seekingalpha.com",
        "time": 1748611267000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "309745229866154856",
        "title": "Wells Fargo Agrees to Sell Railcar Assets to Brookfield, GATX",
        "url": "https://www.bloomberg.com/news/articles/2025-05-29/wells-fargo-agrees-to-sell-railcar-assets-to-brookfield-gatx",
        "site": "bloomberg.com",
        "time": 1748556051000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. agreed to sell the assets of its rail equipment leasing business to a venture between Brookfield Infrastructure Partners and GATX Corp. as the bank continues to refocus on its core lending and advisory businesses. Gravel in railcars at a Union Pacific rail terminal in City of Industry, California, US, on Thursday, Dec. 1, 2022. The House passed legislation aimed at averting a crippling nationwide US freight rail strike, sending it to the Senate, which could take action as soon as this week. Photographer: Bing Guan/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8421096610702767460",
        "title": "Wells Fargo to sell assets of rail equipment leasing unit",
        "url": "https://seekingalpha.com/news/4453657-wells-fargo-to-sell-assets-of-rail-equipment-leasing-unit",
        "site": "seekingalpha.com",
        "time": 1748551523000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2041748577300991907",
        "title": "Wells Fargo confirms termination of 2015 regulatory agreements on previously-held subsidiaries",
        "url": "https://seekingalpha.com/news/4453606-wells-fargo-confirms-termination-of-2015-regulatory-agreements-on-previously-held-subsidiaries",
        "site": "seekingalpha.com",
        "time": 1748550236000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8734855935777281212",
        "title": "Wells Fargo Nears End of Scandal Era With Just Fed Cap Remaining",
        "url": "https://www.bloomberg.com/news/articles/2025-05-29/wells-fargo-nears-end-of-scandal-era-with-just-fed-cap-remaining",
        "site": "bloomberg.com",
        "time": 1748545196000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. resolved another regulatory punishment, the seventh this year, as the Office of the Comptroller of the Currency terminated its 2015 agreements relating to the company’s previously held financial subsidiaries. A Wells Fargo bank branch in New York.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-9043859435753334234",
        "title": "Municipal bonds offer a “triple threat” of benefits as tax exemption risks fade – Wells Fargo",
        "url": "https://seekingalpha.com/news/4453479-municipal-bonds-offer-a-triple-threat-of-benefits-as-tax-exemption-risks-fade-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1748528632000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8978940278772939738",
        "title": "HCA, Tenet upgraded at Wells Fargo on receding policy risks for hospitals | $HCA $THC $CYH $UHS",
        "url": "https://seekingalpha.com/news/4453410-hca-stock-tenet-stock-upgraded-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1748525713000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7013105918374469752",
        "title": "Zeal Capital Partners announces close of $82M Fund II",
        "url": "https://techcrunch.com/2025/05/29/zeal-capital-partners-announces-close-of-82m-fund-ii/",
        "site": "techcrunch.com",
        "time": 1748524046000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Zeal Capital Partners announced on Wednesday the close of its second fund, raising $82 million. Limited partners in the fund include Citi Impact Fund, M&T Bank, Wells Fargo, and Spelman College. It hopes to invest in at least 25 early-stage companies, writing check sizes between $1 million and $2.3 million, with 50% of the fund […]",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1659389448663432360",
        "title": "Wells Fargo is 'very, very confident' it's close to getting asset cap lifted, CEO says",
        "url": "https://seekingalpha.com/news/4453037-wells-fargo-is-very-very-confident-its-close-to-getting-asset-cap-lifted-ceo-says",
        "site": "seekingalpha.com",
        "time": 1748452218000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "3590828633533750585",
        "title": "Wells Fargo Confident on Its Work for Asset-Cap Lift, CEO Says",
        "url": "https://www.bloomberg.com/news/articles/2025-05-28/wells-fargo-confident-on-its-work-for-asset-cap-lift-ceo-says",
        "site": "bloomberg.com",
        "time": 1748439422000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "-414745100235950567",
            "-6942580795261059013",
            "5125312389095036161",
            "-4543947780367001876",
            "-6078571099820604782",
            "-2611714083738119091",
            "-6285628465350855135",
            "4851386023528774153",
            "-3022194368632970199",
            "-1302596340598232382",
            "-8066597440712322046",
            "8616941532943035507",
            "-6968783798466904664",
            "-2879427437226853780",
            "7202826946063987270",
            "-5714033693445257045",
            "-5377957102683431560",
            "6478964492790884920",
            "180727977076079857",
            "2123176520001255011",
            "3973538261951263567",
            "1659389448663432360"
        ],
        "description": "Wells Fargo & Co. is far along the path to fulfill requirements for the Federal Reserve to ultimately end a growth ban that’s hung over the bank for more than seven years, Chief Executive Officer Charlie Scharf said. Customers at a Wells Fargo bank branch in San Francisco.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7099176612625989137",
        "title": "Expro initiated at Overweight at Wells Fargo, citing attractive and rising free cash flow yield",
        "url": "https://seekingalpha.com/news/4452656-expro-initiated-at-overweight-at-wells-fargo-citing-attractive-and-rising-free-cash-flow",
        "site": "seekingalpha.com",
        "time": 1748371952000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5350239951651531757",
        "title": "Williams reiterated Top Pick at Wells Fargo, seeing growth accelerate to double digits",
        "url": "https://seekingalpha.com/news/4452646-williams-reiterated-top-pick-at-wells-fargo-seeing-growth-accelerate-to-double-digits",
        "site": "seekingalpha.com",
        "time": 1748370735000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-535053759964357119",
        "title": "Circle’s IPO Goals Hinge on Becoming Digital Money’s Infrastructure Layer",
        "url": "https://www.pymnts.com/news/ipo/2025/circle-ipo-goals-hinge-becoming-digital-money-infrastructure-layer/",
        "site": "pymnts.com",
        "time": 1748359261000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Each week, the evolution of the ongoing cryptocurrency-FinTech convergence seems to get another headline to hang its hat on. Last week, it was the news Thursday (May 22) that J.P. Morgan Chase, Bank of America, Wells Fargo and Citigroup are exploring the launch of a jointly operated stablecoin. This week, it is the news Tuesday […] The post Circle’s IPO Goals Hinge on Becoming Digital Money’s Infrastructure Layer appeared first on PYMNTS.com. Each week, the evolution of the ongoing cryptocurrency-FinTech convergence seems to get another headline to hang its hat on. Last week, it was the news Thursday (May 22) that J.P. Morgan Chase, Bank of America, Wells Fargo and Citigroup are exploring the launch of a jointly operated stablecoin. This week, it is the news Tuesday (May 27) that Circle, the issuer of the USDC stablecoin, filed for an initial public offering (IPO) on the New York Stock Exchange under the ticker symbol “CRCL.” Circle is hoping for a valuation of $5.65 billion with an offering price target of $24 to $26 per share. The lead underwriters are J.P. Morgan, Citigroup and Goldman Sachs. Circle is betting that the credibility conferred by becoming a public company will help the company in a financial environment skeptical of opaque crypto firms. Transparency is a key pillar of Circle’s pitch to institutional clients as outlined in its S-1 filing with the Securities and Exchange Commission. By going public, Circle will subject itself to the scrutiny of U.S. securities laws, quarterly earnings reports and regulatory disclosures, all elements designed to engender trust from risk-averse enterprises, banks and governments. Circle’s goal for its IPO is to position itself favorably to become the financial utility layer of the internet. Think Amazon Web Services (AWS) for money movement or a SWIFT network reimagined for digital assets. To get there, Circle may need to evolve beyond being a stablecoin issuer. Elements such as programmable money services, secure identity layers, robust compliance automation and user-friendly APIs could be crucial since institutional trust is hard-won and easily lost. See also: Keeping Stablecoins Stable is Complicated: Why CFOs Need to Pay Attention Stablecoin Competition Is Getting Crowded The stablecoin arena is no longer the wild frontier it once was. Circle must now contend with legacy finance and FinTech upstarts. PayPal launched PYUSD, and traditional banking consortia are mulling their own. Tether remains the volume leader globally, especially outside the United States. Circle’s edge lies in its U.S.-compliant stance and focus on transparency and fiat backing. But whether that will be enough to ward off better capitalized or more broadly distributed competitors is uncertain. The potential IPO valuation and capital war chest may help, but only if Circle is able to move quickly to entrench itself as the preferred partner for enterprises. Circle’s S-1 offers insight into its revenue model, revealing an interest-sensitive business. In 2024, the company earned $1.68 billion in total revenue, with 99% of that coming from interest income on reserves backing USDC. That figure underscores how tightly Circle’s fortunes could be tied to interest rate policy. As a practical matter, Circle earns this income by parking USDC reserves in short-term U.S. Treasury securities and overnight reverse repurchase agreements. The downside is that if interest rates fall, so too does Circle’s revenue. According to its filing, a 1% drop in rates could slash income by as much as $441 million. Stablecoins have started to decouple themselves from crypto exchanges and position themselves as a component of real-world financial infrastructure, PYMNTS reported in March. Additionally, stablecoin market capitalization reached an all-time high amid strong performance across crypto sectors in April. Read also: Smaller Banks Face Urgent Crypto Decisions Regulation Remains Crypto’s Looming Wildcard Circle’s IPO plans can also be seen as a part of a broader movement among other major crypto firms seeking to capitalize on a more pro-crypto, pro-business regulatory climate under the President Donald Trump administration. The SEC, for example, said it is eying regulatory changes to accommodate on-chain securities and other crypto assets. Meanwhile, the Guiding and Establishing National Innovation for U.S. Stablecoins of 2025 (GENIUS) Act, the country’s first stablecoin legislation, is proceeding through the Senate amid recognition in Washington that stablecoins are too big to ignore. Still, the GENIUS Act could include a provision prohibiting interest-bearing stablecoins. The Circle S-1 flags multiple legal risks, but chief among them is the uncertain U.S. regulatory environment for stablecoins. To diversify its business model, Circle this month brought the Circle Payments Network (CPN) live. Designed to facilitate the use of stablecoins for mainstream cross-border payments, the network and coordination protocol enables financial institutions to exchange payment instructions and settle transactions on open, public blockchains. Early adopters of CPN include Alfred Pay, which is using the network to enable stablecoin-to-fiat offramps via PIX and SPEI; Tazapay, which is using it to support compliant fiat disbursements into Hong Kong; RedotPay, which is using the network to initiate USDC-based payments into Brazil; and Conduit, which is using it to onramp fiat into USDC in the U.S. and Europe to support B2B flows into Mexico. The post Circle’s IPO Goals Hinge on Becoming Digital Money’s Infrastructure Layer appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2075941884954271028",
        "title": "Tariffs won't bring manufacturing jobs back to America, Wells Fargo analysts say",
        "url": "https://www.businessinsider.com/tariffs-wont-bring-manufacturing-jobs-back-wells-fargo-analysts-say-2025-5",
        "site": "businessinsider.com",
        "time": 1747967506000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo says in a report that President Donald Trump's tariffs won't bring manufacturing back.Carlos Barria/REUTERSWells Fargo said in a report that President Donald Trump's tariffs won't bring manufacturing back.High labor costs and a lack of workers would make building more factories an \"uphill battle.\"US manufacturing needs $2.9 trillion in investment to reach 1979 employment levels.President Donald Trump's push to revive American manufacturing through tariffs may face some hurdles.Despite some high-profile commitments, including Nvidia's plans for a US-based supercomputer plant and Apple's pledge to invest $500 billion domestically, a new report from Wells Fargo economists predicts that bringing back offshored manufacturing jobs will be an \"uphill battle.\"\"An aim of tariffs is to spur a durable rebound in US manufacturing employment,\" Wells Fargo analysts wrote in the report. \"However, a meaningful increase in factory jobs does not appear likely in the foreseeable future, in our view.\"The report attributes the potentially low factory job growth to high labor costs, a lack of suitable workers to fill vacant positions, and a subdued population growth from lower fertility rates and slower immigration.\"Higher prices and policy uncertainty may weigh on firms' ability and willingness to expand payrolls,\" the analysts added.The tariffs are part of Trump's broader economic agenda to revive American manufacturing as a pathway toward middle-class prosperity. The tariffs are meant to hike the costs of imports to incentivize companies to make goods domestically.\"Jobs and factories will come roaring back into our country,\" Trump said while announcing tariffs on April 2. \"And ultimately, more production at home will mean stronger competition and lower prices for consumers.\"Some tariffs imposed on April 2 have been temporarily paused or greatly reduced, including tariffs on China. The 10% across-the-board tariff remains, as do some specific tariffs on Mexico and Canada, plus 30% in duties on China. Duties at their current level are still the highest they have been since the 1940s.\"In order for manufacturing employment to return to its historic peak, we estimate at a minimum $2.9 trillion in net new capital investment is required,\" Wells Fargo analysts wrote. \"Assuming businesses are willing and able to invest such ample sums, questions over staffing remain.\"The Wall Street bank says that US manufacturing employment currently stands at 12.8 million, down from its 1979 peak of 19.5 million. To get back to that mark, the US would need to add roughly 6.7 million jobs. Wells Fargo added that the figure is nearly the same as the entire pool of unemployed Americans, which in April was 7.2 million, according to the US Bureau of Labor Statistics.\"Population aging, negative perceptions, and skill mismatches also underpin workforce concerns,\" Wells Fargo analysts wrote. \"New jobs will require different skills than those previously lost.\"In 2024, Taiwanese chipmaker TSMC said it delayed the opening of its Arizona chip factory due to a shortage of skilled workers. A report released in April 2024 by Deloitte and the Manufacturing Institute also found that nearly half of the 3.8 million new manufacturing jobs anticipated by 2033 could remain unfilled due to skill gaps and other population factors.\"Tariffs must be high enough to make the cost of domestic production competitive in the US market, and they also must be kept in place long enough for producers to bring on additional workers and expand capacity,\" the report concluded. \"If the economic or political costs are deemed too high, the current administration could quickly dial-back prevailing duties further.\"The White House did not immediately respond to a request for comments.Read the original article on Business Insider Wells Fargo says in a report that President Donald Trump's tariffs won't bring manufacturing back.Carlos Barria/REUTERSWells Fargo said in a report that President Donald Trump's tariffs won't bring manufacturing back.High labor costs and a lack of workers would make building more factories an \"uphill battle.\"US manufacturing needs $2.9 trillion in investment to reach 1979 employment levels.President Donald Trump's push to revive American manufacturing through tariffs may face some hurdles.Despite some high-profile commitments, including Nvidia's plans for a US-based supercomputer plant and Apple's pledge to invest $500 billion domestically, a new report from Wells Fargo economists predicts that bringing back offshored manufacturing jobs will be an \"uphill battle.\"\"An aim of tariffs is to spur a durable rebound in US manufacturing employment,\" Wells Fargo analysts wrote in the report. \"However, a meaningful increase in factory jobs does not appear likely in the foreseeable future, in our view.\"The report attributes the potentially low factory job growth to high labor costs, a lack of suitable workers to fill vacant positions, and a subdued population growth from lower fertility rates and slower immigration.\"Higher prices and policy uncertainty may weigh on firms' ability and willingness to expand payrolls,\" the analysts added.The tariffs are part of Trump's broader economic agenda to revive American manufacturing as a pathway toward middle-class prosperity. The tariffs are meant to hike the costs of imports to incentivize companies to make goods domestically.\"Jobs and factories will come roaring back into our country,\" Trump said while announcing tariffs on April 2. \"And ultimately, more production at home will mean stronger competition and lower prices for consumers.\"Some tariffs imposed on April 2 have been temporarily paused or greatly reduced, including tariffs on China. The 10% across-the-board tariff remains, as do some specific tariffs on Mexico and Canada, plus 30% in duties on China. Duties at their current level are still the highest they have been since the 1940s.\"In order for manufacturing employment to return to its historic peak, we estimate at a minimum $2.9 trillion in net new capital investment is required,\" Wells Fargo analysts wrote. \"Assuming businesses are willing and able to invest such ample sums, questions over staffing remain.\"The Wall Street bank says that US manufacturing employment currently stands at 12.8 million, down from its 1979 peak of 19.5 million. To get back to that mark, the US would need to add roughly 6.7 million jobs. Wells Fargo added that the figure is nearly the same as the entire pool of unemployed Americans, which in April was 7.2 million, according to the US Bureau of Labor Statistics.\"Population aging, negative perceptions, and skill mismatches also underpin workforce concerns,\" Wells Fargo analysts wrote. \"New jobs will require different skills than those previously lost.\"In 2024, Taiwanese chipmaker TSMC said it delayed the opening of its Arizona chip factory due to a shortage of skilled workers. A report released in April 2024 by Deloitte and the Manufacturing Institute also found that nearly half of the 3.8 million new manufacturing jobs anticipated by 2033 could remain unfilled due to skill gaps and other population factors.\"Tariffs must be high enough to make the cost of domestic production competitive in the US market, and they also must be kept in place long enough for producers to bring on additional workers and expand capacity,\" the report concluded. \"If the economic or political costs are deemed too high, the current administration could quickly dial-back prevailing duties further.\"The White House did not immediately respond to a request for comments.Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7730672982001303786",
        "title": "Dillard’s Sues Wells Fargo, Alleging Breach of Co-Branded Credit Card Relationship",
        "url": "https://www.pymnts.com/credit-cards/2025/dillards-sues-wells-fargo-alleging-breach-of-co-branded-credit-card-relationship/",
        "site": "pymnts.com",
        "time": 1747966403000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Department store chain Dillard’s sued Wells Fargo on Thursday (May 22), alleging that the bank breached a co-branded credit card relationship that has since ended. Dillard’s alleges that this breach cost it tens of millions of dollars, Reuters reported Thursday, citing a “heavily redacted complaint” filed in Manhattan federal court. Neither Dillard’s nor Wells Fargo […] The post Dillard’s Sues Wells Fargo, Alleging Breach of Co-Branded Credit Card Relationship appeared first on PYMNTS.com. Department store chain Dillard’s sued Wells Fargo on Thursday (May 22), alleging that the bank breached a co-branded credit card relationship that has since ended. Dillard’s alleges that this breach cost it tens of millions of dollars, Reuters reported Thursday, citing a “heavily redacted complaint” filed in Manhattan federal court. Neither Dillard’s nor Wells Fargo immediately replied to PYMNTS’ request for comment. According to the Reuters report, Dillard’s alleges that Wells Fargo became an “unwilling and incapable partner” after reaching consent orders with the Consumer Financial Protection Bureau (CFPB) and the Federal Reserve in 2016 and 2018 and then effectively abandoned the co-branded card market in June without telling Dillard’s. Dillard’s also alleges that Wells Fargo’s “bad-faith conduct” continued during the termination process that followed, per the report. The department store announced in a January 2024 press release that it, Citi and Mastercard entered into new credit card agreements in which Citi would purchase the existing Dillard’s credit card accounts and Mastercard would serve as the exclusive payment network for co-branded cards for Dillard’s customers. The release said that the new co-branded card would replace the existing one and that Citi would provide customer service and other functions related to the program. “Our customers expect and deserve the highest level of customer care at Dillard’s and that includes providing premium credit services,” Dillard’s President Alex Dillard said in the January 2024 press release. “We are confident we have aligned ourselves with the best in the business to offer first-class credit choices and exceptional cardholder experiences at Dillard’s for years to come.” Wells Fargo has been struggling with regulatory issues for the better part of a decade following the “fake accounts” scandal at the bank in 2016. The Federal Reserve also placed an asset cap on the lender in 2018. In April, Wells Fargo said the CFPB terminated a consent order related to the bank’s compliance risk management program. The order was issued in 2018 and was the 12th consent order closed by regulators since 2019 and the sixth since the start of the year. The bank’s efforts to regain compliance have fostered hopes that the asset cap could soon be lifted. The post Dillard’s Sues Wells Fargo, Alleging Breach of Co-Branded Credit Card Relationship appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2639970453454962466",
        "title": "Sources: companies co-owned by JPMorgan Chase, BOA, Citigroup, Wells Fargo, and other large commercial banks are exploring whether to issue a joint stablecoin (Wall Street Journal)",
        "url": "http://www.techmeme.com/250522/p57#a250522p57",
        "site": "techmeme.com",
        "time": 1747964101000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wall Street Journal: Sources: companies co-owned by JPMorgan Chase, BOA, Citigroup, Wells Fargo, and other large commercial banks are exploring whether to issue a joint stablecoin — The discussions involve payments companies co-owned by JPMorgan Chase, other large banks — The nation's biggest banks …",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5494604431582935164",
        "title": "Trump's tariffs won't lead to a resurgence of U.S. manufacturing jobs, Wells Fargo analysis says",
        "url": "https://www.cnbc.com/2025/05/22/trump-tariffs-wont-revive-us-factory-jobs-wells-fargo-analysis-says.html",
        "site": "cnbc.com",
        "time": 1747925608000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "2075941884954271028"
        ],
        "description": "\"A meaningful increase in factory jobs does not appear likely in the foreseeable future, in our view,\" Wells Fargo said.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7685598030098132095",
        "title": "Westlake downgraded at Wells Fargo amid tariff uncertainty",
        "url": "https://seekingalpha.com/news/4450743-westlake-downgraded-at-wells-fargo-amid-tariff-uncertainty",
        "site": "seekingalpha.com",
        "time": 1747777111000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1406639048832479352",
        "title": "Muni bonds have a buying opportunity amid tax exemption concerns – Wells Fargo",
        "url": "https://seekingalpha.com/news/4450586-muni-bonds-have-a-buying-opportunity-amid-tax-exemption-concerns-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1747761250000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "-9043859435753334234"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4459260849524438068",
        "title": "AI server demand maintains momentum as PC remains sluggish: Wells Fargo",
        "url": "https://seekingalpha.com/news/4450531-ai-server-demand-maintains-momentum-as-pc-remains-sluggish-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1747755645000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2832515553495117106",
        "title": "Emerging markets are up 10% YTD, but Wells Fargo analysts are skeptical",
        "url": "https://seekingalpha.com/news/4450545-emerging-markets-are-up-10-percent-ytd-but-wells-fargo-analysts-are-skeptical",
        "site": "seekingalpha.com",
        "time": 1747755280000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5920849483414837729",
        "title": "SAP initiated with bullish views at Wells Fargo",
        "url": "https://seekingalpha.com/news/4450505-sap-initiated-with-bullish-views-at-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1747750775000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-751307677462937854",
        "title": "Why Wells Fargo expects the emerging-markets outperformance to reverse",
        "url": "https://www.marketwatch.com/story/why-wells-fargo-expects-the-emerging-markets-outperformance-to-reverse-3a89b406?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1747750200000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "This year, emerging-market equities have outperformed the S&P 500 by a wide margin and investors have debated whether the relative strength can be sustained. A new report by Wells Fargo analyst Austin Pickle expects the trend to reverse.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5749819372631451059",
        "title": "Wells Fargo Says to Buy US Stocks and Cut EM After Strong Rally",
        "url": "https://www.bloomberg.com/news/articles/2025-05-20/wells-fargo-says-to-buy-us-stocks-and-cut-em-after-strong-rally",
        "site": "bloomberg.com",
        "time": 1747707173000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Investors should reduce their holdings of emerging market equities and buy US stocks instead, according to Wells Fargo & Co.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1426464800209496795",
        "title": "Moody's downgrades BofA, JPMorgan, Wells Fargo, other big banks after U.S. credit cut",
        "url": "https://seekingalpha.com/news/4450213-moodys-downgrades-bofa-jpmorgan-wells-fargo-other-big-banks-after-us-credit-cut",
        "site": "seekingalpha.com",
        "time": 1747680421000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1190353638332800276",
        "title": "Wells Fargo cuts rating on Reddit as Google's AI search potential poses threat",
        "url": "https://seekingalpha.com/news/4450114-wells-fargo-cuts-rating-on-reddit-as-googles-ai-search-potential-poses-threat",
        "site": "seekingalpha.com",
        "time": 1747673641000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6127673156017074951",
        "title": "Wells Fargo, BofA Lead $650 Million Refinancing for Boston Tower",
        "url": "https://www.bloomberg.com/news/articles/2025-05-16/wells-fargo-bofa-lead-650-million-refinancing-for-boston-tower",
        "site": "bloomberg.com",
        "time": 1747422908000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "A newly built office tower in downtown Boston has landed a $650 million refinancing. One Congress in Boston",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1878416630344900430",
        "title": "Wells Fargo: U.S. will avoid recession, maintain exceptionalism amid shifting policies",
        "url": "https://seekingalpha.com/news/4448829-wells-fargo-u-s-will-avoid-recession-maintain-exceptionalism-amid-shifting-policies",
        "site": "seekingalpha.com",
        "time": 1747318408000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7572656716210003640",
        "title": "Omnicell upgraded at Wells Fargo on positive risk-reward setup | $OMCL",
        "url": "https://seekingalpha.com/news/4448247-omnicell-stock-upgraded-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1747249292000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4984795389246051032",
        "title": "Micron expects demand to remain in-line with earlier expectations despite tariffs: Wells Fargo",
        "url": "https://seekingalpha.com/news/4448209-micron-expects-demand-to-remain-in-line-with-earlier-expectations-despite-tariffs-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1747245706000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "-6815768520933319361"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6056524929490942801",
        "title": "Mayo Sees JPMorgan Becoming $1 Trillion Bank Within Three Years",
        "url": "https://www.bloomberg.com/news/articles/2025-05-12/mayo-sees-jpmorgan-becoming-1-trillion-bank-within-three-years",
        "site": "bloomberg.com",
        "time": 1747063501000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "JPMorgan Chase & Co. could become the first bank to reach a $1 trillion market capitalization within the next three years, according to Wells Fargo. A JPMorgan Chase & Co. bank branch in Jersey City, New Jersey, US, on Monday, April 7, 2025. JPMorgan Chase & Co. is scheduled to release earnings figures on April 11. Photographer: Bing Guan/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1860398335720663484",
        "title": "International Paper cut to Sell equivalent at Wells Fargo on weak containerboard fundamentals",
        "url": "https://seekingalpha.com/news/4445896-international-paper-cut-to-sell-equivalent-at-wells-fargo-on-weak-containerboard-fundamentals",
        "site": "seekingalpha.com",
        "time": 1746810372000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7179497201535295653",
        "title": "Wells Fargo Has Big Plans for New York Branches as Scandals Fade",
        "url": "https://www.bloomberg.com/news/articles/2025-05-09/wells-fargo-has-big-plans-for-new-york-branches-as-scandals-fade",
        "site": "bloomberg.com",
        "time": 1746792000000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Inside Wells Fargo & Co.’s newest branch in New York City, steps from Central Park, Charlie Scharf was talking up plans to expand his bank’s network across the Big Apple. Wells Fargo’s new branch on the upper west side of New York.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1332293000410017656",
        "title": "Wells Fargo issues a warning on containerboard stocks",
        "url": "https://seekingalpha.com/news/4445631-wells-fargo-issues-a-warning-on-containerboard-stocks",
        "site": "seekingalpha.com",
        "time": 1746788953000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-969118602136121481",
        "title": "The CEO of Anastasia Beverly Hills says she had to beg for a $500 credit card before she could start her beauty empire",
        "url": "https://www.businessinsider.com/anastasia-soare-ceo-begged-credit-card-beverly-hills-beauty-milken-2025-5",
        "site": "businessinsider.com",
        "time": 1746688913000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Jason Koerner/Getty ImagesToday, Anastasia Soare is the CEO of the beauty giant Anastasia Beverly Hills.When she was starting out, she had to beg Wells Fargo for a $500 credit card.Soare, an immigrant from Romania, shared her journey of pursuing the American dream at the Milken conference on Wednesday.Before she became the CEO of a global beauty brand with celebrity clients, Anastasia Soare needed a $500 credit card.When she arrived in the US in 1989 as an immigrant, \"nobody paid attention,\" the founder of Anastasia Beverly Hills said. At the time, she was an aesthetician with zero credit history and limited English — and a bold idea that needed backing.\"I went to Wells Fargo and had to beg the manager to give me a $500 credit card,\" she recalled. \"Thirty-four years ago, they didn't throw at you with credit cards like what they are doing right now.\"Soare made the comments on a panel at the 28th Milken Institute Global Conference on Wednesday. The conference, held in California this year, draws global leaders, tech executives, and experts to discuss finance, innovation, and global markets.In 2000, Soare launched her first product line to bring her signature shaping techniques and tools to anyone who wanted beautiful brows. Since then, Anastasia Beverly Hills has become synonymous with eyebrows in the beauty world. The brand's celebrity clients include the likes of Jennifer Lopez, Kendall Jenner, and Kim Kardashian. In May 2024, Forbes estimated Soare's net worth at $900 million.Soare shared the credit card anecdote as part of her pursuit of the American dream — one that started decades earlier in communist Romania.At 15, her grandfather would take her into a small room, shut the windows and curtains, and tune into a banned radio station called \"Voice of America.\"\"He used to tell me that I did a big mistake coming to Romania. The communist regime took everything away from us,\" she said.\"You should go to America,\" Soare recounted her grandfather saying. \"That is the American dream.\"Under the communist regime in Romania, entrepreneurship didn't exist. \"You worked only for the government, and that's it. You couldn't be an entrepreneur,\" Soares said.But Soare knew she wanted more. \"I wanted first to show myself what I'm capable of doing,\" she said.Chasing the American dreamWhen Soare arrived, she started working as an aesthetician — one of the few jobs that didn't require \"perfect English,\" she said.She noticed a gap in the beauty market — nobody paid attention to eyebrows. Believing in the potential of eyebrows as a business idea, she began doing clients' brows for free, as it wasn't \"considered a service\" then.\"My husband thought I am totally crazy,\" she said. \"You don't know how to write a check, you don't have a credit card, you barely speak the language, and you want to open a business. Not even American people born here own a business,\" she recalled her husband saying.But Soare went all in. \"What do I have to lose?\" she thought.From that little room, she built a clientele. Then she opened a salon in Beverly Hills. \"The rest is history,\" she said.\"I am proud to say that I invented a category in the beauty industry that didn't exist before,\" she said at the panel.Read the original article on Business Insider Jason Koerner/Getty ImagesToday, Anastasia Soare is the CEO of the beauty giant Anastasia Beverly Hills.When she was starting out, she had to beg Wells Fargo for a $500 credit card.Soare, an immigrant from Romania, shared her journey of pursuing the American dream at the Milken conference on Wednesday.Before she became the CEO of a global beauty brand with celebrity clients, Anastasia Soare needed a $500 credit card.When she arrived in the US in 1989 as an immigrant, \"nobody paid attention,\" the founder of Anastasia Beverly Hills said. At the time, she was an aesthetician with zero credit history and limited English — and a bold idea that needed backing.\"I went to Wells Fargo and had to beg the manager to give me a $500 credit card,\" she recalled. \"Thirty-four years ago, they didn't throw at you with credit cards like what they are doing right now.\"Soare made the comments on a panel at the 28th Milken Institute Global Conference on Wednesday. The conference, held in California this year, draws global leaders, tech executives, and experts to discuss finance, innovation, and global markets.In 2000, Soare launched her first product line to bring her signature shaping techniques and tools to anyone who wanted beautiful brows. Since then, Anastasia Beverly Hills has become synonymous with eyebrows in the beauty world. The brand's celebrity clients include the likes of Jennifer Lopez, Kendall Jenner, and Kim Kardashian. In May 2024, Forbes estimated Soare's net worth at $900 million.Soare shared the credit card anecdote as part of her pursuit of the American dream — one that started decades earlier in communist Romania.At 15, her grandfather would take her into a small room, shut the windows and curtains, and tune into a banned radio station called \"Voice of America.\"\"He used to tell me that I did a big mistake coming to Romania. The communist regime took everything away from us,\" she said.\"You should go to America,\" Soare recounted her grandfather saying. \"That is the American dream.\"Under the communist regime in Romania, entrepreneurship didn't exist. \"You worked only for the government, and that's it. You couldn't be an entrepreneur,\" Soares said.But Soare knew she wanted more. \"I wanted first to show myself what I'm capable of doing,\" she said.Chasing the American dreamWhen Soare arrived, she started working as an aesthetician — one of the few jobs that didn't require \"perfect English,\" she said.She noticed a gap in the beauty market — nobody paid attention to eyebrows. Believing in the potential of eyebrows as a business idea, she began doing clients' brows for free, as it wasn't \"considered a service\" then.\"My husband thought I am totally crazy,\" she said. \"You don't know how to write a check, you don't have a credit card, you barely speak the language, and you want to open a business. Not even American people born here own a business,\" she recalled her husband saying.But Soare went all in. \"What do I have to lose?\" she thought.From that little room, she built a clientele. Then she opened a salon in Beverly Hills. \"The rest is history,\" she said.\"I am proud to say that I invented a category in the beauty industry that didn't exist before,\" she said at the panel.Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1083604059697700298",
        "title": "Comcast's Xfinity Mobile takes over naming rights of Philadelphia arena",
        "url": "https://www.cnbc.com/2025/05/06/comcast-xfinity-mobile-philadelphia-arena-naming-rights.html",
        "site": "cnbc.com",
        "time": 1746547202000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Comcast's Xfinity Mobile will become the new name of the Wells Fargo Center in Philadelphia, which is home to the NHL's Flyers and NBA's 76ers.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6718280560588105726",
        "title": "Huntsman downgraded at Wells Fargo amid tariff pressures, demand weakness",
        "url": "https://seekingalpha.com/news/4441051-huntsman-downgraded-at-wells-fargo-amid-tariff-pressures-demand-weakness",
        "site": "seekingalpha.com",
        "time": 1746456102000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2541666666247631722",
        "title": "Western Digital's 10-Q highlights concentration, geography breakdown, more: Wells Fargo",
        "url": "https://seekingalpha.com/news/4440910-western-digitals-10-q-highlights-concentration-geography-breakdown-more-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1746448152000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2033922756498954561",
        "title": "Wells Fargo could see material earnings upside if asset cap is lifted, analyst says",
        "url": "https://seekingalpha.com/news/4440379-wells-fargo-could-see-material-earnings-upside-if-asset-cap-is-lifted-analyst-says",
        "site": "seekingalpha.com",
        "time": 1746302707000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6997467895746490352",
        "title": "Ashland downgraded at Wells Fargo on growth worries, tariff hurdles",
        "url": "https://seekingalpha.com/news/4439445-ashland-downgraded-at-wells-fargo-on-growth-worries-tariff-hurdles",
        "site": "seekingalpha.com",
        "time": 1746129212000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7500349403372668859",
        "title": "Becton, Dickinson drops after guidance cut; BofA, Wells Fargo downgrade | $BDX",
        "url": "https://seekingalpha.com/news/4439396-becton-dickinson-stock-drops-guidance-cut",
        "site": "seekingalpha.com",
        "time": 1746124933000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4963848441019747881",
        "title": "Retail reset: Wells Fargo warns on tariff headwinds and recession risk in the apparel sector",
        "url": "https://seekingalpha.com/news/4438143-retail-reset-wells-fargo-warns-on-tariff-headwinds-and-recession-risk-in-the-apparel-sector",
        "site": "seekingalpha.com",
        "time": 1746035951000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "3127518294435120664",
        "title": "Stocks shoot for sixth straight day of gains, Wells Fargo bounces on buyback news",
        "url": "https://www.cnbc.com/2025/04/29/stocks-shoot-for-sixth-day-of-gains-wells-fargo-bounces-on-buyback-.html",
        "site": "cnbc.com",
        "time": 1745950212000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6492982607262453114",
        "title": "Wells Fargo sees market bottom and shifts sector strategy toward utilities",
        "url": "https://seekingalpha.com/news/4437155-wells-fargo-sees-market-bottom-and-shifts-sector-strategy-toward-utilities",
        "site": "seekingalpha.com",
        "time": 1745949084000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1169418059475636219",
        "title": "Wells Fargo to Buy Back $40 Billion of Shares Under New Program",
        "url": "https://www.bloomberg.com/news/articles/2025-04-29/wells-fargo-to-buy-back-40-billion-of-shares-under-new-program",
        "site": "bloomberg.com",
        "time": 1745938554000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. announced a new $40 billion stock-buyback program, sending shares up. A Wells Fargo bank branch in New York.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6198744765424708246",
        "title": "Wells Fargo declares $0.40 dividend, up to $40B share repurchase program authorized",
        "url": "https://seekingalpha.com/news/4436996-wells-fargo-declares-040-dividend-up-to-40b-share-repurchase-program-authorized",
        "site": "seekingalpha.com",
        "time": 1745937821000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3954960086993423691",
        "title": "Wells Fargo gets another federal penalty lifted, but still has 3 big ones to go",
        "url": "https://www.marketwatch.com/story/wells-fargo-gets-another-federal-penalty-lifted-but-still-has-3-big-ones-to-go-ac9f9c11?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1745854020000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo’s CEO says the bank “is a different and stronger company today” after correcting its compliance problems.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2799088706815852133",
        "title": "Wells Fargo Says CFPB Ended Compliance-Risk Consent Order",
        "url": "https://www.pymnts.com/news/regulation/2025/wells-fargo-says-cfpb-ended-compliance-risk-consent-order/",
        "site": "pymnts.com",
        "time": 1745852336000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo said the Consumer Financial Protection Bureau terminated a consent order related to the company’s compliance risk management program. The order was issued in 2018 and is the 12th consent order closed by regulators since 2019 and the sixth since the start of the year, according to a Monday (April 28) press release. “Today’s […] The post Wells Fargo Says CFPB Ended Compliance-Risk Consent Order appeared first on PYMNTS.com. Wells Fargo said the Consumer Financial Protection Bureau terminated a consent order related to the company’s compliance risk management program. The order was issued in 2018 and is the 12th consent order closed by regulators since 2019 and the sixth since the start of the year, according to a Monday (April 28) press release. “Today’s termination, along with the recent closure of other consent orders, demonstrates that we have completed much of our common risk and control infrastructure work, including work that is required by other orders,” Wells Fargo CEO Charlie Scharf said in the release. “I am proud of the work done by our teams and remain confident that we will complete the work needed to close our other open consent orders.” Wells Fargo has been struggling with regulatory issues for the better part of a decade following the “fake accounts” scandal at the bank in 2016. The Federal Reserve also placed an asset cap on the lender in 2018, limiting its balance sheet to $1.95 trillion. The CFPB did not respond to PYMNTS’ request for comment. Wells Fargo’s efforts to regain compliance have fostered hopes that the asset cap could soon be lifted, Reuters reported Monday. Wells Fargo announced in January the termination of a 2022 CFPB consent order related to automobile and mortgage lending and consumer deposit accounts. That order included a $3.7 billion fine and required Wells Fargo to halt the practice of surprise overdraft fees or fees for deposit accounts “when the consumer had available funds at the time of a purchase or other debit transaction, but then subsequently had a negative balance once the transaction settled,” the CFPB said in December 2022. The order settled a case in which the CFPB accused the bank of a series of illegal acts, such as illegally assessed fees and interest charges on loans, wrongful car repossessions and unlawful overdraft fees. The CFPB is scaling back its enforcement of financial institutions. The agency said it wants to focus more on crimes against consumers — particularly military families — and less on things like digital payments, medical debt and student loans. The post Wells Fargo Says CFPB Ended Compliance-Risk Consent Order appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2810234227254526227",
        "title": "Wells Fargo Says CFPB Ends Consent Order Dating Back to 2018",
        "url": "https://www.bloomberg.com/news/articles/2025-04-28/wells-fargo-says-cfpb-ends-consent-order-dating-back-to-2018",
        "site": "bloomberg.com",
        "time": 1745844068000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "2799088706815852133"
        ],
        "description": "Wells Fargo & Co. said the Consumer Financial Protection Bureau terminated a consent order dating back to 2018 related to the bank’s compliance risk-management program, the sixth such order ended this year. The seal of the US Consumer Financial Protection Bureau (CFPB) at the agency's headquarters in Washington, DC, US, on Monday, Feb. 10, 2025. In another weekend takeover of a federal agency's operations, staffers from an efficiency initiative led by billionaire Elon Musk helped to effectively shut down the Consumer Financial Protection Bureau, as they gained access to an array of the bureau's protected information. Photographer: Al Drago/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8076648023955325073",
        "title": "Arm Holdings in focus as Wells Fargo is 'cautious' ahead of earnings on tariff unknown",
        "url": "https://seekingalpha.com/news/4436196-arm-holdings-in-focus-as-wells-fargo-is-cautious-ahead-of-earnings-on-tariff-unknown",
        "site": "seekingalpha.com",
        "time": 1745842069000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "697798528375491011",
        "title": "Two Ex-Wells Fargo Auditors Reach Settlement With Bank Regulator",
        "url": "https://www.bloomberg.com/news/articles/2025-04-25/two-ex-wells-fargo-auditors-reach-settlement-with-bank-regulator",
        "site": "bloomberg.com",
        "time": 1745603747000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "A key US banking regulator unveiled settlements with two former Wells Fargo & Co. auditors who were alleged to have ties to the bank’s systemic sales-practice misconduct, according to a statement Friday. A Wells Fargo bank branch in New York, US, on Sunday, Jan. 12, 2025. Wells Fargo & Co. is scheduled to release earnings figures on January 15. Photographer: Michael Nagle/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1038088326926038611",
        "title": "Hedge Funds Can Protect Portfolios: Steffen",
        "url": "https://www.bloomberg.com/news/videos/2025-04-23/hedge-funds-can-protect-portfolios-steffen-video",
        "site": "bloomberg.com",
        "time": 1745440491000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo Global Alternative Investment Strategist Mark Steffen discusses the recent market volatility and believes hedge funds can really help smooth over the bumps in the road. He speaks with Scarlet Fu on \"Bloomberg Markets.\" (Source: Bloomberg) Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8517045429226090609",
        "title": "Stocks Gain on Trump's Softer Tone | Bloomberg Markets 04/23/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-04-23/bloomberg-markets-04-23-2025-video",
        "site": "bloomberg.com",
        "time": 1745433309000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. Today's guests; Wells Fargo Global Alternative Investment Strategist Mark Steffen, Kayne Anderson Rudnick Chief Market Strategist Portfolio Manager Julie Biel, Check Point Software Technologies CEO Nadav Zafrir, and Brown Harris Stevens Associate Real Estate Broker Lisa Lippman. (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2963889903583487263",
        "title": "AWS, Microsoft Slow Down Data Center Deployments",
        "url": "https://www.pymnts.com/technology/2025/aws-microsoft-slow-down-data-center-deployments/",
        "site": "pymnts.com",
        "time": 1745359148000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "AWS and Microsoft are pausing or slowing down the development of data centers, according to a Wells Fargo research note shared with PYMNTS. Several industry sources told Wells Fargo’s analysts team that AWS has “paused a portion of its leading discussions” on colocated data centers, particularly those abroad. “It’s not clear the magnitude of the […] The post AWS, Microsoft Slow Down Data Center Deployments appeared first on PYMNTS.com. AWS and Microsoft are pausing or slowing down the development of data centers, according to a Wells Fargo research note shared with PYMNTS. Several industry sources told Wells Fargo’s analysts team that AWS has “paused a portion of its leading discussions” on colocated data centers, particularly those abroad. “It’s not clear the magnitude of the pause, but the positioning is similar to what we’ve heard recently from Microsoft,” wrote Wells Fargo analyst Eric Luebchow in the Monday (April 21) note. Last week, Noelle Walsh, president of Microsoft Cloud Operations and Innovation, disclosed in a LinkedIn post that the software giant is “slowing or pausing some early-stage projects” as it refines the buildout of cloud capacity relative to customer demand. Microsoft has doubled its data center capacity in the last three years and is on track to spend the budgeted amount of $80 billion or more in 2025 “informed by near-term and long-term demand signals,” Walsh said in the post. Microsoft has more than 350 data centers in at least 60 regions globally. Meanwhile, Kevin Miller, vice president of global data centers at AWS, explained in a LinkedIn post that the change in the hyperscaler’s data center plans is “routine capacity management, and there haven’t been any recent fundamental changes in our expansion plans.” AWS continues to see “strong demand for both generative AI and foundational workloads,” he said in the post. Wells Fargo’s Luebchow acknowledged that “it’s not clear yet” that AWS’ slowing of lease signing “is an area of concern or just the natural ebbs and flows of hyperscale activity.” AWS has 114 availability zones and plans for 12 more in 36 global regions that serve 245 countries and territories. An AWS spokesperson told PYMNTS that availability zones refer to a cluster of one or more discrete data centers. AWS does not disclose its actual data center count. Read also: Nvidia and xAI Sign On to $30 Billion AI Infrastructure Fund Other Hyperscalers Remain Active Luebchow said other major data center owners — Meta, Google and Oracle — remain “active” while Nvidia is showing “elevated activity.” This does not include the $500 billion Stargate project to build artificial intelligence data centers, which is a partnership among OpenAI, SoftBank, Oracle and MGX, plus technical alliances with other companies, the analyst said. It also does not include Apple’s own data center plans, which are ramping up over the next four years, according to the research note. The surge in data center construction is the result of explosive growth in AI, cloud services and digital infrastructure needs. The demand for AI tools like ChatGPT is driving a need for massive computing power and storage, which means the necessity for more data centers. Global data center capacity is expected to grow at 15% per year until 2027, which is forecast to be insufficient to meet growing demand, according to real estate services company JLL. Driven by AI advancements, “global data center construction currently stands at record levels,” JLL said in its 2025 Global Data Center Outlook. “All signals suggest that AI demand will continue to build momentum in 2025.” However, the experience of China is a cautionary tale. After ChatGPT burst onto the scene in November 2022, there was a rush of data center buildout in China as growing demand for AI made the country seem like a sound bet, MIT Technology Review reported in March. In 2023 and 2024, more than 500 new data center projects were announced in China. At least 150 were operational by the end of last year, per the report. But the rise of DeepSeek, which offered a more economical way to train and use AI models, along with faltering economics around AI, is putting a crimp on the industry, according to the report. Many data centers also were constructed hastily and did not meet industry standards. The result is that most of the companies running these data centers are “struggling to stay afloat,” the report said. For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. The post AWS, Microsoft Slow Down Data Center Deployments appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3683526739566294119",
        "title": "An Amazon exec has hit back at claims it's pausing some data center lease talks",
        "url": "https://www.businessinsider.com/amazon-vp-ai-data-center-leases-demand-wells-fargo-2025-4",
        "site": "businessinsider.com",
        "time": 1745331103000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "An AWS VP has responded to a report suggesting the company is pausing data center leases.Noah Berger/Getty Images for Amazon Web ServicesAn Amazon VP says the company is still seeing strong demand for data centers.A Wells Fargo report suggested AWS was pausing some data center leasing discussions.Another February analyst note said Microsoft was stepping back from some data center lease negotiations.An Amazon executive has fired back at an analyst note suggesting the company is pausing its data center expansion plans. Kevin Miller, a vice president of global data centers at Amazon Web Services, said in a Monday LinkedIn post that there is still \"strong demand\" for the company to deliver access to infrastructure at the heart of the AI boom.Earlier on Monday, Wells Fargo published a research note that said its analysts had \"heard from several industry sources\" that AWS had paused some of its data center leasing discussions. The analysts said those discussions had been on the \"colocation side,\" a strategy in which a hyperscaler like AWS rents space in a third-party data center.The note, titled \"Data Centers: AWS Goes on Pause,\" said that \"it's not clear yet whether AWS slowing some leases is an area of concern.\" The analysts explained that there can sometimes be a \"digestion\" period lasting six to 12 months in which leasing activity slows before picking up again.Miller said in his LinkedIn post that AWS has learned to \"consider multiple options in parallel\" following almost two decades of delivering data center capacity.\"Some options might end up costing too much, while others might not deliver when we need the capacity,\" Miller said. \"Other times, we find that we need more capacity in one location and less in another.\"While Miller referred to this as \"routine capacity management,\" the report is likely to have sparked concern among investors who have looked at data center demand as a signal of how much momentum there is for AI services.Data centers have become an increasingly important asset in the generative AI boom, as companies like AWS have used them to host servers loaded with chips that can train and host the models that lead the industry today.Earlier this year, Big Tech companies showed they were all in on the AI boom by collectively lining up over $300 billion in AI infrastructure spend.But in February, Microsoft's shares fell 1.3% after a report from an analyst at TD Cowen said the company was stepping back from negotiations on leases for data centers in multiple markets.An Amazon spokesperson referred BI to Miller's LinkedIn post. Read the original article on Business Insider An AWS VP has responded to a report suggesting the company is pausing data center leases.Noah Berger/Getty Images for Amazon Web ServicesAn Amazon VP says the company is still seeing strong demand for data centers.A Wells Fargo report suggested AWS was pausing some data center leasing discussions.Another February analyst note said Microsoft was stepping back from some data center lease negotiations.An Amazon executive has fired back at an analyst note suggesting the company is pausing its data center expansion plans. Kevin Miller, a vice president of global data centers at Amazon Web Services, said in a Monday LinkedIn post that there is still \"strong demand\" for the company to deliver access to infrastructure at the heart of the AI boom.Earlier on Monday, Wells Fargo published a research note that said its analysts had \"heard from several industry sources\" that AWS had paused some of its data center leasing discussions. The analysts said those discussions had been on the \"colocation side,\" a strategy in which a hyperscaler like AWS rents space in a third-party data center.The note, titled \"Data Centers: AWS Goes on Pause,\" said that \"it's not clear yet whether AWS slowing some leases is an area of concern.\" The analysts explained that there can sometimes be a \"digestion\" period lasting six to 12 months in which leasing activity slows before picking up again.Miller said in his LinkedIn post that AWS has learned to \"consider multiple options in parallel\" following almost two decades of delivering data center capacity.\"Some options might end up costing too much, while others might not deliver when we need the capacity,\" Miller said. \"Other times, we find that we need more capacity in one location and less in another.\"While Miller referred to this as \"routine capacity management,\" the report is likely to have sparked concern among investors who have looked at data center demand as a signal of how much momentum there is for AI services.Data centers have become an increasingly important asset in the generative AI boom, as companies like AWS have used them to host servers loaded with chips that can train and host the models that lead the industry today.Earlier this year, Big Tech companies showed they were all in on the AI boom by collectively lining up over $300 billion in AI infrastructure spend.But in February, Microsoft's shares fell 1.3% after a report from an analyst at TD Cowen said the company was stepping back from negotiations on leases for data centers in multiple markets.An Amazon spokesperson referred BI to Miller's LinkedIn post. Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5948986434613457816",
        "title": "Wells Fargo: Amazon Web Services delays data center leases, following Microsoft pullback",
        "url": "https://www.datacenterdynamics.com/en/news/wells-fargo-amazon-web-services-delays-data-center-leases-following-microsoft-pullback/",
        "site": "datacenterdynamics.com",
        "time": 1745271416000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "But Microsoft has downplayed its own cuts",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4558729843613853332",
        "title": "Amazon slides as Wells Fargo says company pausing some data center leases",
        "url": "https://seekingalpha.com/news/4432925-amazon-slides-as-wells-fargo-says-company-pausing-some-data-center-leases",
        "site": "seekingalpha.com",
        "time": 1745263889000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6035470505464294108",
        "title": "What the Discover merger approval means for Capital One and 2 other financials",
        "url": "https://www.cnbc.com/2025/04/21/what-the-discover-merger-approval-means-for-capital-one-and-2-other-financials.html",
        "site": "cnbc.com",
        "time": 1745261885000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo research analysts see the Capital One-Discovery merger as a \"clearing event\" for more bank deals.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1699603623912261794",
        "title": "Amazon has paused some data center lease commitments, Wells Fargo says",
        "url": "https://www.cnbc.com/2025/04/21/amazon-has-paused-some-data-center-lease-commitments-wells-fargo.html",
        "site": "cnbc.com",
        "time": 1745258675000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "-3683526739566294119",
            "4558729843613853332",
            "-7449817086562513941"
        ],
        "description": "Amazon and Microsoft both appear to be slowing down or holding off on early data center projects.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "966514708219141883",
        "title": "Wells Fargo’s Scott Wren: Investors should capitalize on lower US stock prices",
        "url": "https://seekingalpha.com/news/4432833-wells-fargos-scott-wren-investors-should-capitalize-on-lower-us-stock-prices",
        "site": "seekingalpha.com",
        "time": 1745253246000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7912703362037105644",
        "title": "Wells Fargo's inroad into dealmaking pays off — plus, why we don't regret ditching Alphabet",
        "url": "https://www.cnbc.com/2025/04/17/wells-fargos-inroad-into-dealmaking-pays-off-plus-why-we-dont-regret-ditching-alphabet.html",
        "site": "cnbc.com",
        "time": 1744915514000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2411528465403307508",
        "title": "Pennsylvania is facing a nursing shortage—here’s how it plans to fix it",
        "url": "https://www.fastcompany.com/91316343/pennsylvania-facing-nursing-shortage-plans-to-fix-it?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1744831800000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Imagine nearly every seat in Philadelphia’s Wells Fargo Center − over 20,000 seats − are empty. That’s the scale of Pennsylvania’s projected shortfall of registered nurses by 2026, according to the Hospital and Healthsystem Association of Pennsylvania. Hospitals in the state report an average 14% vacancy rate for registered nurses. In rural areas it is much higher. This shortage, of course, is not just in hospitals. It also affects long-term care facilities, outpatient clinics and home health agencies, which compete with hospitals for a limited pool of registered nurses, licensed nursing professionals and nursing support staff. We are a senior associate dean of nursing and clinical professor of nursing at Drexel University’s College of Nursing and Health Professions in Philadelphia, and a dean and professor of nursing at Duquesne University’s School of Nursing in Pittsburgh. We know that the nursing shortage in Pennsylvania, while not the worst in the U.S., is severe and jeopardizes the health care that patients receive. What caused the shortage? Pennsylvania’s nursing shortage is the result of long-standing issues in education, workforce retention and health care delivery. Education bottlenecks: Nursing schools in Pennsylvania and nationwide turn away thousands of qualified applicants each year due to faculty shortages, limited classroom space and scarce clinical placements. More than 65,000 qualified applications were turned away from U.S. nursing programs in 2023 alone, according to a report from the American Association of Colleges of Nursing. A key issue is the lack of preceptors. Preceptors are experienced nurses who teach students in real-world settings. A shortage of preceptors directly limits how many students can complete their education. Aging workforce: More than a third of Pennsylvania’s registered nurses are 55 or older. This demographic reality means many are nearing retirement. Burnout and attrition: The COVID-19 pandemic worsened already high levels of stress, burnout and mental health strain for nurses. Many left the profession early due to emotional exhaustion, family and personal health concerns, unsafe staffing ratios, moral injury and lack of institutional support. Uneven distribution: While Pennsylvania may have a sufficient number of licensed nurses on paper, those nurses don’t all still work in the profession. And among those that do, they are not evenly spread across roles or locations. Rural hospitals, long-term care centers, behavioral health settings and maternal-child health units are experiencing acute shortages. Cost to patients For patients and their families, the consequences of the nursing shortage are delayed care, fewer interactions with providers and less time for compassionate, personalized support. Overextended nurses face increased workloads, raising the likelihood of delayed interventions, medication errors and inadequate patient education. These factors undermine quality of care. Limited access to nursing care can increase hospital deaths, infections and readmissions, reduce early detection of health issues, and slow the response to life-threatening conditions such as stroke, sepsis and cardiac arrest. In Pennsylvania, patients may experience longer emergency room wait times, delayed discharges or transfers to nursing homes or rehabilitation centers, and service disruptions in rural and underserved areas. Effect on nurses Over 600,000 registered nurses across the U.S. plan to leave the workforce by 2027, according to a 2023 analysis by the National Council of State Boards of Nursing. Many cite stress as their reason for leaving the profession. New graduates often leave within their first two years, feeling unprepared for the emotional and operational realities of practice. In Pennsylvania, the shortage has created a feedback loop. Understaffing increases pressure on those who remain. A 2023 National Council of State Boards of Nursing survey found that 41% of nurses under age 35 reported feeling emotionally drained. Meanwhile, some experienced nurses choose to retire early or shift into nonclinical roles for better schedules, slower pace and improved quality of life. This turnover erodes institutional knowledge, increases costs for onboarding and overtime, and limits the capacity to mentor incoming staff. What’s being done To help address the problem, Pennsylvania Gov. Josh Shapiro in March 2025 proposed a US$5 million Nurse Shortage Assistance Program. If approved by the General Assembly, the program would cover tuition costs for nursing students who commit to working in Pennsylvania hospitals for three years after graduation. HB 390 is also currently under review in the Pennsylvania General Assembly. It aims to establish a $1,000 tax deduction for licensed nurses who serve as clinical preceptors. To meet the growing demand for nurses, Pennsylvania hospitals are partnering with colleges and universities to expand clinical training capacity, streamline pathways into nursing and develop innovative education models such as hybrid and accelerated programs. Hospitals statewide are also offering substantial sign-on bonuses, loan forgiveness programs, housing stipends and flexible scheduling to attract nurses. To improve nurse retention, health care organizations have introduced structured residency programs, mentorship networks and clear career advancement pathways designed to reduce burnout and enhance professional satisfaction. They are also increasingly using virtual nursing, telehealth services and AI-driven administrative tools to reduce nurses’ workloads, enhance patient interactions and address staffing gaps. And some Philadelphia and Pennsylvania colleges offer refresher and license reactivation programs for retired or inactive nurses who want to rejoin the workforce. Duquesne offers a nurse faculty residency to increase the number of high-quality nursing faculty. What more could be done? Continuing Title VIII Nursing Workforce Development Programs are another solution. These federal grants, reauthorized under the March 2020 CARES Act, help fund nursing pathways and the availability of high-quality nursing care for patients nationwide. On April 1, 2025, the Trump administration announced plans to restructure the U.S. Department of Health and Human Services, and the future status of these programs is not yet known. Research consistently demonstrates that care provided by nurses who have earned a bachelor’s degree or higher directly leads to better patient outcomes, improved safety and overall health. A commitment to shoring up the nurse pipeline in Pennsylvania is a commitment to improving the well-being of individuals and communities across the state. Kymberlee Montgomery is a senior associate dean of nursing at Drexel University. Mary Ellen Smith Glasgow is a professor of nursing at Duquesne University. This article is republished from The Conversation under a Creative Commons license. Read the original article.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-894200527060129146",
        "title": "Why home builder sentiment is in the dumps (hint: tariffs)",
        "url": "https://www.axios.com/2025/04/16/home-builder-sentiment-tariffs",
        "site": "axios.com",
        "time": 1744830956000,
        "favicon_url": "https://static.tickertick.com/website_icons/axios.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Data: NAHB/Wells Fargo Housing Market Index; Note: Seasonally adjusted; Chart: Axios VisualsThe nation's home builders are less than thrilled with the Trump economy thus far. Why it matters: The headwinds for the companies that build single-family homes are multiplying, a bad sign for a country facing a shortage of affordable homes.By the numbers: The National Association of Home Builders Housing Market Index ticked up a scant one point to 40 in April from the previous month, but that was before the recent mortgage-rate increase registered. (Any number below 50 indicates negative sentiment.)60% of builders said their materials costs have gone up by an average of 6.3% this year, adding $10,900 per average single-family home.Meanwhile: U.S. homes are selling at their slowest pace in 6 years, per real estate site Redfin's data. The typical home that went under contract in March sat on the market for about 1.5 months (47 days). Double what it was during the frenzied pandemic market.A bright spot for buyers: Home prices are growing at the slowest pace in a year and a half, up 2.5% in March from last year. But that's hardly good news for home builders.The big picture: It's not only that tariffs raise the cost of building a house.The drastic \"Liberation Day\" rollout sparked a Treasury bond selloff that's pushed mortgage rates higher, just as they were starting to cool. The average 30-year-mortgage rate is hovering right below 7% now, according to Mortgage News Daily, after spiking last week. (It's still below January levels, though.)Rising rates and economic uncertainty dampen demand for houses. Meanwhile, the threat of an immigration crackdown hangs over an industry that relies heavily on undocumented labor.What they said: \"You have to be crazy to start a new home project right now!'\" a home builder told HFE Economics, per a note the ADJ GROUP sent out Wednesday.\"The prices of materials over the next three months seem sure to rise, but no one knows by how much,\" HFE writes. \"Tariff risks pose a huge threat to profit margins in this industry and to the prices of everything overall.\"They point out that if, say, the price of Canadian lumber goes up that would likely lead to U.S. producers to raise prices, too.The bottom line: There was lots of campaign talk about easing the housing shortage with less regulation, but federal policies around trade are making it harder to build homes. Data: NAHB/Wells Fargo Housing Market Index; Note: Seasonally adjusted; Chart: Axios VisualsThe nation's home builders are less than thrilled with the Trump economy thus far. Why it matters: The headwinds for the companies that build single-family homes are multiplying, a bad sign for a country facing a shortage of affordable homes.By the numbers: The National Association of Home Builders Housing Market Index ticked up a scant one point to 40 in April from the previous month, but that was before the recent mortgage-rate increase registered. (Any number below 50 indicates negative sentiment.)60% of builders said their materials costs have gone up by an average of 6.3% this year, adding $10,900 per average single-family home.Meanwhile: U.S. homes are selling at their slowest pace in 6 years, per real estate site Redfin's data. The typical home that went under contract in March sat on the market for about 1.5 months (47 days). Double what it was during the frenzied pandemic market.A bright spot for buyers: Home prices are growing at the slowest pace in a year and a half, up 2.5% in March from last year. But that's hardly good news for home builders.The big picture: It's not only that tariffs raise the cost of building a house.The drastic \"Liberation Day\" rollout sparked a Treasury bond selloff that's pushed mortgage rates higher, just as they were starting to cool. The average 30-year-mortgage rate is hovering right below 7% now, according to Mortgage News Daily, after spiking last week. (It's still below January levels, though.)Rising rates and economic uncertainty dampen demand for houses. Meanwhile, the threat of an immigration crackdown hangs over an industry that relies heavily on undocumented labor.What they said: \"You have to be crazy to start a new home project right now!'\" a home builder told HFE Economics, per a note the ADJ GROUP sent out Wednesday.\"The prices of materials over the next three months seem sure to rise, but no one knows by how much,\" HFE writes. \"Tariff risks pose a huge threat to profit margins in this industry and to the prices of everything overall.\"They point out that if, say, the price of Canadian lumber goes up that would likely lead to U.S. producers to raise prices, too.The bottom line: There was lots of campaign talk about easing the housing shortage with less regulation, but federal policies around trade are making it harder to build homes.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7308520788886099491",
        "title": "Is This The Bottom For Wells Fargo Stock?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/16/is-this-the-bottom-for-wells-fargo-stock/",
        "site": "forbes.com",
        "time": 1744824062000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo stock is nearing a historically bullish trendline after an earnings dip. Plus, sentiment is down and its near oversold, making now it time to buy the dip. Wells Fargo stock is nearing a historically bullish trendline after an earnings dip. Plus, sentiment is down and its near oversold, making now it time to buy the dip.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-34184719250544391",
        "title": "Ecolab downgraded at Wells Fargo on weaker end markets, tariff pressure",
        "url": "https://seekingalpha.com/news/4431709-ecolab-downgraded-at-wells-fargo-on-weaker-end-markets-tariff-pressure",
        "site": "seekingalpha.com",
        "time": 1744816675000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "6718280560588105726",
            "-6997467895746490352"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5398267717265319659",
        "title": "Wells Fargo Taps UBS Dealmaker as Chairman of Industrials",
        "url": "https://www.bloomberg.com/news/articles/2025-04-15/wells-fargo-taps-ubs-dealmaker-moskal-as-industrials-chair",
        "site": "bloomberg.com",
        "time": 1744754468000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. has hired veteran dealmaker Eric Moskal from UBS Group AG as chairman of industrials, as it presses ahead with expanding its investment banking ranks, according to a person familiar with the matter. The Wells Fargo & Co. logo is displayed atop a bank branch in New York, U.S., on Friday, April 13, 2012. Wells Fargo & Co., the largest U.S. home lender, reported a 13 percent rise in first-quarter profit, setting a record as the bank made more money on new mortgages and curbed losses from old ones.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-2330173876257940825",
        "title": "Wells Fargo’s Animal Spirits Index plunges below zero, signaling economic pessimism amid tariff uncertainty",
        "url": "https://seekingalpha.com/news/4431221-wells-fargos-animal-spirits-index-plunges-below-zero-signaling-economic-pessimism-amid-tariff-uncertainty",
        "site": "seekingalpha.com",
        "time": 1744726018000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4404272250979868158",
        "title": "Goldman Sachs and Wells Fargo Join Wall Street Borrowing Blitz",
        "url": "https://www.bloomberg.com/news/articles/2025-04-15/goldman-sachs-and-wells-fargo-gs-wfc-join-wall-street-borrowing-blitz",
        "site": "bloomberg.com",
        "time": 1744720942000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Goldman Sachs Group Inc. and Wells Fargo & Co. are borrowing from the US investment-grade market Tuesday, joining rivals Morgan Stanley and JPMorgan Chase & Co. in selling bonds after reporting first-quarter earnings. Wells Fargo & Co. branch in Dallas, Texas.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "3220581375208829107",
        "title": "Comcast gets downgraded at Wells Fargo on C&P woes ahead",
        "url": "https://seekingalpha.com/news/4430922-comcast-gets-downgraded-at-wells-fargo-on-cp-woes-ahead",
        "site": "seekingalpha.com",
        "time": 1744655764000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2164871339327498902",
        "title": "Wells Fargo Hires BofA’s MacDonald for Industrials ECM Banking",
        "url": "https://www.bloomberg.com/news/articles/2025-04-14/wells-fargo-hires-bofa-s-macdonald-for-industrials-ecm-banking",
        "site": "bloomberg.com",
        "time": 1744652011000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. has hired Christie MacDonald as a managing director in equity capital markets banking, according to a person familiar with the matter. A Wells Fargo & Co. branch in New York.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7807513497009764001",
        "title": "Wells Fargo Expands Technology Banking Team Amid Tech Sector Growth",
        "url": "https://www.pymnts.com/news/banking/2025/wells-fargo-expands-technology-banking-team-amid-tech-sector-growth/",
        "site": "pymnts.com",
        "time": 1744645474000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo said it is making the largest investment in talent that it has made in the 25-year history of its Technology Banking organization. The bank expanded its Wells Fargo Technology Banking team by 20% over the past year and expects to add more bankers to the team this year, it said in a Monday […] The post Wells Fargo Expands Technology Banking Team Amid Tech Sector Growth appeared first on PYMNTS.com. Wells Fargo said it is making the largest investment in talent that it has made in the 25-year history of its Technology Banking organization. The bank expanded its Wells Fargo Technology Banking team by 20% over the past year and expects to add more bankers to the team this year, it said in a Monday (April 14) press release. In terms of numbers, the technology banking team added 20 bankers in 2024 and plans to add another 10 this year, Wells Fargo Technology Banking Division Executive Tom Harper told Bloomberg in a report posted Monday. The growth of the Technology Banking team, which is part of Wells Fargo Commercial Banking’s Specialized Industries group, is being driven by the U.S. tech sector’s growth, which includes an increase in IT spending, artificial intelligence investments and a “renewed focus on innovation,” according to the release. “Technology Banking is a priority sector for Wells Fargo,” Mary Katherine DuBose, who leads the bank’s Specialized Industries group, said in the release. “Our specialized team has deep industry expertise and a commitment to building long-term relationships and delivering sound and strategic solutions to help companies scale and succeed.” Wells Fargo’s Technology Banking Group provides support to clients in all stages of the business cycle and focuses on software, FinTech, eCommerce, semiconductor, business and technology services, and sustainable tech, according to the release. The Technology Banking Group has hubs in Austin, Boston, Chicago, Denver, Los Angeles, New York City, Phoenix, the San Francisco Bay Area and Utah, per the release. “While most banks have viable products, the leading banks have dedicated, resourceful relationship managers,” Harper said in the release. “They are the heartbeat of our organization, driven to work with clients to build and expedite growth.” Wells Fargo successfully grew fee-based revenue across many business segments while strategically reducing its dependence on net interest income during the first quarter, PYMNTS reported Friday (April 11). Like other financial institutions, Wells Fargo is increasingly focusing on non-interest income streams such as investment advisory, treasury management and merchant services to buffer against market volatility and interest rate uncertainty. The bank’s commercial loan book showed modest growth for the first time since early 2023. The post Wells Fargo Expands Technology Banking Team Amid Tech Sector Growth appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4277825883572916979",
        "title": "Wells Fargo expands tech banking team at record pace in past year",
        "url": "https://seekingalpha.com/news/4430862-wells-fargo-expands-tech-banking-team-at-record-pace-in-past-year",
        "site": "seekingalpha.com",
        "time": 1744637909000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6064371715822251379",
        "title": "Wells Fargo to Expand Newly Restructured Tech Commercial Banking",
        "url": "https://www.bloomberg.com/news/articles/2025-04-14/wells-fargo-to-expand-newly-restructured-tech-commercial-banking",
        "site": "bloomberg.com",
        "time": 1744624800000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "7807513497009764001",
            "-4277825883572916979",
            "-7102114965841203125",
            "-3935769962166700638"
        ],
        "description": "Wells Fargo & Co. is pushing deeper into technology banking for small to midsize firms through staffing additions, as it seeks to capture a larger slice of the industry’s deals and financings. A Wells Fargo bank branch in New York. Photographer: Bing Guan/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6280200609228872779",
        "title": "S&P 500 Notches Its Best Week Since Nov 2023 | Bloomberg: The Close 04/11/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-04-11/bloomberg-the-close-04-11-2025-video",
        "site": "bloomberg.com",
        "time": 1744413190000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Mike Santomassimo, Wells Fargo CFO, Victoria Fernandez, Crossmark Global Investments, Erika Najarian, UBS, Paul Romer, Boston College, Ryan Vlastelica, Bloomberg News, Liz Ann Sonders, Charles Schwab & Co, Bob Doll, Crossmark Global Investments, Steve Englander, Standard Chartered, Beth Kowitt, Bloomberg Opinion, Lisa Donahue, AlixPartners, Rebecca Hessel Cohen, LoveShackFancy, Nancy Rhodes, AlterNew. (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-9160453247665490787",
        "title": "Rick Levine, Who Gave Commercials Cinematic Flair, Dies at 94",
        "url": "https://www.nytimes.com/2025/04/11/business/media/rick-levine-dead.html",
        "site": "nytimes.com",
        "time": 1744407685000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "An award-winning director, he created ads for brands like Diet Pepsi (starring Michael J. Fox) and Wells Fargo by bringing a Hollywood sensibility to the small screen. Rick Levine in 1988. “People don’t come to me just for pictures; they come with stories,” he said.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-5111532067611247921",
        "title": "Wells Fargo Seeks Greater Fee-Based Traction While Economic Ambiguity Reigns",
        "url": "https://www.pymnts.com/earnings/2025/wells-fargo-seeks-greater-fee-based-traction-while-economic-ambiguity-reigns/",
        "site": "pymnts.com",
        "time": 1744402527000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Economic uncertainty is casting a long shadow over the year ahead. Bank leaders are framing 2025 as a year of “wait and see” marked by resilience, optionality and gradual acceleration. That was the story for Wells Fargo’s Q1 earnings call Friday (April 11), where CEO Charlie Scharf and CFO Mike Santomassimo struck a cautiously optimistic […] The post Wells Fargo Seeks Greater Fee-Based Traction While Economic Ambiguity Reigns appeared first on PYMNTS.com. Economic uncertainty is casting a long shadow over the year ahead. Bank leaders are framing 2025 as a year of “wait and see” marked by resilience, optionality and gradual acceleration. That was the story for Wells Fargo’s Q1 earnings call Friday (April 11), where CEO Charlie Scharf and CFO Mike Santomassimo struck a cautiously optimistic tone, outlining progress on fee diversification, credit quality and operational efficiency while acknowledging the volatile macroeconomic environment that continues to test both forecasting and investor patience. “We support the administration’s willingness to look at barriers to fair trade for the United States, though there are certainly risks associated with such significant actions. Timely resolution which benefits the U.S. would be good for businesses, consumers and the markets. We expect continued volatility and uncertainty and are prepared for a slower economic environment in 2025,” Scharf told investors. Wells Fargo notched $4.9 billion in net income, or $1.39 per diluted share — a 16% jump year-over-year. The financial institution (FI) also managed to deliver solid bottom-line growth despite headwinds including declining net interest income and modest loan contraction, showcasing progress in cost control, strategic divestitures and regulatory cleanup. Among the major themes underscored in Wells Fargo’s recent performance was the strategic reduction in dependence on net interest income. While revenue declined year-over-year due to expected drops in interest income, the bank successfully grew fee-based revenue across many business segments. This shift reflects a broader trend in the industry — financial institutions (FIs) are increasingly focusing on non-interest income streams such as investment advisory, treasury management and merchant services to buffer against market volatility and interest rate uncertainty. Read more: No More Risky Business as Wells Fargo Banks on Compliance Regulatory Rehabilitation Takes Center Stage Perhaps the most consequential milestone for Wells Fargo in Q1 wasn’t financial but regulatory. The bank succeeded in terminating five consent orders during the quarter, bringing the total to 11 closures since 2019. Scharf highlighted this as a pivotal signal that Wells Fargo is now a materially different institution from the one that had previously drawn sustained scrutiny from regulators. “These recent closures reflect that we have completed much of the common risk and control infrastructure work,” he said. He credited the firm’s revamped management structure and investments in internal controls for the progress and reaffirmed the closure of remaining orders as the top priority. This evolution is also supported by improved efficiency measures. Wells Fargo reported headcount reductions for 19 consecutive quarters, driven by a disciplined approach to cost-cutting and process optimization. The reinvestment of these savings into technology and talent further strengthens their digital and commercial capabilities. Importantly, the commercial loan book at Wells Fargo showed modest growth for the first time since early 2023, indicating renewed demand despite economic uncertainty. Treasury management and tax credit investments also contributed positively, reflecting innovation in corporate financial solutions. The bank’s consumer segment also showed signs of progress. Mobile banking users grew 4% year-over-year, and digital account openings continued to climb. The credit card business benefited from ongoing investment and saw loan growth in line with expectations, although card charge-offs were seasonally higher. See also: Banks and FinTechs Navigate Market Mayhem Amid Escalating Tariff Fears Net charge-offs for Wells Fargo declined to 45 basis points of average loans, down from 53 basis points last quarter, signaling strong credit quality — especially in commercial lending. Consumer delinquencies appear to have stabilized at historical norms and management reiterated that payment rates on unsecured portfolios remain strong. Importantly, the bank did modestly adjust its allowance for credit losses to reflect potential economic softness. However, CFO Santomassimo stressed that overall coverage remains conservative, with downside scenarios — such as 5.8% unemployment — already baked into their modeling. “Our approach continues to be disciplined and proactive,” he said. “We’re well-positioned to absorb macroeconomic shocks should they materialize.” Scharf also stepped in and hinted at the future potential once the Federal Reserve lifts Wells Fargo’s long-standing asset cap. While he avoided specifics, he suggested that growth in areas like advisory, underwriting, payments and digital banking could accelerate meaningfully. The post Wells Fargo Seeks Greater Fee-Based Traction While Economic Ambiguity Reigns appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-72309756826882752",
        "title": "Risk Is Rising, Says Wells Fargo CFO",
        "url": "https://www.bloomberg.com/news/videos/2025-04-11/risk-is-rising-says-wells-fargo-cfo-video",
        "site": "bloomberg.com",
        "time": 1744401945000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo CFO Mike Santomassimo says risk is rising because of President Donald Trump's tariffs and the uncertainty around his policies. But Santomassimo says consumers are still spending. The bank's first-quarter net interest income missed analyst estimates. Santomassimo speaks on \"Bloomberg The Close.\" (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-9080151230643798780",
        "title": "We trimmed our Wells Fargo price target after mixed earnings. But that's not the whole story",
        "url": "https://www.cnbc.com/2025/04/11/we-trimmed-our-wells-fargo-price-target-after-mixed-q1-earnings.html",
        "site": "cnbc.com",
        "time": 1744399317000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "We're willing to look through these results because of a key catalyst on the horizon.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1655157219175188630",
        "title": "Deals Are the First Casualties of the Trade War",
        "url": "https://www.bloomberg.com/opinion/articles/2025-04-11/jpmorgan-morgan-stanley-and-wells-fargo-deals-are-first-casualty-of-trade-war",
        "site": "bloomberg.com",
        "time": 1744392485000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "JPMorgan Chase, Morgan Stanley and Wells Fargo all struggled to clear up the huge uncertainty created by Trump’s tariffs. Jamie Dimon, chief executive officer of JPMorgan Chase & Co., speaks during the 2025 National Retirement Summit in Washington, DC, US, on Wednesday, March 12, 2025. The event brings together industry leaders, policymakers, and executives to prioritize policy supporting personal savings.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2840830442332295467",
        "title": "Sarepta initiated with a bullish view at Wells Fargo on Elevidys | $SRPT $RHHBY $RHHBF",
        "url": "https://seekingalpha.com/news/4430521-sarepta-stock-wins-bullish-view-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1744387856000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-356413170144764678",
        "title": "Stock Movers: Texas Instruments, Newmont, Wells Fargo (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-11/stock-movers-texas-instruments-newmont-wells-fargo-podcast",
        "site": "bloomberg.com",
        "time": 1744387709000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 4:06 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-8965581742463543494",
        "title": "Stock Movers: JPMorgan Chase, Morgan Stanley & Wells Fargo Report Earnings Amid Market Chaos",
        "url": "https://www.bloomberg.com/news/videos/2025-04-11/stock-movers-big-banks-report-positive-earnings-video",
        "site": "bloomberg.com",
        "time": 1744379090000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "JPMorgan Chase (JPM) stock traders took in a record haul in the first quarter, boosted by chaotic market moves set off by President Donald Trump's policy announcements. The bank's equities markets revenue increased 48% to $3.81 billion, exceeding analysts' expectations and setting a new record as CEO Jamie Dimon expressed caution about the US economy. Morgan Stanley's (MS) stock-traders delivered first-quarter revenue that exceeded analyst predictions, earning a record $4.13 billion from equities trading. The firm's wealth business saw higher-than-anticipated net new assets of $93.8 billion, and investment-banking fees rose 8% in the quarter. Wells Fargo (WFC) kept its expenses in check, beating forecasts. The bank left its full-year guidance unchanged, projecting net interest income growth of 1% to 3%, despite uncertainty around tariffs and their impact on the US economic outlook. (Source: Bloomberg) JPMorgan Chase & Co Photographer: Scott Eells/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6773600085444236049",
        "title": "Stock Movers: JPM, Wells Fargo, Morgan Stanley (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-11/stock-movers-jpm-wells-fargo-morgan-stanley-podcast",
        "site": "bloomberg.com",
        "time": 1744378639000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Source: Bloomberg, 3:31 Morgan Stanley Photographer: Victor J. Blue/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5597713948670086515",
        "title": "Companies Will Hit Pause Button Because of Tariffs, Wells Fargo CFO Says",
        "url": "https://www.wsj.com/livecoverage/stock-market-trump-tariffs-trade-war-04-11-25/card/companies-will-hit-pause-button-because-of-tariffs-wells-fargo-cfo-says-sCUxtUDHouvFrknlsjhP?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1744378278000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "3905877319702864872",
        "title": "Wells Fargo Q1 earnings top consensus, revenue trails; 2025 guidance affirmed",
        "url": "https://seekingalpha.com/news/4430402-wells-fargo-q1-earnings-top-consensus-revenue-trails-2025-guidance-affirmed",
        "site": "seekingalpha.com",
        "time": 1744373906000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1443954574784946387",
        "title": "Wells Fargo’s CEO sees more volatility due to tariffs, is ready for slower economy",
        "url": "https://www.marketwatch.com/story/wells-fargo-revenue-falls-below-views-as-consumer-and-commercial-banking-weakens-6b7b7707?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1744372020000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "“We expect continued volatility and uncertainty and are prepared for a slower economic environment in 2025,” Wells Fargo’s CEO said.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-5970832556840268460",
        "title": "Wells Fargo shares climb on higher earnings, CEO calls for 'timely' trade resolution",
        "url": "https://www.cnbc.com/2025/04/11/wells-fargo-wfc-earnings-q1-2025.html",
        "site": "cnbc.com",
        "time": 1744371243000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Net interest income, a key measure of what a bank makes on loans, fell 6% year over year to $11.50 billion,",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4947001132145020543",
        "title": "Earnings Snapshot: Wells Fargo Q1 earnings top consensus; reaffirms FY25 outlook",
        "url": "https://seekingalpha.com/news/4430322-earnings-snapshot-wells-fargo-q1-earnings-top-consensus-reaffirms-fy25-outlook",
        "site": "seekingalpha.com",
        "time": 1744370605000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-42803780124192202",
        "title": "Stock Movers: JPM, Wells Fargo, BlackRock (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-11/stock-movers-jpm-wells-fargo-blackrock-podcast",
        "site": "bloomberg.com",
        "time": 1744370505000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "-356413170144764678",
            "-8965581742463543494",
            "6773600085444236049"
        ],
        "description": "Source: Bloomberg, 4:08 Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7102114965841203125",
        "title": "Wells Fargo in charts: Q1 Consumer Banking and Lending revenue down Y/Y",
        "url": "https://seekingalpha.com/news/4430361-wells-fargo-in-charts-q1",
        "site": "seekingalpha.com",
        "time": 1744369787000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3935769962166700638",
        "title": "Wells Fargo revenue falls below views, as consumer and commercial banking weakens",
        "url": "https://www.marketwatch.com/story/wells-fargo-revenue-falls-below-views-as-consumer-and-commercial-banking-weakens-6b7b7707?mod=mw_rss_marketpulse",
        "site": "marketwatch.com",
        "time": 1744369380000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1518302819242072723",
        "title": "Wells Fargo Falls Short of NII Estimates Amid Tepid Loan Demand",
        "url": "https://www.bloomberg.com/news/articles/2025-04-11/wells-fargo-falls-short-of-nii-estimates-amid-tepid-loan-demand",
        "site": "bloomberg.com",
        "time": 1744368964000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. missed analysts’ estimates for net interest income in the first quarter with soft loan demand hurting the bank’s largest revenue stream as tariff uncertainty clouds the US economic outlook. A Wells Fargo bank branch in New York. Photographer: Michael Nagle/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-5855498430729690770",
        "title": "Wells Fargo Non-GAAP EPS of $1.27 beats by $0.05, revenue of $20.15B misses by $610M",
        "url": "https://seekingalpha.com/news/4430377-wells-fargo-non-gaap-eps-of-1_27-beats-by-0_05-revenue-of-20_15b-misses-by-610m",
        "site": "seekingalpha.com",
        "time": 1744368455000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4590611652118238363",
        "title": "Bloomberg Markets 04/10/2025 - \"Bloomberg Markets\" follows the market moves across every global ...",
        "url": "https://www.bloomberg.com/news/videos/2025-04-10/bloomberg-markets-04-10-2025-video",
        "site": "bloomberg.com",
        "time": 1744315546000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. Today's guests; Nuveen CIO Saira Malik, Wells Fargo Macro Strategist Erik Nelson, Franklin Templeton Director of Research for Municipal Bonds Jennifer Johnston, JPMorgan Asset Management US CIO of Global Fixed Income, Currency, and Commodities Kay Herr, and Bloomberg's Gina Martin Adams. (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5015498349204036914",
        "title": "Wells Fargo Macro Strategis on FX Markets",
        "url": "https://www.bloomberg.com/news/videos/2025-04-10/wells-fargo-macro-strategis-on-fx-markets-video",
        "site": "bloomberg.com",
        "time": 1744306758000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo Macro Strategist Erik Nelson discusses foreign exchange markets following the back and forth of tariffs, the main battle being with China. He speaks with Vonnie Quinn on \"Bloomberg Markets.\" (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6924535805892701974",
        "title": "Travelers upgraded, W.R. Berkley cut at Wells Fargo",
        "url": "https://seekingalpha.com/news/4429813-travelers-upgraded-w-r-berkley-cut-at-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1744213190000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8214156940392086992",
        "title": "Tariff Plan a Question of Confidence for Markets: Wells Fargo’s Harvey",
        "url": "https://www.bloomberg.com/news/videos/2025-04-09/tariffs-a-question-of-confidence-for-market-wells-fargo-video",
        "site": "bloomberg.com",
        "time": 1744202602000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Chris Harvey, head of equity strategy at Wells Fargo, says markets are losing confidence “quickly” in President Donald Trump’s tariff plan and need to hear the administration acknowledge the impact of tariffs and start to slow things down. (Source: Bloomberg) Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6529698825988292290",
        "title": "Wells Fargo Taps Goldman Sachs’ DiOrio to Lead Industrials M&A",
        "url": "https://www.bloomberg.com/news/articles/2025-04-08/wells-fargo-taps-goldman-sachs-diorio-to-lead-industrials-m-a",
        "site": "bloomberg.com",
        "time": 1744143318000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. has hired Chris DiOrio from Goldman Sachs Group Inc. to lead its industrials M&A group, the latest in a string of hires aimed at bolstering its investment banking team, according to people familiar with the matter. A Wells Fargo & Co. branch in New York, US, on Sunday, Jan. 12, 2025. Wells Fargo & Co. is scheduled to release earnings figures on January 15.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4174106565178905829",
        "title": "Wells Fargo’s AI assistant just crossed 245 million interactions – no human handoffs, no sensitive data exposed",
        "url": "https://venturebeat.com/ai/wells-fargos-ai-assistant-just-crossed-245-million-interactions-with-zero-humans-in-the-loop-and-zero-pii-to-the-llm/",
        "site": "venturebeat.com",
        "time": 1744138860000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo’s generative AI assistant, Fargo, surpassed 245 million interactions in 2024 using a model-agnostic architecture powered by Google’s Flash 2.0. The bank’s privacy-forward orchestration approach offers a blueprint for regulated industries looking to scale AI safely and efficiently. Wells Fargo’s generative AI assistant, Fargo, surpassed 245 million interactions in 2024 using a model-agnostic architecture powered by Google’s Flash 2.0. The bank’s privacy-forward orchestration approach offers a blueprint for regulated industries looking to scale AI safely and efficiently.Read More",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "660493028250772076",
        "title": "Don't panic: There are 4 reasons the US can still avoid a recession in 2025",
        "url": "https://www.businessinsider.com/recession-prediction-us-economy-downturn-trump-tariffs-inflation-wealth-2025-2025-4",
        "site": "businessinsider.com",
        "time": 1744133757000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The US economy is on \"fertile ground\" to see a recovery in the second half of 2025, Wells Fargo says. Bet_Noire/Getty, Jim Lin/Getty, SusanWoodImages/Getty, Tyler Le/BIThere's a chance the US may not tip into recession this year, according to Wells Fargo.The bank said it sees \"fertile ground\" for an economic recovery in the second half.Strategists pointed to a handful of things that suggest the US can avoid a downturn in 2025.Trump's latest tariffs and the massive sell-off in stocks have ignited fears of an economic downturn in 2025 — but one bank says there's still reason to believe that the US may not be barrelling toward a recession this year after all. Strategists at Wells Fargo on Tuesday said they're seeing a handful of promising signs that suggest the US economy may be able to avoid a downturn this year, despite heightened concerns on Wall Street amid the latest market chaos.Wells Fargo said it lowered its expectations for US GDP growth this year, but the hard economic data remains strong, adding that some of the economic weakness so far this year can be brushed off as \"payback,\" considering how strong the economy performed in 2024.\"However, key economic supports remain intact, in our view, and can limit the slowdown. We see fertile ground for a moderate second-half growth recovery,\" strategists wrote.Here are the five things that are offering a glimmer of hope as uncertainty runs high:1. Income has grown steadily, even accounting for inflationConsumer spending has shown signs of slowing in recent months, but Americans spending less than they used to is being supported by higher income growth. Inflation-adjusted disposable personal income has grown steadily in recent years, reaching an all-time-high in the fourth quarter of 2024, according to Federal Reserve data.Job growth also remains solid. The economy added a more-than-expected 228,000 payrolls last month, while the unemployment rate remained close to historic lows. The resilient job market is another factor that's \"cushioning\" consumer purchasing power, the bank said.Household wealth has climbedStocks were deep in correction territory last week, with the S&P 500 and the Nasdaq 100 being pulled into official bear market territory amid the broader market sell-off.But household wealth was elevated prior to the sell-off, which has given Americans, especially higher-income Americans, some breathing room. US household net worth climbed to an all-time high of $160 trillion in the fourth quarter of last year.\"Past windfall gains in stocks and other financial assets are sufficient to propel upper-income spending, in our view, especially as pent-up demand builds into the warmer months,\" Wells Fargo strategists said.3. Long-term interest rates are downBorrowing costs in the economy have eased in recent months, which is a positive for US consumers.The yield on the 10-year US Treasury bond, which is reflective of long-term rates in the economy, slumped to its lowest level since October last week amid the market sell-off.Mortgage rates have also eased. The average 30-year fixed rate ticked lower to 6.6% in the last week, according to Freddie Mac data, well below the peak of 7.79% in 2023.\"Recent declines in long-term interest rates have already helped stabilize credit-sensitive sectors like housing,\" the bank said.4. Financial markets remain liquidThere's less money sloshing around in financial markets than there was prior to the sell-off. But liquidity levels still remain \"more supportive\" compared to levels seen prior to previous recessions, Wells Fargo said.\"Specifically, bank reserves are plentiful,\" strategists said, adding that credit spreads, a reflection of the perceived risk to holding debt in the corporate bond market over a benchmark, also remain \"well shy\" of levels previously associated with financial stress.Markets, though, remain tepid on the outlook for 2025, with most investors feeling wary after the latest round of volatility. According to the AAII's latest Investor Sentiment Survey, 61% of investors said they felt bearish on the outlook for stocks over the next six months.Other banks, like Goldman Sachs and JPMorgan, have raised their recession forecasts in recent weeks, citing Trump's trade war as the main factor that could push the US into a contraction.Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4199065495105846932",
        "title": "Why Wells Fargo’s asset cap could be a blessing in disguise as recession fears roil markets",
        "url": "https://www.cnbc.com/2025/04/08/why-wells-fargo-asset-cap-could-be-blessing-in-disguise-as-recession-fears-mount.html",
        "site": "cnbc.com",
        "time": 1744132375000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Piper Sandler analysts upgraded the bank stock to a buy from a hold-equivalent rating.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7290746213407845677",
        "title": "Ross Stores gains after Wells Fargo calls it a defensive standout amid crumbling economic data",
        "url": "https://seekingalpha.com/news/4429407-ross-stores-gains-after-wells-fargo-calls-it-a-defensive-standout-amid-crumbling-economic-data",
        "site": "seekingalpha.com",
        "time": 1744121375000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1370445727516087180",
        "title": "Wix.com climbs after upgrade to Equal Weight by Wells Fargo | $WIX",
        "url": "https://seekingalpha.com/news/4429429-wixcom-climbs-after-upgrade-to-equal-weight-by-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1744119522000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3438203732091353856",
        "title": "Wells Fargo upgraded to Overweight at Piper",
        "url": "https://seekingalpha.com/news/4429405-wells-fargo-upgraded-to-overweight-at-piper",
        "site": "seekingalpha.com",
        "time": 1744115446000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7358164199058435934",
        "title": "Trump's tariffs slammed the market and our financial stocks. 1 of them is a buy",
        "url": "https://www.cnbc.com/2025/04/03/trumps-tariffs-slammed-the-market-and-our-financial-stocks-1-of-them-is-a-buy.html",
        "site": "cnbc.com",
        "time": 1743704594000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Shares of Goldman Sachs, BlackRock and Wells Fargo plunged Thursday amid the global market selloff.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-943102838352188869",
        "title": "Wells Fargo sees 5 reasons investors should brace for Tesla stock to drop another 50%",
        "url": "https://www.businessinsider.com/tesla-stock-price-crash-outlook-decline-elon-musks-tsla-cybercab-2025-4",
        "site": "businessinsider.com",
        "time": 1743535422000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The bank is skeptical about the timing of a cheaper Tesla model, as well as the success of a coming robotaxi service. Artur Widak/NurPhotoWells Fargo maintains 'Underweight' rating on Tesla, citing no stock rebound soon.Tesla's vehicle deliveries are expected to decline in Europe, China, and the US.Earnings may drop 25% by 2025 due to lower deliveries and lower profit margins because of price cuts.The pain for Tesla investors may not be over, according to a Tuesday note from Wells Fargo.For Wells Fargo analyst Colin Langan, there are a host of reasons Tesla stock should continue trending toward the bank's $130 price target, which represents a potential downside of 53% from current levels.Analysts at the bank reiterated their \"Underweight\" rating and added Tesla stock to their tactical ideas list for the second quarter, suggesting they don't see a rebound imminent. Shares of Tesla have plunged 32% year-to-date and are down 44% since mid-December.Here are the problems the bank sees ahead for Tesla. Vehicle deliveries will disappointA slowdown in Tesla vehicle sales in Europe, China, and the US will fuel a slowdown in vehicle deliveries for the first quarter, likely disappointing investors.Wells Fargo highlighted that through 2025, deliveries were trending 40% lower in Europe, 14% lower in China, and 3% lower in North America.The slowdown in Tesla sales coincides with nationwide protests against the car company, driven by CEO Elon Musk's close ties to the Trump administration and his work with DOGE to slash the government's budget and reduce the federal workforce.Earnings set to declineWells Fargo warned that the expected sales slowdown will fuel a further decline in Tesla's earnings results.The bank noted that Tesla has few levers to pull to drive a sales boom, as the company has already lowered prices over the past two years.Additionally, the potential elimination of a $7,500 Federal tax credit by the Trump administration could further exacerbate Tesla's sales woes.The bank estimates that the combination of lower deliveries and price cuts will reduce Tesla's earnings per share by 25% in 2025.Questions surrounding a low-cost modelMost of Wall Street's bullish outlook for Tesla stock hinges on the company releasing a low-cost vehicle priced under $30,000.The arrival of the long-awaited cheap Tesla isn't as imminent as some have expected, though, the bank suggested. \"The lack of details so close to the reveal makes us cautious on the affordable model,\" Langan said.If the lower-cost \"Model 2.5\" is released, it would likely boost sales, but also weigh on profit margins if it diverts buyers away from Tesla's higher-cost vehicles.Wells Fargo estimates that new model launches cannabialize about 16% of related model volume for Tesla.Not sold on the CybercabTesla's highly anticipated launch of a robotaxi network in Austin, Texas in June isn't winning over Langan, who's concerned that its technological approach to autonomous driving may not be the right one.\"We remain skeptical of a safe & successful Austin Cybercab launch given limited unsupervised testing & their vision-only approach,\" Langan said, adding that experts believe Tesla's autonomous driving tech has \"considerable safety concerns.\"Tesla uses a suite of cameras and software for its self-driving technology, rather than the more expensive LIDAR systems used by Waymo and other fully self-driving platforms.On top of that, investor expectations for the self-driving rollout are big, and Tesla may not be able to deliver.\"Anything short of a deployed fleet ride-hailing paying consumers by this June will likely be seen as disappointing,\" Langan added.Valuation not attractiveFinally, Langan highlighted that at its current valuation, Tesla stock screens poorly relative to its mega-cap tech peers.Its price-to-earnings multiple of 96x is nearly quadruple the 25x multiple of others in the Magnificent 7 cohort — and that higher valuation comes with slower earnings growth.Langan estimates Tesla will deliver three-year earnings per share growth of 3%, well below the Magnificent 7 of about 15%.Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4226957702675763595",
        "title": "Wells Fargo warns Tesla could fall 50% after deliveries, earnings, and the Cybercab rollout disappoint",
        "url": "https://seekingalpha.com/news/4427414-wells-fargo-warns-tesla-could-fall-50-after-deliveries-earnings-and-the-cybercab-rollout-disappoint",
        "site": "seekingalpha.com",
        "time": 1743524975000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6493759294957353067",
        "title": "Wells Fargo calls a drug stock and a bank buys — here's why we agree",
        "url": "https://www.cnbc.com/2025/04/01/wells-fargo-calls-a-drug-stock-and-a-bank-buys-heres-why-we-agree.html",
        "site": "cnbc.com",
        "time": 1743524650000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "7742870866506636979",
        "title": "SPDR Wells Fargo Preferred Stock ETF declares monthly distribution of $0.1800",
        "url": "https://seekingalpha.com/news/4427413-spdr-wells-fargo-preferred-stock-etf-declares-monthly-distribution-of-01800",
        "site": "seekingalpha.com",
        "time": 1743512958000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "9063878350611650455",
        "title": "Bloomberg Real Yield 03/28/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-03-28/bloomberg-real-yield-03-28-2025-video",
        "site": "bloomberg.com",
        "time": 1743188380000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Vonnie Quinn highlights the market-moving news you need to know. Today's guests: TD Securities US Rates Strategist Molly Brooks, BlackRock Lead Portfolio Manager Total Return Fund David Rogal, Wells Fargo Global Head of High-Grade Syndicate Maureen O'Connor, and Barings Head of Consumer ABS and CMBS Yulia Alekseeva. (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5784001123153986150",
        "title": "High-Grade Market 'Insulated': Wells Fargo's O'Connor",
        "url": "https://www.bloomberg.com/news/videos/2025-03-28/high-grade-market-insulated-wells-fargo-s-o-connor-video",
        "site": "bloomberg.com",
        "time": 1743187500000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo Global Head of High-Grade Syndicate Maureen O'Connor says the high-grade market \"tends to be better insulated\" when it comes to broader market choppiness. Barings Head of Consumer ABS, CMBS Yulia Alekseeva is \"not alarmed\" with spreads recent widening. They speak with Vonnie Quinn on \"Real Yield.\" (Source: Bloomberg) Wells Fargo & Co Photographer: Ron Antonelli/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2432360003613751699",
        "title": "O'Connor, Alekseeva on High-Grade Market, ABS",
        "url": "https://www.bloomberg.com/news/videos/2025-03-28/o-connor-alekseeva-on-high-grade-market-abs-video",
        "site": "bloomberg.com",
        "time": 1743185258000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "5784001123153986150"
        ],
        "description": "Wells Fargo Global Head of High-Grade Syndicate Maureen O'Connor and Barings Head of Consumer ABS and CMBS Yulia Alekseeva discuss the state of high-grade and ABS markets amid the recent market volatility with Vonnie Quinn on 'Bloomberg Real Yield.' (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "823379589660834052",
        "title": "Bausch + Lomb extends drop as Wells Fargo downgrades on enVista recall | $BLCO $BHC",
        "url": "https://seekingalpha.com/news/4426399-bausch-lomb-stock-drops-wells-fargo-downgrades",
        "site": "seekingalpha.com",
        "time": 1743168782000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8840517881017755429",
        "title": "Check out how women have blown past men on 3 measures of entrepreneurship",
        "url": "https://www.businessinsider.com/women-entrepreneurs-outpacing-men-small-business-barriers-persist-2025-3",
        "site": "businessinsider.com",
        "time": 1743148921000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Women-owned businesses are growing faster compared to men's, according to Wells Fargo's most recent study.Alistair Berg/Getty ImagesWomen-owned businesses are growing faster than men-owned ones, says a recent Wells Fargo report.Women face barriers in raising capital but benefit from digital platforms and education.Black women-owned firms grew rapidly after the BLM movement in 2020, but growth has since slowed.Women entrepreneurs are outpacing men, according to Wells Fargo's latest report on the impact of women-owned businesses.Although corporate America is still predominantly led by men, the number of women-owned businesses has grown faster than those owned by men in the past five years. Small businesses helmed by women have also seen faster employment and revenue growth over that period, based on Wells Fargo's analysis of Census data.Why women are starting their own businesses\"Women see a real opportunity in entrepreneurship to do things on their own,\" said Geri Stengel, the president of Ventureneer, a market research firm that co-published the report with Wells Fargo. \"They've hit the wall in corporate America.\"While there are still significant barriers for women raising the capital needed to start a business, the report notes that solopreneurs have risen with the advent of digital platforms that democratize business opportunities. Women, in particular, have continued to flourish after federal stimulus packages aimed at supporting small businesses during the pandemic.Education is a factor as well, Stengel added. Currently women are attending and graduating from college at higher rates than men.Despite the strong recent growth in women's entrepreneurship, they're still underrepresented at the top of the corporate ladder. Women-owned companies only make up 2.4% of businesses that earn more than $20 million a year in revenue compared to men-owned businesses that make up 22.5%, according to the Wells Fargo study. The remaining balance represents companies owned by multiple people, or large corporations.Overall the gender gap between the revenue earned by all women-owned businesses is gradually closing and if the current trend continues, the study projects that it would take 120 years before women would reach equal parity with men.Where gaps and disparities persistThe study goes on to highlight that Black women-owned employer firms have experienced a growth rate three times all women-owned businesses — in part supported by diversity programs and movements like Buy Black, according to their findings.\"There was a concerted effort to support Black/African American businesses and communities after the killing of George Floyd,\" read the report's key statistics on Black women. In 2020, activists affiliated with the Black Lives Matter movement called on consumers to close the revenue gap for Black entrepreneurs by spending their dollars at Black-owned businesses. \"The growth of Black/African American women-owned employers surged between 2019 and 2024, at 51.2%, compared to all women, at 17.2%.\"But the report also noted that the growth for Black and Latino employers has cooled, with more recent political changes potentially adding to that slowdown.\"That wave has diminished to a large extent,\" Stengel said of the support for Black-owned businesses that exploded during the pandemic. \"And we're not going to really see it right now because of the DEI executive orders.\"Trump's administration has called diversity, equity, and inclusion programs, prioritizing opportunities for underrepresented groups, \"radical and wasteful.\" Businesses like Target and Amazon have also pulled back on DEI initiatives since the presidential election.This month, the US Small Business Administration announced agency-wide job cuts and priority shifts under the Trump administration.\"The agency has veered off track — doubling in size and turning into a sprawling leviathan plagued by mission creep, financial mismanagement, and waste,\" said SBA Administrator Kelly Loeffler in a press release. Several grants are being terminated including the Community Navigator Pilot Program that awarded funding to small businesses in underserved areas.\"Just like the small business owners we support, we must do more with less,\" Loeffler continued.Read the original article on Business Insider Women-owned businesses are growing faster compared to men's, according to Wells Fargo's most recent study.Alistair Berg/Getty ImagesWomen-owned businesses are growing faster than men-owned ones, says a recent Wells Fargo report.Women face barriers in raising capital but benefit from digital platforms and education.Black women-owned firms grew rapidly after the BLM movement in 2020, but growth has since slowed.Women entrepreneurs are outpacing men, according to Wells Fargo's latest report on the impact of women-owned businesses.Although corporate America is still predominantly led by men, the number of women-owned businesses has grown faster than those owned by men in the past five years. Small businesses helmed by women have also seen faster employment and revenue growth over that period, based on Wells Fargo's analysis of Census data.Why women are starting their own businesses\"Women see a real opportunity in entrepreneurship to do things on their own,\" said Geri Stengel, the president of Ventureneer, a market research firm that co-published the report with Wells Fargo. \"They've hit the wall in corporate America.\"While there are still significant barriers for women raising the capital needed to start a business, the report notes that solopreneurs have risen with the advent of digital platforms that democratize business opportunities. Women, in particular, have continued to flourish after federal stimulus packages aimed at supporting small businesses during the pandemic.Education is a factor as well, Stengel added. Currently women are attending and graduating from college at higher rates than men.Despite the strong recent growth in women's entrepreneurship, they're still underrepresented at the top of the corporate ladder. Women-owned companies only make up 2.4% of businesses that earn more than $20 million a year in revenue compared to men-owned businesses that make up 22.5%, according to the Wells Fargo study. The remaining balance represents companies owned by multiple people, or large corporations.Overall the gender gap between the revenue earned by all women-owned businesses is gradually closing and if the current trend continues, the study projects that it would take 120 years before women would reach equal parity with men.Where gaps and disparities persistThe study goes on to highlight that Black women-owned employer firms have experienced a growth rate three times all women-owned businesses — in part supported by diversity programs and movements like Buy Black, according to their findings.\"There was a concerted effort to support Black/African American businesses and communities after the killing of George Floyd,\" read the report's key statistics on Black women. In 2020, activists affiliated with the Black Lives Matter movement called on consumers to close the revenue gap for Black entrepreneurs by spending their dollars at Black-owned businesses. \"The growth of Black/African American women-owned employers surged between 2019 and 2024, at 51.2%, compared to all women, at 17.2%.\"But the report also noted that the growth for Black and Latino employers has cooled, with more recent political changes potentially adding to that slowdown.\"That wave has diminished to a large extent,\" Stengel said of the support for Black-owned businesses that exploded during the pandemic. \"And we're not going to really see it right now because of the DEI executive orders.\"Trump's administration has called diversity, equity, and inclusion programs, prioritizing opportunities for underrepresented groups, \"radical and wasteful.\" Businesses like Target and Amazon have also pulled back on DEI initiatives since the presidential election.This month, the US Small Business Administration announced agency-wide job cuts and priority shifts under the Trump administration.\"The agency has veered off track — doubling in size and turning into a sprawling leviathan plagued by mission creep, financial mismanagement, and waste,\" said SBA Administrator Kelly Loeffler in a press release. Several grants are being terminated including the Community Navigator Pilot Program that awarded funding to small businesses in underserved areas.\"Just like the small business owners we support, we must do more with less,\" Loeffler continued.Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6735064929635767731",
        "title": "Tennessee Ends Wells Fargo Probe After Bank Drops Net Zero Goals",
        "url": "https://www.bloomberg.com/news/articles/2025-03-27/tennessee-ends-wells-fargo-probe-after-bank-drops-net-zero-goals",
        "site": "bloomberg.com",
        "time": 1743093848000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "A group of states led by Tennessee said it ended its investigation into Wells Fargo & Co.’s climate efforts after the lender ditched goals to curb greenhouse gas emissions. A Wells Fargo bank branch in New York, US, on Wednesday, March 29, 2023. Wells Fargo & Co. is scheduled to release earnings figures on April 14. Photographer: Angus Mordant/Bloomberg",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1154077116020521669",
        "title": "Tariffs may drive Mexico into recession, selloff in ‘overvalued’ peso: Wells Fargo",
        "url": "https://seekingalpha.com/news/4425734-tariffs-may-drive-mexico-into-recession-selloff-in-overvalued-peso-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1743088617000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-6992843998829404080",
        "title": "BofA Hires Wells Fargo’s Norman to Lead Americas Technology M&A",
        "url": "https://www.bloomberg.com/news/articles/2025-03-26/bofa-hires-wells-fargo-s-norman-to-lead-americas-technology-m-a",
        "site": "bloomberg.com",
        "time": 1742998529000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Bank of America Corp. hired Wells Fargo & Co.’s Chris Norman as head of Americas technology mergers and acquisitions, according to people with knowledge of the matter. A Bank of America branch in New York, US, on Friday, Jan. 10, 2025. Bank of America Corp. is scheduled to release earnings figures on January 16.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "3164744775574987211",
        "title": "Dutch Bros gains after Wells Fargo joins the crowded bull camp",
        "url": "https://seekingalpha.com/news/4425241-dutch-bros-gains-after-wells-fargo-joins-the-crowded-bull-camp",
        "site": "seekingalpha.com",
        "time": 1742990854000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3167084702890229830",
        "title": "Wells Fargo wins prescription drug pricing case filed by former employees",
        "url": "https://seekingalpha.com/news/4424574-wells-fargo-wins-prescription-drug-pricing-case-filed-former-employees",
        "site": "seekingalpha.com",
        "time": 1742852285000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4246662995616438707",
        "title": "Wells Fargo's strong rebound rally continues. How we're playing the move higher",
        "url": "https://www.cnbc.com/2025/03/24/wells-fargo-strong-rebound-rally-continues-how-were-playing-the-move-higher-.html",
        "site": "cnbc.com",
        "time": 1742847435000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Traders on Monday brushed off price target cuts and, instead, focused on signals that the U.S. may avoid starting a full-blown trade war.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7855608899311162618",
        "title": "Wells Fargo sees opportunities in MidCaps – here are SA’s top Quant-rated",
        "url": "https://seekingalpha.com/news/4424433-wells-fargo-sees-opportunities-in-midcaps-here-are-sa-s-top-quant-rated",
        "site": "seekingalpha.com",
        "time": 1742839952000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3657749261641912525",
        "title": "Wells Fargo, USBank favored by Morgan Stanley among super-regional banks",
        "url": "https://seekingalpha.com/news/4424132-wells-fargo-usbank-favored-by-morgan-stanley-among-super-regional-banks",
        "site": "seekingalpha.com",
        "time": 1742828468000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "3813161327225896578",
        "title": "FactSet Research Systems cut to Underweight as Wells Fargo sees risks to ASV guide",
        "url": "https://seekingalpha.com/news/4423480-factset-research-systems-cut-to-underweight-as-wells-fargo-sees-risks-to-asv-guide",
        "site": "seekingalpha.com",
        "time": 1742566588000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-5337565464995048111",
        "title": "JPMorgan Chase is the 'Nvidia of banking,' Wells Fargo's Mayo says",
        "url": "https://seekingalpha.com/news/4423040-jpmorgan-chase-is-the-nvidia-of-banking-wells-fargos-mayo-says",
        "site": "seekingalpha.com",
        "time": 1742497729000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4398030630141586428",
        "title": "Bloomberg Retracts Incorrect Story on South African Bonds",
        "url": "https://www.bloomberg.com/news/articles/2025-03-20/bloomberg-retracts-incorrect-story-on-south-african-bonds",
        "site": "bloomberg.com",
        "time": 1742473647000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Bloomberg retracted a story published on March 19 that incorrectly cited filings as showing Franklin Resources, JPMorgan and Wells Fargo had been selling their South African bond holdings. The reporting did not meet Bloomberg’s editorial standards. We regret the error.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1858021299607983105",
        "title": "Autodesk activist involvement shows 'multiple ways to win,' Wells Fargo says",
        "url": "https://seekingalpha.com/news/4422740-autodesk-activist-involvement-shows-multiple-ways-to-win-wells-fargo-says",
        "site": "seekingalpha.com",
        "time": 1742472621000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-9160211779921699292",
        "title": "Fed Holding Steady Is the Way to Go, Betsy Duke Says",
        "url": "https://www.bloomberg.com/news/videos/2025-03-19/fed-holding-steady-is-the-way-to-go-betsy-duke-says-video",
        "site": "bloomberg.com",
        "time": 1742418735000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Former Federal Reserve Governor and former Wells Fargo Chair Betsy Duke reacts to Federal Reserve officials holding their benchmark interest rate steady for a second straight meeting. She speaks on “Bloomberg The Close.”",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "5393345746423586462",
        "title": "JPMorgan, Wells Fargo Dump South African Bonds as US Ties Sour",
        "url": "https://www.bloomberg.com/news/articles/2025-03-19/foreign-investors-sour-on-south-african-bonds-as-us-ties-worsen",
        "site": "bloomberg.com",
        "time": 1742385947000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Franklin Resources Inc., JPMorgan Chase & Co. and Wells Fargo & Co. are among institutional investors that have dumped South African bonds this quarter, fueling outflows at a rate not seen since before elections in May. A resident looks out towards the central business district in Johannesburg, South Africa.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-545605601920962243",
        "title": "Boeing's cash flow peak will limit gains for stock, Wells Fargo says",
        "url": "https://seekingalpha.com/news/4421870-boeings-cash-flow-peak-will-limit-gains-for-stock-wells-fargo-says",
        "site": "seekingalpha.com",
        "time": 1742321338000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "6420362413439531380",
        "title": "What Nvidia's CEO must tell investors — plus, another positive step for Wells Fargo",
        "url": "https://www.cnbc.com/2025/03/18/what-nvidias-ceo-must-tell-investors-plus-another-positive-step-for-wells-fargo.html",
        "site": "cnbc.com",
        "time": 1742314538000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7776686188460072652",
        "title": "Wells Fargo says it just had another regulatory order lifted",
        "url": "https://www.marketwatch.com/story/wells-fargo-says-it-just-had-another-regulatory-order-lifted-f54060f9?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1742251380000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. on Monday said that regulators had terminated a 2021 enforcement order related to loss-mitigation issues in its home-lending business, marking the latest such order to be lifted from the bank.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4161244976072543511",
        "title": "Wells Fargo Exits OCC Consent Order Tied to Home Loan Practices",
        "url": "https://www.bloomberg.com/news/articles/2025-03-17/wells-fargo-exits-occ-consent-order-tied-to-home-loan-practices",
        "site": "bloomberg.com",
        "time": 1742247991000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo & Co. said the Office of the Comptroller of the Currency freed the bank from a 2021 consent order tied to deficiencies in its process for helping customers avoid foreclosure, resolving another in a series of missteps that date from the previous decade. Charles Scharf, chief executive officer of Wells Fargo & Co., speaks during a House Financial Services Committee hearing in Washington, D.C., US, on Wednesday, Sept. 21, 2022. The CEOs of the biggest US consumer banks are set to warn lawmakers that Americans are struggling amid surging inflation, as they brace for tough questions about how they're helping customers being pummeled by rising prices.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4841868321339048633",
        "title": "Boeing Stock Dropped More Than 30% Last Year. It Can Tumble Another 30%, Wells Fargo Says.",
        "url": "https://www.barrons.com/articles/boeing-stock-price-sell-9db50261?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1742242560000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "1351190747445719013",
        "title": "American Tower upgraded to Overweight as Wells Fargo turns more constructive on tower REITs",
        "url": "https://seekingalpha.com/news/4421265-american-tower-upgraded-to-overweight-as-wells-fargo-turns-more-constructive-on-tower-reits",
        "site": "seekingalpha.com",
        "time": 1742229392000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7574522204410676628",
        "title": "Wells Fargo's Samana Expects the Dollar to Rally",
        "url": "https://www.bloomberg.com/news/videos/2025-03-17/wells-fargo-s-samana-expects-the-dollar-to-rally-video",
        "site": "bloomberg.com",
        "time": 1742220657000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Sameer Samana, Wells Fargo Investment Institute senior global market strategist, expects the US dollar to rally from here as tech starts to bottom out and \"hot money\" comes back home. He's on \"Bloomberg Surveillance.\" (Source: Bloomberg)",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4138313737732707490",
        "title": "Check Point upgraded to Overweight as new CEO is 'game changer': Wells Fargo",
        "url": "https://seekingalpha.com/news/4420737-check-point-upgraded-to-overweight-as-new-ceo-is-game-changer-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1741962221000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-5914125077834995596",
        "title": "Oscar Health falls 9% following Wells Fargo downgrade",
        "url": "https://seekingalpha.com/news/4420436-oscar-health-falls-9-percent-following-wells-fargo-downgrade",
        "site": "seekingalpha.com",
        "time": 1741892912000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2685318958586448262",
        "title": "Wells Fargo’s stock rises as analyst proclaims ‘good entry point’ for investors",
        "url": "https://www.marketwatch.com/story/wells-fargos-stock-rises-as-analyst-proclaims-good-entry-point-for-investors-211c13be?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1741879140000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "RBC Capital says Wells Fargo’s stock is a good buy after the recent financial-stock selloff, though most bank stocks remain in the red.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7216138532839643328",
        "title": "Wells Fargo stock, down 13% M/M, upgraded to Outperform at RBC",
        "url": "https://seekingalpha.com/news/4420319-wells-fargo-stock-down-13-mm-upgraded-to-outperform-at-rbc",
        "site": "seekingalpha.com",
        "time": 1741873526000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-3300039204970269501",
        "title": "BKU, WBS, BANC are Wells Fargo's top picks for potential regional bank rebound",
        "url": "https://seekingalpha.com/news/4419867-bku-wbs-banc-are-wells-fargos-top-picks-for-potential-regional-bank-rebound",
        "site": "seekingalpha.com",
        "time": 1741790635000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-8387874359642300263",
        "title": "How a hidden benefit of a Wells Fargo asset cap removal could save the bank billions",
        "url": "https://www.cnbc.com/2025/03/11/heres-a-hidden-benefit-of-wells-fargos-asset-cap-removal.html",
        "site": "cnbc.com",
        "time": 1741712188000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "The bank paid $2.5 billion more in remediation efforts in 2023 than in 2018, which was a year before Charlie Scharf became CEO.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1852042243300979992",
        "title": "Houlihan Lokey stock gains after double-upgrade to Overweight at Wells Fargo",
        "url": "https://seekingalpha.com/news/4419397-houlihan-lokey-stock-gains-after-double-upgrade-to-overweight-at-wells-fargo",
        "site": "seekingalpha.com",
        "time": 1741703195000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "similar_stories": [
            "-4138313737732707490"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "4000306654314756370",
        "title": "Nvidia decline is a 'buying opportunity,' as Wells Fargo says GTC 'can't come fast enough'",
        "url": "https://seekingalpha.com/news/4419399-nvidia-decline-is-a-buying-opportunity-as-wells-fargo-says-gtc-cant-come-fast-enough",
        "site": "seekingalpha.com",
        "time": 1741702966000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-4912810721079736856",
        "title": "Report: Wells Fargo Sues JPMorgan Chase Over Commercial Real Estate Loan",
        "url": "https://www.pymnts.com/news/banking/2025/report-wells-fargo-sues-jpmorgan-chase-over-commercial-real-estate-loan/",
        "site": "pymnts.com",
        "time": 1741646380000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Wells Fargo reportedly sued JPMorgan Chase on Monday (March 10), alleging that the bank knowingly made a loan based on faulty numbers, knowing that the loan would later be sold off in pieces to investors. In its lawsuit, Wells Fargo seeks to recover losses for investors, Reuters reported Monday. Reached by PYMNTS, JPMorgan Chase declined […] The post Report: Wells Fargo Sues JPMorgan Chase Over Commercial Real Estate Loan appeared first on PYMNTS.com. Wells Fargo reportedly sued JPMorgan Chase on Monday (March 10), alleging that the bank knowingly made a loan based on faulty numbers, knowing that the loan would later be sold off in pieces to investors. In its lawsuit, Wells Fargo seeks to recover losses for investors, Reuters reported Monday. Reached by PYMNTS, JPMorgan Chase declined to comment on the report. The case involves a $481 million commercial real estate loan made in 2019, according to the report. Wells Fargo alleges that JPMorgan Chase learned before the purchase closed that the seller had overstated the property’s historical net operating income by 25% but went ahead with the loan because parts of it would be sold to investors, the report said. When the borrower defaulted in 2022, investors lost tens of millions of dollars, per the report. With its lawsuit, Wells Fargo aims to force JPMorgan Chase to repurchase the loan or pay damages for breach of contract, according to the report. It was reported in November that double commercial property loan defaults were at their highest point in 10 years. This situation raised worries that a lending practice known as “extend and pretending” was masking an increasing system risk and that the increase in loan modification was distorting loan markets. In October, the New York Federal Reserve warned that lenders seemed in many cases to be offering breaks to property borrowers for the sole purpose of delaying a write-off. “Banks’ ‘extended-and-pretended’ their impaired commercial real estate mortgages in the post-pandemic period,” the central bank’s researchers wrote, cautioning that generous modifications could lead “to credit misallocation and a build-up of financial fragility.” In April, it was reported that banks were facing a $2 trillion “wall” of property debt and must reduce their exposure to commercial real estate as that debt comes due. “Banks will be under pressure,” Newmark CEO Barry Gosin told the Financial Times (FT) in an interview posted April 1. Newmark, a real estate advisory and brokerage company, said at the time that the estimated $2 trillion of U.S. commercial real estate debt maturing between then and 2026 would have to be refinanced at much higher interest rates. The post Report: Wells Fargo Sues JPMorgan Chase Over Commercial Real Estate Loan appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "2533218944972687105",
        "title": "Wells Fargo’s Harvey’s top apparel stocks with good fundamentals and macro",
        "url": "https://seekingalpha.com/news/4418969-wells-fargo-s-harvey-s-top-apparel-stocks-with-good-fundamentals-and-macro",
        "site": "seekingalpha.com",
        "time": 1741620141000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-1064176081294267691",
        "title": "The US CFPB drops its lawsuit against Zelle operator EWS, JPMorgan Chase, Bank of America, and Wells Fargo, after suing them in December over fraud allegations (Hugh Son/CNBC)",
        "url": "http://www.techmeme.com/250304/p26#a250304p26",
        "site": "techmeme.com",
        "time": 1741129801000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Hugh Son / CNBC: The US CFPB drops its lawsuit against Zelle operator EWS, JPMorgan Chase, Bank of America, and Wells Fargo, after suing them in December over fraud allegations — The Consumer Financial Protection Bureau on Tuesday dismissed its lawsuit against the operator of the Zelle payments network …",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-7121133630128812928",
        "title": "CFPB Drops Lawsuit Against Banks Over Zelle Scams",
        "url": "https://www.nytimes.com/2025/03/04/business/zelle-scams-cfpb-lawsuit.html",
        "site": "nytimes.com",
        "time": 1741124760000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "A spokeswoman for the payment app’s parent company said the lawsuit against three large banks was “without merit, and legally and factually flawed.” The Consumer Financial Protection Bureau had sued Bank of America, JPMorgan Chase and Wells Fargo — the owners of the Zelle network — near the end of the Biden administration.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-279498759098535549",
        "title": "Trump's tariffs are giving companies a chance to earn some free PR — and one already took it",
        "url": "https://www.businessinsider.com/businesses-react-trumps-tariffs-canada-china-mexico-discussing-price-impact-2025-3",
        "site": "businessinsider.com",
        "time": 1741119287000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Trump's tariffs would have a significant cost on the US auto-making industry, Wells Fargo analysts have said.Allison Robbert-Pool/Getty ImagesSome companies are already telling customers they'll need to raise prices due to Trump's tariffs.At least one — Chipotle — has said it's not planning on passing the cost to consumersThe tariff announcement has become a key talking point businesses now need to consider.I'd like to formally announce I will not be passing the cost of the tariffs down to Business Insider Today's newsletter readers.President Donald Trump's taxes on Canadian, Mexican, and Chinese goods have absolutely no impact on my ability to produce the daily newsletter. (And it's also free to subscribe.)But don't let the details get in the way of a feel-good story: I am willing to carry the burden of these taxes for you, the reader.My declaration might sound silly (It is!), but there are undoubtedly some serious conversations taking place at businesses about communicating the impact of these new tariffs.Some companies aren't wasting time making clear that customers will have to take this one on the chin. Target CEO Brian Cornell said some grocery costs could go up as early as this week, while Best Buy CEO Corie Barry said price increases on imported products are now \"highly likely.\"Both executives didn't get too specific on their earnings calls, but the message was clear: Don't blame us if we have to raise prices.They're not alone. Companies big and small have been telegraphing potential price increases due to tariffs for a while. As legendary investor Warren Buffett recently said of tariffs: \"Over time, they are a tax on goods. I mean, the Tooth Fairy doesn't pay 'em!\" (We've got a full rundown on the products most susceptible to tariffs.)But one company took a very different approach. Before Tuesday's announcement, Chipotle made clear it was not planning on raising its prices due to tariffs.Chipotle CEO Scott Boatwright told \"NBC Nightly News\" that the chain planned to absorb any price increases.\"We are fortunate to have such an extraordinary economic model at Chipotle that we can withstand those types of inflationary pressures and not have to pass those costs off to the consumer,\" Boatwright said.What a win for the finance bros! You can't tax these gains! I'll take double meat and some guac, please!Oh, wait, there's one more thing.Boatright went on to say Chipotle could still raise prices if the cost of the tariffs becomes a \"significant headwind.\"Oh, ok…And tariffs aren't even set to hit Chipotle that hard. At least, according to Chipotle. Executives previously played down the impact of tariffs on a recent earnings call. Despite Mexico supplying roughly 90% of the avocados eaten in the US, according to CNBC, the chain only gets about half its supply from Mexico. And Chief Financial Officer Adam Rymer said the produce it gets from our neighbors to the south accounts for only about 2% of its sales.Hmmm, alright.Chipotle is also not philosophically opposed to passing along the cost to customers. In fact, the chain literally just did it. In December, Chipotle raised prices by 2% nationwide to offset inflation, its first price increase in over a year. The price hike also addressed the hit to its profit margin that came with ensuring \"consistent and generous portions.\"So, to recap: A chain that says it's pretty insulated from tariffs and recently raised its prices will do its best not to raise prices on consumers. (But no promises.)Siri, where is the nearest Moe's?To be fair to Chipotle, the tariffs are projected to cost the chain some money. Rymer previously estimated that tariffs on Mexico, Canada, and China would increase its cost of sales — or how much it pays for the stuff it sells you — by about 0.6%.That's not nothing, especially when fast-food chains have been fighting to keep prices down in the face of an uncertain economic future. So, credit Chipotle for attempting to avoid passing on the costs to customers rather than just waving the white flag on tariffs or using the trade tax as cover to raise its prices.\"It is our intent today to hold pricing constant because we don't know if the tariffs are transitory, if they're going to be permanent, or how they will impact our business in the future.\" Laurie Schalow, chief corporate affairs officer for Chipotle, told me via email.But just as some have said Trump's tariff plan is part of a bigger negotiation tactic, don't be surprised if companies look to borrow from the president's playbook. The hot-button issue could be an excuse for businesses to raise prices or an opportunity to tout that they're holding the line to protect their customers.Read the original article on Business Insider Trump's tariffs would have a significant cost on the US auto-making industry, Wells Fargo analysts have said.Allison Robbert-Pool/Getty ImagesSome companies are already telling customers they'll need to raise prices due to Trump's tariffs.At least one — Chipotle — has said it's not planning on passing the cost to consumersThe tariff announcement has become a key talking point businesses now need to consider.I'd like to formally announce I will not be passing the cost of the tariffs down to Business Insider Today's newsletter readers.President Donald Trump's taxes on Canadian, Mexican, and Chinese goods have absolutely no impact on my ability to produce the daily newsletter. (And it's also free to subscribe.)But don't let the details get in the way of a feel-good story: I am willing to carry the burden of these taxes for you, the reader.My declaration might sound silly (It is!), but there are undoubtedly some serious conversations taking place at businesses about communicating the impact of these new tariffs.Some companies aren't wasting time making clear that customers will have to take this one on the chin. Target CEO Brian Cornell said some grocery costs could go up as early as this week, while Best Buy CEO Corie Barry said price increases on imported products are now \"highly likely.\"Both executives didn't get too specific on their earnings calls, but the message was clear: Don't blame us if we have to raise prices.They're not alone. Companies big and small have been telegraphing potential price increases due to tariffs for a while. As legendary investor Warren Buffett recently said of tariffs: \"Over time, they are a tax on goods. I mean, the Tooth Fairy doesn't pay 'em!\" (We've got a full rundown on the products most susceptible to tariffs.)But one company took a very different approach. Before Tuesday's announcement, Chipotle made clear it was not planning on raising its prices due to tariffs.Chipotle CEO Scott Boatwright told \"NBC Nightly News\" that the chain planned to absorb any price increases.\"We are fortunate to have such an extraordinary economic model at Chipotle that we can withstand those types of inflationary pressures and not have to pass those costs off to the consumer,\" Boatwright said.What a win for the finance bros! You can't tax these gains! I'll take double meat and some guac, please!Oh, wait, there's one more thing.Boatright went on to say Chipotle could still raise prices if the cost of the tariffs becomes a \"significant headwind.\"Oh, ok…And tariffs aren't even set to hit Chipotle that hard. At least, according to Chipotle. Executives previously played down the impact of tariffs on a recent earnings call. Despite Mexico supplying roughly 90% of the avocados eaten in the US, according to CNBC, the chain only gets about half its supply from Mexico. And Chief Financial Officer Adam Rymer said the produce it gets from our neighbors to the south accounts for only about 2% of its sales.Hmmm, alright.Chipotle is also not philosophically opposed to passing along the cost to customers. In fact, the chain literally just did it. In December, Chipotle raised prices by 2% nationwide to offset inflation, its first price increase in over a year. The price hike also addressed the hit to its profit margin that came with ensuring \"consistent and generous portions.\"So, to recap: A chain that says it's pretty insulated from tariffs and recently raised its prices will do its best not to raise prices on consumers. (But no promises.)Siri, where is the nearest Moe's?To be fair to Chipotle, the tariffs are projected to cost the chain some money. Rymer previously estimated that tariffs on Mexico, Canada, and China would increase its cost of sales — or how much it pays for the stuff it sells you — by about 0.6%.That's not nothing, especially when fast-food chains have been fighting to keep prices down in the face of an uncertain economic future. So, credit Chipotle for attempting to avoid passing on the costs to customers rather than just waving the white flag on tariffs or using the trade tax as cover to raise its prices.\"It is our intent today to hold pricing constant because we don't know if the tariffs are transitory, if they're going to be permanent, or how they will impact our business in the future.\" Laurie Schalow, chief corporate affairs officer for Chipotle, told me via email.But just as some have said Trump's tariff plan is part of a bigger negotiation tactic, don't be surprised if companies look to borrow from the president's playbook. The hot-button issue could be an excuse for businesses to raise prices or an opportunity to tout that they're holding the line to protect their customers.Read the original article on Business Insider",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "8819346664834767897",
        "title": "CFPB drops suit against Zelle, JPMorgan, Wells Fargo, Bank of America - report",
        "url": "https://seekingalpha.com/news/4417099-cfpb-drops-suit-against-zelle-jpmorgan-wells-fargo-bank-of-america-report",
        "site": "seekingalpha.com",
        "time": 1741114296000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-8053800642972331450",
        "title": "Capital One and Wells Fargo Rated ‘Outstanding’ in CRA Compliance",
        "url": "https://www.pymnts.com/news/banking/2025/capital-one-wells-fargo-rated-outstanding-community-reinvestment-act-compliance/",
        "site": "pymnts.com",
        "time": 1741039876000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "wfc"
        ],
        "description": "Capital One and Wells Fargo are among 10 financial institutions rated “outstanding” in the Office of the Comptroller of the Currency’s (OCC) latest list of Community Reinvestment Act (CRA) performance evaluations. Another 16 financial institutions were rated “satisfactory,” the regulator said in a Monday (March 3) press release. None of the financial institutions whose CRA […] The post Capital One and Wells Fargo Rated ‘Outstanding’ in CRA Compliance appeared first on PYMNTS.com. Capital One and Wells Fargo are among 10 financial institutions rated “outstanding” in the Office of the Comptroller of the Currency’s (OCC) latest list of Community Reinvestment Act (CRA) performance evaluations. Another 16 financial institutions were rated “satisfactory,” the regulator said in a Monday (March 3) press release. None of the financial institutions whose CRA performance evaluations became public in February were rated “needs to improve” or “substantial noncompliance.” “Under the CRA, the OCC assesses an institution’s record of meeting the credit needs of its entire community, including low- and moderate-income neighborhoods, consistent with the safe and sound operation of such institution,” the release said. The 10 banks rated “outstanding” include McLean, Virginia-based Capital One, National Association; Collinsville, Illinois-based Collinsville Building and Loan Association; Toledo, Illinois-based First Neighbor Bank, National Association; Dunkirk, New York-based Lake Shore Savings Bank; Lyons, Kansas-based Lyons Federal Bank; Bronx, New York-based Ponce Bank; Coalgate, Oklahoma-based Shamrock Bank, National Association; Granger, Texas-based The Granger National Bank; Enid, Oklahoma-based The Security National Bank of Enid; and Sioux Falls, South Dakota-based Wells Fargo Bank, National Association. Capital One was rated outstanding in each of the three major factors that support the rating: the lending test, the investment test and the service test, according to the public disclosure of its CRA performance evaluation. The evaluation highlighted that Capital One offered flexible secured consumer credit card products that provided access to credit to individuals who did not meet the bank’s traditional underwriting guidelines, formalized its volunteer services under a pro bono volunteer program that matches bank employees’ skills with needs identified by nonprofit organizations, and made an adequate percentage of its loans in its assessment areas. Wells Fargo, too, was rated outstanding in each of the three major factors, per the public disclosure of the bank’s CRA performance evaluation. The evaluation said Wells Fargo used flexible lending programs to enhance its lending performance in multiple assessment areas, offered innovative or complex CD investment initiatives, and provided innovative retail service programs. The OCC determines the CRA ratings based on performance tests and standards outlined in the CRA rule and based on information about the institution and the community it serves, according to a questions and answers page about the program. The CRA rules were enacted in 1977 to combat discriminatory lending practices in minority neighborhoods, PYMNTS reported in October 2023. The OCC list includes national banks, federal savings associations and insured federal branches of foreign banks that have received CRA ratings, according to the release. The Federal Reserve System and the Federal Deposit Insurance Corp. (FDIC) enforce the CRA among other types of banks, PYMNTS reported in February. The post Capital One and Wells Fargo Rated ‘Outstanding’ in CRA Compliance appeared first on PYMNTS.com.",
        "tickers": [
            "wfc"
        ]
    },
    {
        "id": "-323654826099766522",
        "title": "On Semiconductor going after Allegro makes 'strategic sense,' Wells Fargo says",
        "url": "https://seekingalpha.com/news/4416208-on-semiconductor-going-after-allegro-makes-strategic-sense-wells-fargo-says",
        "site": "seekingalpha.com",
        "time": 1741013613000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "wfc"
        ],
        "tickers": [
            "wfc"
        ]
    }
]