[
    {
        "id": "8726560085549650367",
        "title": "Uber Freight unveils a scaled AI logistics network; Colgate-Palmolive is an early adopter",
        "url": "https://seekingalpha.com/news/4450855-uber-freight-unveils-a-scaled-ai-logistics-network-colgate-palmolive-is-an-early-adopter",
        "site": "seekingalpha.com",
        "time": 1747826690000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "cl"
        ],
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "2363805759302266906",
        "title": "Uber Freight bets big on AI tools to grow its business",
        "url": "https://techcrunch.com/2025/05/21/uber-freight-bets-big-on-ai-tools-to-grow-its-business/?.tsrc=rss",
        "site": "techcrunch.com",
        "time": 1747825200000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "cl"
        ],
        "description": "Three years ago, as the pandemic caused chaos for companies big and small, Colgate-Palmolive’s chief supply chain officer Luciano Sieber orchestrated a “logistics blitz.” The result gave Sieber a better understanding of how Colgate-Palmolive moves its products around the world. But it stuck Sieber with another problem: too much data. About a year ago, Sieber says he found a solution to that problem with Uber Freight. The ride-hailing service’s long-running logistics and analytics arm has been de",
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "3125624459902821551",
        "title": "Hispanic shoppers are spending less on groceries, putting pressure on consumer companies",
        "url": "https://www.cnbc.com/2025/05/06/hispanic-shoppers-groceries-coca-cola-modelo-corona-mazola.html",
        "site": "cnbc.com",
        "time": 1746529201000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "cl"
        ],
        "description": "Coca-Cola, Constellation Brands and Colgate-Palmolive reported that Hispanic consumers are spending less, which weighed on their North American sales.",
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "-4296083564346921209",
        "title": "Marketing Briefing: Major marketers like Colgate-Palmolive, P&G note ‘pensive and anxious’ consumers during earnings",
        "url": "https://digiday.com/marketing/marketing-briefing-major-marketers-like-colgate-palmolive-pg-note-pensive-and-anxious-consumers-during-earnings/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
        "site": "digiday.com",
        "time": 1745899260000,
        "favicon_url": "https://static.tickertick.com/website_icons/digiday.com.ico",
        "tags": [
            "cl"
        ],
        "description": "Major brand marketers had C-Suite executives note their own worries about consumers during earnings calls. Earnings season can be windows into what major marketers’ are thinking — especially amid the ongoing economic uncertainty caused by President Trump’s tariffs. In recent weeks, marketers have experienced decision paralysis; been expecting chaos (and regularly using the replanning muscle they formed early on in the pandemic); pushed for more flexibility in deals; and focused on operational challenges ahead of marketing cuts. They’ve also zeroed in on lackluster consumer sentiment. Major marketers like PepsiCo, Chipotle, Colgate-Palmolive, American Airlines and Procter & Gamble, had C-Suite executives note their own worries about consumers’ worries during their respective earnings calls. This is a member-exclusive article from Digiday. Continue reading it on digiday.com and subscribe to continue reading content like this.",
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "3517353005272942418",
        "title": "Colgate-Palmolive outlines Q2 tariff impacts and strategic adjustments",
        "url": "https://seekingalpha.com/news/4435776-colgate-palmolive-outlines-q2-tariff-impacts-and-strategic-adjustments",
        "site": "seekingalpha.com",
        "time": 1745596366000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "cl"
        ],
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "-8024263238642621866",
        "title": "4 stocks to watch on Friday: GILD, ABBV, CL and SLB | $GILD $CL $SLB $ABBV",
        "url": "https://seekingalpha.com/news/4435589-4-stocks-to-watch-on-friday-gild-abbv-cl-and-slb",
        "site": "seekingalpha.com",
        "time": 1745587673000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "cl"
        ],
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "-1866318183699146994",
        "title": "Colgate Cuts Sales, Profit View as Tariffs Add $200 Million Cost",
        "url": "https://www.bloomberg.com/news/articles/2025-04-25/colgate-cuts-sales-profit-view-as-tariffs-add-200-million-cost",
        "site": "bloomberg.com",
        "time": 1745580783000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "cl"
        ],
        "description": "Colgate-Palmolive Co. cut its growth and profit outlooks as tariffs are expected to add $200 million in costs this year. Colgate toothpaste. Photographer: Gabby Jones/Bloomberg",
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "-8573423210386334410",
        "title": "Colgate-Palmolive battles through macro uncertainty to record positive organic sales growth",
        "url": "https://seekingalpha.com/news/4435505-colgate-palmolive-battles-through-macro-uncertainty-to-record-positive-organic-sales-growth",
        "site": "seekingalpha.com",
        "time": 1745580437000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "cl"
        ],
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "-5800889159272350383",
        "title": "Earnings Snapshot: Colgate-Palmolive flags tariff impact to costs after Q1 beat, outlook",
        "url": "https://seekingalpha.com/news/4435529-earnings-snapshot-colgate-palmolive-flags-tariff-impact-to-costs-after-q1-beat-outlook",
        "site": "seekingalpha.com",
        "time": 1745579850000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "cl"
        ],
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "-6685412421417961579",
        "title": "Colgate-Palmolive Non-GAAP EPS of $0.91 beats by $0.05, revenue of $4.91B beats by $50M",
        "url": "https://seekingalpha.com/news/4435511-colgate-palmolive-non-gaap-eps-of-0_91-beats-by-0_05-revenue-of-4_91b-beats-by-50m",
        "site": "seekingalpha.com",
        "time": 1745578572000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "cl"
        ],
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "3486339430676240836",
        "title": "Colgate-Palmolive Q1 2025 Earnings Preview",
        "url": "https://seekingalpha.com/news/4435059-colgate-palmolive-q1-2025-earnings-preview",
        "site": "seekingalpha.com",
        "time": 1745510684000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "cl"
        ],
        "tickers": [
            "cl"
        ]
    },
    {
        "id": "7927728069450518512",
        "title": "Companies' biggest barrier to AI isn't tech — it's employee pushback. Here's how to overcome it.",
        "url": "https://www.businessinsider.com/how-to-prevent-employee-skepticism-push-back-gen-ai-2025-3",
        "site": "businessinsider.com",
        "time": 1742400481000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "cl"
        ],
        "description": "Getty Images; Karan Singh for BIWhen company leaders introduce AI to their workforces, they often face employee skepticism.Colgate-Palmolive and Rent a Mac use employee feedback and data to address AI pushback.This article is part of \"AI in Action,\" a series exploring how companies are implementing AI innovations.When leaders at Colgate-Palmolive were ready to roll out an AI Hub for employees this past summer, they knew exactly what they wanted to avoid: a small group of people implementing an AI strategy assuming they knew the best use cases for each department and pushing an AI system onto the rest of the organization.That kind of approach \"puts a bad taste in people's mouths\" and can create \"a huge amount of friction,\" said Kli Pappas, the senior director of global predictive analytics and head of AI at Colgate-Palmolive.Instead of a top-down method, the company created an internal hub through which anyone in the organization could input their natural language with instructions to build a personalized AI assistant and solve inefficient processes in their day-to-day work.Colgate's strategy avoided one of the biggest barriers companies face when adopting AI: employee pushback, hesitation, or resistance.Managing how employees experience change \"is without a doubt the toughest part\" of an AI implementation, much more so than the technology itself, said David Hilborn, a managing partner at the consulting firm West Monroe Partners. Hilborn is also the firm's organization, people, and change practice leader, so he often sees companies fail to devote enough resources to implement changes or lack a clear game plan to manage the people side of an AI initiative.\"That always leads to adoption failures,\" Hilborn said. \"Leaders have to be thinking about the people dimension.\"The big unknown: How AI affects meEmployee resistance to AI usually stems from a lack of understanding, Hilborn said. When employees don't grasp how the technology works or how it might change expectations for their roles, they often worry about losing control of responsibilities or even being displaced from their jobs.Sometimes managers don't fully understand AI themselves, which creates \"lumpy leader support\" and sows greater uncertainty among teams, said Hilborn.Without a communication plan, clear expectations on role changes, and the ability to provide feedback, employees face what Tarja Stephens, the founder of the business consultancy AI Opportunity, described as \"change fatigue,\" leaving workers exhausted by tech overhauls.\"They resist, not because they don't want to innovate, but because they really do not have the clarity of how implementing AI will affect their roles,\" Stephens said.Rent a Mac, a company that provides access to Apple devices, launched an AI-driven inventory management system in 2023. But Luca Dal Zotto, the cofounder of Rent a Mac, said the company made the mistake of publicizing the AI program prematurely without giving employees enough training or context.\"Anxiety filled the space,\" Dal Zotto said.Staff feared losing their jobs, while others questioned the tech's accuracy. Three departments — customer support, procurement, and warehouse operations — resisted AI and only begrudgingly used it. Dal Zotto said that led to a seven-week delay in implementation and cost about $85,000 in expected efficiency savings.Hilborn has seen instances like this, where an AI implementation doesn't work and leaders have to \"go back to the drawing board,\" he said. \"That is very, very, very costly.\"Making AI about the peopleUpon seeing the resistance, Rent a Mac changed its approach. It identified \"AI champions\" within the organization — employees trained on AI who could show the tangible benefits of the technology, \"reducing their peers' anxiety,\" Dal Zotto said. For example, warehouse crews found the AI system cut order processing time by 37%.With its revised AI strategy, Rent a Mac's employee engagement with the automated system rose from 31% to 89% in three months. Now, the program makes about three-fourths of the inventory decisions, freeing employees to manage exceptions and take care of customer service.Dal Zotto said the biggest lesson he learned was that deploying AI requires investment in technology strategy and people strategy.AI beyond the IT departmentEach company's approach will differ, but Stephens generally recommends a few steps to implement AI in a people-centric way: Keep the narrative around job enhancement not replacement; set clear expectations around how it will affect people's roles; and let employees experiment and offer feedback.In developing its AI strategy, Colgate-Palmolive looked to its corporate values and code of conduct around workplace culture.\"Everyone should be able to decide for themselves how AI is going to impact their own job and their own tasks,\" Pappas said.The company's AI Hub focuses on job-specific use cases — like sorting data or writing copy — rather than technicalities like AI-model types, so employees can build AI assistants that suit their needs. Colgate tells employees to think of it as if they're providing instructions to an intern.\"You don't have to know anything about GenAI,\" Pappas said.After launching the hub in July, employees built about 3,000 AI assistants in the second half of 2024. Employees share what they've built so colleagues can see how many people are using the tool and related metrics, such as the number of hours saved, and then decide whether to use it themselves.Pappas said marketing employees have built AI assistants to help with writing brand copy. A team member wrote thousands of lines of a programming language with an AI assistant, shrinking a year's worth of work into two months.Manufacturing plant workers have used AI to identify equipment issues and explain the solution in their local language rather than receiving an error code and having to search for solutions in a manual, he said.\"There's lots of small day-to-day things that AI is good at helping people with,\" Pappas said. \"Everyone gets value from it in their own unique way.\"Read the original article on Business Insider Getty Images; Karan Singh for BIWhen company leaders introduce AI to their workforces, they often face employee skepticism.Colgate-Palmolive and Rent a Mac use employee feedback and data to address AI pushback.This article is part of \"AI in Action,\" a series exploring how companies are implementing AI innovations.When leaders at Colgate-Palmolive were ready to roll out an AI Hub for employees this past summer, they knew exactly what they wanted to avoid: a small group of people implementing an AI strategy assuming they knew the best use cases for each department and pushing an AI system onto the rest of the organization.That kind of approach \"puts a bad taste in people's mouths\" and can create \"a huge amount of friction,\" said Kli Pappas, the senior director of global predictive analytics and head of AI at Colgate-Palmolive.Instead of a top-down method, the company created an internal hub through which anyone in the organization could input their natural language with instructions to build a personalized AI assistant and solve inefficient processes in their day-to-day work.Colgate's strategy avoided one of the biggest barriers companies face when adopting AI: employee pushback, hesitation, or resistance.Managing how employees experience change \"is without a doubt the toughest part\" of an AI implementation, much more so than the technology itself, said David Hilborn, a managing partner at the consulting firm West Monroe Partners. Hilborn is also the firm's organization, people, and change practice leader, so he often sees companies fail to devote enough resources to implement changes or lack a clear game plan to manage the people side of an AI initiative.\"That always leads to adoption failures,\" Hilborn said. \"Leaders have to be thinking about the people dimension.\"The big unknown: How AI affects meEmployee resistance to AI usually stems from a lack of understanding, Hilborn said. When employees don't grasp how the technology works or how it might change expectations for their roles, they often worry about losing control of responsibilities or even being displaced from their jobs.Sometimes managers don't fully understand AI themselves, which creates \"lumpy leader support\" and sows greater uncertainty among teams, said Hilborn.Without a communication plan, clear expectations on role changes, and the ability to provide feedback, employees face what Tarja Stephens, the founder of the business consultancy AI Opportunity, described as \"change fatigue,\" leaving workers exhausted by tech overhauls.\"They resist, not because they don't want to innovate, but because they really do not have the clarity of how implementing AI will affect their roles,\" Stephens said.Rent a Mac, a company that provides access to Apple devices, launched an AI-driven inventory management system in 2023. But Luca Dal Zotto, the cofounder of Rent a Mac, said the company made the mistake of publicizing the AI program prematurely without giving employees enough training or context.\"Anxiety filled the space,\" Dal Zotto said.Staff feared losing their jobs, while others questioned the tech's accuracy. Three departments — customer support, procurement, and warehouse operations — resisted AI and only begrudgingly used it. Dal Zotto said that led to a seven-week delay in implementation and cost about $85,000 in expected efficiency savings.Hilborn has seen instances like this, where an AI implementation doesn't work and leaders have to \"go back to the drawing board,\" he said. \"That is very, very, very costly.\"Making AI about the peopleUpon seeing the resistance, Rent a Mac changed its approach. It identified \"AI champions\" within the organization — employees trained on AI who could show the tangible benefits of the technology, \"reducing their peers' anxiety,\" Dal Zotto said. For example, warehouse crews found the AI system",
        "tickers": [
            "cl"
        ]
    }
]