[
    {
        "id": "3407031130612640",
        "title": "Danaher in partnership with AstraZeneca for diagnostic tests for precision medicine | $DHR $AZN",
        "url": "https://seekingalpha.com/news/4453675-danaher-partnership-astrazeneca-diagnostic-tests-precision-medicine",
        "site": "seekingalpha.com",
        "time": 1748553021000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "8389002955098543411",
        "title": "Third Point adds US Steel, Kenvue, exits Danaher, Tesla among Q1 moves",
        "url": "https://seekingalpha.com/news/4449187-third-point-adds-us-steel-kenvue-exits-danaher-tesla-among-q1-moves",
        "site": "seekingalpha.com",
        "time": 1747343550000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "2916234260298899885",
        "title": "Danaher declares $0.32 dividend | $DHR",
        "url": "https://seekingalpha.com/news/4442556-danaher-declares-0_32-dividend",
        "site": "seekingalpha.com",
        "time": 1746564632000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-1752482212897328348",
        "title": "StockWatch: Tools Giants Foresee Revenue Impacts from Tariffs, Job Cuts",
        "url": "https://www.genengnews.com/topics/drug-discovery/stockwatch-tools-giants-foresee-revenue-impacts-from-tariffs-job-cuts/",
        "site": "genengnews.com",
        "time": 1745784778000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "dhr"
        ],
        "description": "Thermo Fisher Scientific and Danaher are projecting they will lose revenue as a result of tariffs and job cuts. Both projected that their sales to academic and government (A&G) customers will shrink this year as researchers scramble to adjust their research budgets to spending cuts from the NIH. The post StockWatch: Tools Giants Foresee Revenue Impacts from Tariffs, Job Cuts appeared first on GEN - Genetic Engineering and Biotechnology News. Looming tariffs and recent job cuts from Washington have impacted two of the largest biotech tools companies that released first-quarter results this past week, prompting one to lower its earnings guidance to investors for the rest of 2025, while the other is maintaining its revenue forecast. Thermo Fisher Scientific (NYSE: TMO) and Danaher (NYSE: DHR) both acknowledged that their sales to academic and government (A&G) customers will shrink this year as researchers scramble to adjust their research budgets to spending cuts from the NIH, which in February capped at 15% its funding of indirect costs in the basic research grants it awards to researchers. The cap is essentially a cut for most labs since, according to the agency, indirect costs have averaged between 27% and 28%, with many organizations charging the agency indirect rates of more than 50%. Thermo Fisher is projecting that tariffs on pharmaceutical imports will cost the company about $400 million in revenue this year, not counting additional costs for parts and sub-assemblies of tool components made in China, while Danaher estimated a $350 million impact for the rest of 2025. Thermo Fisher also estimated a $500 million revenue loss from academic and government (A&G) customers attributable to U.S. policy changes. Marc N. Casper, Thermo Fisher Scientific chairman, president, and CEO “We’ve seen $200 million of studies canceled or put on hold, specifically vaccine,” Thermo Fisher chairman, president, and CEO Marc N. Casper told analysts on his company’s quarterly earnings call Wednesday. “About half of that is directly funded by the government through innovators, and about half of it is just from the innovators themselves. Every other aspect of clinical trial-related activity seems to be normal.” “We would expect that U.S. academics would be relatively soft of the balance of the year,” Casper added. “That’s what we embedded in our guidance going forward, and that it could improve based on the appropriations on dynamics this summer.” Thermo Fisher finished Q1 with $1.511 billion in net income, up 13.5% from $1.331 billion a year earlier, on revenue that rose 0.2% year-over-year to $10.364 billion from $10.345 billion in Q1 2024. Danaher saw its net earnings shrink 12% in the first three months of 2025, to $954 million from $1.088 billion in Q1 2024, on revenue that dipped 1% year over year to $5.741 billion from $5.796 billion—results the company said were better than expected. “Low single-digit” decline Danaher did not pinpoint a dollar amount of revenue lost from A&G customers, except to say it was “down [in the] mid-single-digit-type range.” Core revenue in its life sciences instrument businesses declined in the “low single digits” in Q1, Danaher president and CEO Rainer M. Blair told analysts Tuesday on his company’s earnings call. Danaher president and CEO, Rainer M. Blair “Demand across pharma, clinical, and applied markets, which make up the majority of our revenues in these businesses, held up well globally, while academic and government demand softened through the quarter, particularly in the United States,” Blair said. “We expect the U.S. government and academic market to continue to soften with the noise that we’re hearing.” The percentage of orders from new customers “declined in the teens range,” Danaher said in a follow-up call cited by J.P. Morgan analyst Rachel Vatnsdal in a research note. “The products affected in these softening conditions include instruments used in research, laboratory consumables, and reagents for U.S. government-funded labs,” Vatnsdale reported. “When considering guidance regarding U.S. A&G conditions, DHR stated it expects further softening throughout the year due to ongoing funding concerns, which will also impact genomics customers in the research segment.” Blair told analysts that customers directly funded by NIH accounted for less than 1% of Danaher revenue, while revenue from government and academic customers globally amounted to “low single digits.” While tools account for less than 10% of revenue for Danaher’s Life Science segment, which includes instruments, consumables, services, and software primarily used to study DNA, RNA, nucleic acid, proteins, metabolites, and cells. Those products are used toward understanding causes of disease, identifying new therapies, and testing and manufacturing new drugs, vaccines, and gene editing technologies. “Outside of the U.S. government and academic segment, the market conditions are stable, and why is that? Because we’ve dialed our portfolio into what we believe are the more attractive market segments here. For the long term, pharma, clinical, and applied are by far how we’ve positioned our business.” Opposite directions The tariff and policy revenue losses had the stocks of both tools giants going in opposite directions. At the closing bell Friday, Thermo Fisher shares had dipped 2.4% since the release of its Q1 results, from $434.73 to $424.24. Danaher shares have climbed nearly 7% since its Q1 results came out, rising from $184.96 to $197.14. Puneet Souda, senior managing director, life science tools and diagnostics and a senior research analyst with Leerink Partners, raised his 12-month price target on Danaher shares 2%, from $225 to $230, while lowering Thermo Fisher’s price target 4% from $625 to $600, citing Thermo Fisher’s lower enterprise value of 16 times EBITDA (earnings before interest, taxes, depreciation, and amortization) vs. 19 times for Danaher. However, Souda kept the firm’s “Outperform” rating for both companies. Danaher’s increase reflects better-than-expected overall results, especially for its bioprocessing business, which grew sequentially for the seventh quarter in a row. During Q1 it rose by “high-single digits” to drive a 6% year-over-year revenue jump (from $1.524 billion to $1.612 billion) in the company’s “Biotechnology” segment, which also includes sales of equipment, consumables and services primarily used in research, development, manufacture, and delivery of biologics. Danaher raised its quarterly guidance for bioprocessing from the 6–7% range to “high single digits.” For Thermo Fisher, the lost revenue from tariffs and policy each accounts for about 1% of the $43.3 billion it now projects at the low end of its range of projected revenue it will generate in 2025, down 0.5% from its initial low-end forecast of $43.5 billion. The company raised its high-end revenue guidance by $200 million or 0.5%, from $44 billion to $44.2 billion. Also, as a result of anticipating less revenue, Thermo Fisher has lowered its earnings per share forecast roughly 3% to 6%, to between $21.76 and $22.84 from its initial range of between $23.10 to $23.50. “We’ve been operating with agility to assess the changes as they come, and we’re actively managing our business to mitigate the impact and capitalize on new opportunities,” Casper told analysts Wednesday on the company’s earnings call following the release of first quarter results. “As a result, we’re able to offset a large amount of the impact of the macro changes in 2025 and more fully offset them when the full impact of our mitigation actions is realized next year.” Those mitigation actions, according to Thermo Fisher, include localizing its manufacturing within regions, sourcing materials from local suppliers whenever possible, and “cost out” actions designed to eliminate costs across the company’s supply chain. $2B U.S. manufacturing effort The day of its earnings call, Thermo Fisher highlighted one initiative aimed at localizing manufacturing: The company committed to spending an additional $2 billion over the next four years on manufacturing within the United States, consisting of: $1.5 billion in capital expenditures designed to expand and improve U.S. manufacturing operations $500 million in additional R&D spending focused on high-impact innovation—36% of the $1.39 billion that Thermo Fisher spent on R&D during 2024, and 46% more than the $342 million that the company spent on R&D during Q1 of this year “The tariffs and policy changes are also creating some very relevant medium- and long-term opportunities, and we’re working to maximize these upsides, including leveraging our extensive U.S. manufacturing capabilities to help our customers navigate their own potential tariff impact,” Stephen Williamson, Thermo Fisher’s senior vice president and CFO, told investors. “This will have minimal impact in 2025, but it’s expected to be an important contributor going forward. Thermo Fisher already has a sizeable U.S. manufacturing footprint, with 64 facilities in 37 states. Some sites focus on making analytical instruments, specialty diagnostics, and life sciences solutions, while others offer contract development and manufacturing organization (CDMO) services. Last fall, Thermo Fisher launched a suite of expanded CDMO and clinical research organization (CRO) services. The company introduced to the market its Accelerator Drug Development, which Thermo Fisher promotes as “360°” CDMO and CRO drug development solutions under its own brand. The launch came more than three years after Thermo Fisher acquired the CRO PPD for $17.4 billion, and seven years after expanding into the CDMO market by purchasing Patheon for $7.2 billion. Offsetting tariff headwinds A day earlier, addressing analysts, Danaher CEO Blair said his company could sur",
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-7876239252243445254",
        "title": "Danaher's quarterly results show signs of life, and the struggling stock soars",
        "url": "https://www.cnbc.com/2025/04/22/danahers-quarterly-results-show-signs-of-life-and-the-struggling-stock-soars.html",
        "site": "cnbc.com",
        "time": 1745339464000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "dhr"
        ],
        "description": "Count us among the Danaher investors breathing a sigh of relief.",
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "4012153186527972014",
        "title": "Danaher outlines 3% core revenue growth and $7.60-$7.75 EPS guidance for 2025 | $DHR",
        "url": "https://seekingalpha.com/news/4433441-danaher-outlines-3-percent-core-revenue-growth-and-7_60-7_75-eps-guidance-for-2025",
        "site": "seekingalpha.com",
        "time": 1745334649000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-1199503633477530040",
        "title": "Danaher projects in line guidance despite Q1 beat | $DHR",
        "url": "https://seekingalpha.com/news/4433121-danaher-stock-drop-in-line-guidance",
        "site": "seekingalpha.com",
        "time": 1745319935000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-5825721291427929766",
        "title": "Earnings Snapshot: Danaher tops Q1 estimates; initiates FY25 EPS and Q2 outlook | $DHR",
        "url": "https://seekingalpha.com/news/4433039-earnings-snapshot-danaher-tops-q1-estimates-initiates-fy25-eps-and-q2-outlook",
        "site": "seekingalpha.com",
        "time": 1745317117000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-7575590899444738604",
        "title": "Danaher Non-GAAP EPS of $1.88 beats by $0.24, revenue of $5.74B beats by $150M | $DHR",
        "url": "https://seekingalpha.com/news/4433088-danaher-non-gaap-eps-of-188-beats-by-024-revenue-of-574b-beats-by-150m",
        "site": "seekingalpha.com",
        "time": 1745316209000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "7677065973954473326",
        "title": "Danaher Non-GAAP EPS of $0.88 misses by $0.76, revenue of $5.74B beats by $150M",
        "url": "https://seekingalpha.com/news/4433088-danaher-non-gaap-eps-of-0_88-misses-by-0_76-revenue-of-5_74b-beats-by-150m",
        "site": "seekingalpha.com",
        "time": 1745316209000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "similar_stories": [
            "-7575590899444738604"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-7940142908390767533",
        "title": "Danaher Q1 2025 Earnings Preview",
        "url": "https://seekingalpha.com/news/4432882-danaher-q1-2025-earnings-preview",
        "site": "seekingalpha.com",
        "time": 1745258028000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "3387528990296829419",
        "title": "Short bets against S&P 500 healthcare stock rises in March; MRNA stays top shorted | $IBB $XLV $PPH $JNJ $DHR",
        "url": "https://seekingalpha.com/news/4431086-short-bets-against-sp-500-healthcare-stock-rises-in-march-mrna-stays-top-shorted",
        "site": "seekingalpha.com",
        "time": 1744896900000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-4006903084608808297",
        "title": "Sartorius sends U.S. peers higher after Q1 2025 results | $DHR $RGEN $TMO $SARTF $BIO",
        "url": "https://seekingalpha.com/news/4431662-thermo-fisher-stock-gains-sartorius-q1-results",
        "site": "seekingalpha.com",
        "time": 1744810185000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-7563556985722710053",
        "title": "Iqvia, Icon, Fortrea downgraded at Barclays on tariff overhang | $DHR $ICLR $IQV $FTRE",
        "url": "https://seekingalpha.com/news/4430128-iqvia-stock-icon-stock-downgraded-barclays",
        "site": "seekingalpha.com",
        "time": 1744289809000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "8192924175550938469",
        "title": "Key deals this week: Svitzer Group, Hershey, ServiceNow, Enovix and more | $DHR $UMC $HSY $BAM $BDX",
        "url": "https://seekingalpha.com/news/4428712-key-deals-this-week-svitzer-group-hershey-servicenow-enovix-and-more",
        "site": "seekingalpha.com",
        "time": 1743880518000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-5110374654322487536",
        "title": "Becton in talks with rivals over divesting life sciences unit",
        "url": "https://www.ft.com/content/a5a94445-9185-4c26-be6a-ae3303838d81",
        "site": "ft.com",
        "time": 1743480048000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "dhr"
        ],
        "description": "Medical devices maker will discuss options for $21bn division with Thermo Fisher, Danaher and other smaller rivals",
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "5988752106160846247",
        "title": "Danaher-IGI Beacon for CRISPR Cures Celebrates One-Year Anniversary",
        "url": "https://www.genengnews.com/topics/genome-editing/danaher-igi-beacon-for-crispr-cures-celebrates-one-year-anniversary/",
        "site": "genengnews.com",
        "time": 1743158398000,
        "favicon_url": "https://static.tickertick.com/website_icons/genengnews.com.ico",
        "tags": [
            "dhr"
        ],
        "description": "CRISPR leaders across the Innovative Genomics Institute (IGI) ecosystem, which spans multiple California institutes and hospitals including UCSF, Benioff Children’s Hospital, and UCLA, came together to celebrate the one-year anniversary of the Danaher-IGI Beacon for CRISPR Cures collaboration, 10 years after IGI’s founding. The post Danaher-IGI Beacon for CRISPR Cures Celebrates One-Year Anniversary appeared first on GEN - Genetic Engineering and Biotechnology News. Berkeley—Nobel Laureate Jennifer Doudna, PhD, professor of biochemistry, biophysics, and structural biology at UC Berkeley, aspires for “CRISPR to become the standard of medical care for certain diseases” when asked for her dream for the technology in the next 5–10 years. That dream has recently been challenged by a volatile climate, with public gene editing companies losing value in the past year, despite evidence of treatments showing efficacy. Funding has become a challenge for gene editing start-ups with companies cutting staff and trimming pipelines. Recently, CRISPR leaders across the Innovative Genomics Institute (IGI) ecosystem, which spans multiple California institutes and hospitals including UCSF, Benioff Children’s Hospital, and UCLA, came together to change the tone by celebrating the one-year anniversary of the Danaher-IGI Beacon for CRISPR Cures collaboration, 10 years after IGI’s founding. Fyodor Urnov, PhD, professor of molecular and cell biology at UC Berkeley and director of technology & translation at IGI, who recently authored a 6,000-word editorial in The CRISPR Journal to “give Cas a chance,” said the pioneers of CRISPR gene editing have built an electric car in a universe that was built for early model internal combustion engines. “It is not the first time in the history of technology that we have invented something, but parts of the world have not caught up,” said Urnov in an interview with GEN. “In this case, CRISPR fundamentally can do what we wanted to do, but a good chunk of the regulatory environment, for example, putting CRISPR into a person, hasn’t changed in 15 years.” The Danaher partnership enables a new research program at the IGI and is also the largest investment yet from the Danaher Beacons program, which funds pioneering academic research with the goal of developing innovative technologies and applications for human health. Among the event speaker line-up were Don Kohn, MD, distinguished professor of microbiology at UCLA, Jennifer Puck, MD, professor emeritus of pediatrics at UCSF, Tippi MacKenzie, MD, professor of surgery at Benioff Children’s Hospital and professor of children’s health at UCSF, and more. The collaboration, set to span a total of four years, provides the IGI team with support from Danaher and several of its operating companies, including Integrated DNA Technologies, Cytiva, Beckman Coulter Life Sciences, and Aldevron. “Our mission in academic science is to create new things and explore new ideas. What we’re not good at is developing ideas so that they can be widely available, affordable, and disseminated,” said Doudna. “This partnership is our effort to bring those two areas together so that CRISPR can have a global impact.” Urnov said the world is not a “magical machine” for distributing technology equitably and fairly, such that suddenly everyone benefits from the best. “There is no magic wand that enables a technology to change the world,” Urnov told GEN. “The Danaher partnership is about realizing that fact for CRISPR gene editing and building it into a technology that will fundamentally change how we treat a large class of human diseases.” Jennifer Doudna, PhD, giving opening remarks at CRISPR Cures Day. [Danaher] CRISPR cookbook Urnov emphasized that the goal of the partnership is to develop a robust clinically validated “cookbook” that contains solutions and sources for how to develop CRISPR cures for your disease of interest. Upon launch, the collaboration was initially aimed to drive two preclinical gene-editing therapies from design to initial regulatory submission, with a focus on a family of rare and genetic immunological disorders known as inborn errors of immunity (IEIs), including two diseases known as ARTEMIS-deficient severe combined immunodeficiency (ART-SCID) and hemophagocytic lymphohistiocytosis (HLH). IEIs have several advantages that the collaborators believe make them amenable to the center’s approach, including an extensive patient registry and a transplant-based route of administration that bypasses key challenges in delivering CRISPR molecules to appropriate tissues. According to Danaher, the Beacon for CRISPR Cures will be designed to yield a “stacked” manufacturing platform for gene editing therapies and increase the number of patients treated with CRISPR-based technology from approximately 210 patients to many thousands over the next decade. Sadik Kassim, PhD, CTO, genomic medicine at Danaher, highlighted that the Danaher IGI Beacon was selected by the Alliance for Regenerative Medicine as a keystone program at the FDA Scientific Exchange for Advancing Gene Editing Platforms for Rare Diseases held last November. The recognition showcased impactful platforms that transform scientifically feasible treatments into commercially viable options. “To be able to tell the world ‘this is what needs to happen’ within a year time frame, with Danahar and IGI at the forefront, is an important milestone, in addition to the actual operationalization of this entire concept,” Kassim told GEN. Kassim also noted that the collaboration has captivated the attention of many other academic centers with several wanting to apply or contribute to the “cookbook” concept. “Hopefully the collaboration will be a catalyst for a bigger convergence between the entire community, with Danaher and IGI being the center of that entire constellation,” Kassim continued. Danaher has yet to comment publicly on future milestones for the collaboration, but noted that it expects more news to be announced at the 2025 American Society of Gene & Cell Therapy (ASGCT) meeting being held this coming May in New Orleans. The post Danaher-IGI Beacon for CRISPR Cures Celebrates One-Year Anniversary appeared first on GEN - Genetic Engineering and Biotechnology News.",
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "4759257584333081483",
        "title": "Danaher upgraded at Goldman Sachs citing an attractive entry point | $DHR",
        "url": "https://seekingalpha.com/news/4423389-danaher-stock-upgraded-goldman-sachs",
        "site": "seekingalpha.com",
        "time": 1742560272000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "-2899584226798892009",
        "title": "'Deep discounted' ideas in healthcare amid recent volatility - KeyBanc | $XLV $DHR $ITGR $ADUS $ACHC",
        "url": "https://seekingalpha.com/news/4421258-deep-discounted-ideas-in-healthcare-amid-recent-volatility---keybanc",
        "site": "seekingalpha.com",
        "time": 1742223920000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    },
    {
        "id": "1981203320837742981",
        "title": "Danaher upgraded to Buy at Stifel on top-line growth opportunities",
        "url": "https://seekingalpha.com/news/4420748-danaher-upgraded-to-buy-at-stifel-on-top-line-growth-opportunities",
        "site": "seekingalpha.com",
        "time": 1741963255000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "dhr"
        ],
        "tickers": [
            "dhr"
        ]
    }
]