[
    {
        "id": "-5791345023917618487",
        "title": "Adobe Firefly Gets More Third-Party AI Models And Unveils New Mobile App",
        "url": "https://www.forbes.com/sites/marksparrow/2025/06/17/adobe-firefly-gets-more-third-party-ai-models-and-unveils-new-mobile-app/",
        "site": "forbes.com",
        "time": 1750170251000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe is giving Firefly users access to more AI models from third parties so content creators can extended creativity even further when producing images and video. Adobe is giving Firefly users access to more AI models from third parties so content creators can extended creativity even further when producing images and video.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "6791636119912926891",
        "title": "Adobe Just Launched Firefly App On iPhone And Android For AI Content Generation On The Go",
        "url": "https://www.forbes.com/sites/davidphelan/2025/06/17/adobe-just-launched-firefly-app-on-iphone-and-android-for-ai-content-generation-on-the-go-samsung-google/",
        "site": "forbes.com",
        "time": 1750169756000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe’s key AI app has just arrived on mobile. Here’s all you need to know. Adobe’s key AI app has just arrived on mobile. Here’s all you need to know.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-8499393985427844541",
        "title": "Adobe releases iOS and Android apps for Firefly, letting users generate images and videos using text prompts and experiment with popular AI photo editing tools (Jess Weatherbed/The Verge)",
        "url": "http://www.techmeme.com/250617/p15#a250617p15",
        "site": "techmeme.com",
        "time": 1750166100000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Jess Weatherbed / The Verge: Adobe releases iOS and Android apps for Firefly, letting users generate images and videos using text prompts and experiment with popular AI photo editing tools — ﻿The iPhone and Android Firefly app can sync AI image and video projects to desktops via Creative Cloud.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-2723405698718598867",
        "title": "Adobe’s Firefly comes to iOS and Android",
        "url": "https://techcrunch.com/2025/06/17/adobe-releases-a-dedicated-firefly-app-for-image-and-video-creation/",
        "site": "techcrunch.com",
        "time": 1750165200000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "-2271663682221407024"
        ],
        "description": "Adobe is launching its Firefly mobile app on iOS and Android for consumers to create AI-powered media",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "6368464575311634309",
        "title": "How can you make sure your brand shows up in LLM search? Adobe’s new LLM Optimizer seeks to provide the tools",
        "url": "https://venturebeat.com/ai/how-can-you-best-position-your-brand-for-discovery-in-llm-search-adobes-new-llm-optimizer-seeks-to-provide-the-tools/",
        "site": "venturebeat.com",
        "time": 1750094066000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe’s system enables marketers to see where their brand is underrepresented in AI-driven results, and take actions to improve it, if so. Adobe’s system enables marketers to see where their brand is underrepresented in AI-driven results, and take actions to improve it, if so.Read More",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5820084212266205383",
        "title": "Adobe shows off new model aimed at monitoring AI traffic, SEO",
        "url": "https://seekingalpha.com/news/4458315-adobe-shows-off-new-model-aimed-at-monitoring-ai-traffic-seo",
        "site": "seekingalpha.com",
        "time": 1750073150000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3295519249544430434",
        "title": "Adobe just can’t make investors happy, even after its strong earnings",
        "url": "https://www.marketwatch.com/story/adobe-just-cant-make-investors-happy-even-after-its-strong-earnings-722df5bb?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1749846960000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "The software company’s stock logged its seventh postearnings decline in eight quarters, as a boost to the revenue outlook wasn’t enough for Wall Street.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-8205613028298931770",
        "title": "Adobe Fails to Convince AI Skeptics with Sales Outlook",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/adobe-fails-to-convince-ai-skeptics-with-sales-outlook-video",
        "site": "bloomberg.com",
        "time": 1749844378000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe’s sales outlook wasn’t enough to convince investors that the software maker can outduel AI-focused upstarts. Bloomberg’s Brody Ford tells Caroline Hyde why on “Bloomberg Tech.” (Source: Bloomberg)",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "8880675907631979214",
        "title": "Verizon, Louis Vuitton, Adobe Drive Customer Experience With Strategic AI Initiatives",
        "url": "https://www.pymnts.com/artificial-intelligence-2/2025/verizon-louis-vuitton-adobe-drive-customer-experience-with-strategic-ai-initiatives/",
        "site": "pymnts.com",
        "time": 1749824780000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Artificial intelligence is playing an increasingly central role in shaping how companies engage with customers, but many of the most impactful innovations are designed to operate quietly in the background. [contact-form-7] That was the key message from a panel discussion at the VivaTech 2025 conference in Paris on Friday (June 13) featuring executives from Louis […] The post Verizon, Louis Vuitton, Adobe Drive Customer Experience With Strategic AI Initiatives appeared first on PYMNTS.com. Artificial intelligence is playing an increasingly central role in shaping how companies engage with customers, but many of the most impactful innovations are designed to operate quietly in the background. [contact-form-7] That was the key message from a panel discussion at the VivaTech 2025 conference in Paris on Friday (June 13) featuring executives from Louis Vuitton, Verizon and Adobe. While their industries span luxury retail, telecom and digital marketing, each company is investing deeply in AI to personalize service, increase efficiency and empower employees. They also believe that they can elevate the customer experience without losing the emotional spark that only human beings can provide. For Louis Vuitton, the use of AI in stores is focused on supporting client advisors — representatives that engage with, sell to and develop relationships with customers. Laura Krittian, the luxury brand’s vice president of global retail excellence and development, said AI helps advisors identify which clients to contact, what to say and when to reach out. The French retailer is piloting a program that uses generative AI to create bespoke “thank you” messages with a tone tailored to each client’s preferences and profile while staying true to the Louis Vuitton brand and culture. “It’s really about simplifying the life of our client advisors,” Krittian said, and giving them AI tools to take away the administrative tasks can “give them more time to really focus on high added value interactions.” Verizon is pursuing a similar approach in customer service and sales — using artificial intelligence to reduce friction for both employees and customers. Chief Digital Officer Kris Narayanan said the telecom giant is investing in AI-driven tools that empower service and sales reps by streamlining workflows and making relevant customer insights available in real time. For instance, Verizon now uses sentiment analysis — drawing on data from calls and digital interactions — to display red, yellow or green indicators of a customer’s emotional state. This helps reps adjust their approach and avoid missteps. “We process audio in every channel where we’re legally allowed to capture it,” Narayanan said. “We transcribe, summarize, derive insights, and merge it with other data to provide a complete picture.” The goal is to make artificial intelligence invisible to customers while delivering meaningful improvements. “AI should feel seamless,” Narayanan said. “It’s not about replacing people — it’s about making their jobs easier and making the experience better.” Read more: Report: LVMH Tells Analysts Demand Remains Weak in Luxury Sector Not Fearing Failure At Adobe, AI is being used to dramatically accelerate the pace of marketing campaigns and personalize customer journeys. Rachel Thornton, CMO of Adobe’s enterprise division, described how AI tools embedded in Adobe products allow marketers to conduct segmentation, testing and content generation in days rather than weeks. A key goal is to help marketers be more creative and move faster, Thornton said. Creating assets normally “would have taken me seven, eight weeks. Now it literally takes me about six days,” Thornton said. Adobe’s agentic artificial intelligence platform, Brand Concierge, is another example of how companies are aiming to make digital interactions more conversational and tailored. Modeled after a luxury hotel concierge, the AI assistant is designed to guide users through personalized journeys, helping them find what they need with minimal friction. Despite the enthusiasm, all three executives emphasized the importance of thoughtful implementation. At Louis Vuitton, new AI tools are tested extensively in pilot programs to ensure they are intuitive and genuinely helpful. “We want our client advisors to spend as much time as possible on our applications, so [the AI tools] need to be super seamless, so they spend more time, really with the clients,” Krittian said. Read more: Luxury’s Lost Luster: Brands Grapple With Shifting Tastes, Economic Headwinds Verizon, meanwhile, focuses on reducing cognitive load and designing tools that are easy to adopt without extensive training. “If you have to teach people how to use a simple tool, it’s not designed well enough,” Narayanan said. As companies race to adopt agentic artificial intelligence — where digital agents act on behalf of users — guardrails and governance are top of mind. Thornton noted that CMOs are increasingly collaborating with CIOs to ensure experimentation doesn’t outpace ethical or technical oversight. This also means they can experiment without fear. “I encourage people to fail,” Thornton said. “If we’re not experimenting and we’re not failing, we’re not learning something.” See also: Sephora, Retail Division Drive LVMH’s Q4 Performance Amid Luxury Market Headwinds Looking ahead, the panelists agreed that AI will continue to expand its role in customer engagement, with automation and proactive assistance becoming more common. Narayanan said Verizon is testing systems that allow customers to manage tasks like billing and account changes through simple voice or search commands — and eventually, AI agents may be able to anticipate and act on customer needs without explicit prompts. “A lot of the things customers today expend effort on, like calling to understand the status of a bill or adding someone to their plan, should become as easy as giving simple commands on search,” Narayanan said. “If you can anticipate customer needs, you’ve done your job.” Read more: LVMH Founder Bernard Arnault’s Family Firm Invests in AI Companies Photo: Louis Vuitton’s Laura Krittian, Verizon’s Kris Narayanan, Adobe’s Rachel Thornton and the moderator. For all PYMNTS AI coverage, subscribe to the daily AI Newsletter. The post Verizon, Louis Vuitton, Adobe Drive Customer Experience With Strategic AI Initiatives appeared first on PYMNTS.com.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "6854234563145650532",
        "title": "Adobe Is Not an ‘AI Loser,’ D.A. Davidson’s Luria Says",
        "url": "https://www.bloomberg.com/news/videos/2025-06-13/adobe-is-not-an-ai-loser-d-a-davidson-s-luria-says-video",
        "site": "bloomberg.com",
        "time": 1749822928000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Gil Luria, D.A. Davidson managing director, says AI will be accretive to Adobe’s earnings on the June 12 episode of “Bloomberg The Close.” Adobe said sales will be about $5.88 billion to $5.93 billion in the period ending in August.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "47028347265094319",
        "title": "These Stocks Are Moving the Most Today: Diamondback Energy, Lockheed, United, Tesla, Adobe, Boeing, AMD, Chime, RH, and More",
        "url": "https://www.barrons.com/articles/stock-movers-5443564f?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1749822660000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-7419108608617210189",
        "title": "Will Adobe Stock See Higher Levels?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/13/will-adobe-stock-see-higher-levels/",
        "site": "forbes.com",
        "time": 1749821290000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Despite these encouraging results, the stock experienced a modest reaction in after-hours trading, falling by 1%. Despite these encouraging results, the stock experienced a modest reaction in after-hours trading, falling by 1%.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5856067203094370472",
        "title": "Stock Movers: Oil, RTX, Adobe (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-06-13/stock-movers-oil-rtx-adobe-podcast",
        "site": "bloomberg.com",
        "time": 1749821189000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "-2024884020786025616"
        ],
        "description": "Source: Bloomberg, 3:46",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-6473749373257097050",
        "title": "Adobe dips despite 'solid' Q2 as investors seek more, say analysts",
        "url": "https://seekingalpha.com/news/4457921-adobe-dips-despite-solid-q2-as-investors-seek-more-say-analysts",
        "site": "seekingalpha.com",
        "time": 1749817927000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3326495943456501546",
        "title": "Adobe in charts: FQ2 Digital Media and Digital Experience revenue grow in double-digits",
        "url": "https://seekingalpha.com/news/4457561-adobe-in-charts-fq2-digital-media-and-digital-experience-revenue-grow-in-double-digits",
        "site": "seekingalpha.com",
        "time": 1749793603000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-9189021230714950560",
        "title": "Adobe raises FY25 revenue and EPS guidance as AI monetization accelerates adoption across user base",
        "url": "https://seekingalpha.com/news/4457817-adobe-raises-fy25-revenue-and-eps-guidance-as-ai-monetization-accelerates-adoption-across",
        "site": "seekingalpha.com",
        "time": 1749780463000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-4881096845813014549",
        "title": "Adobe reports Q2 revenue up 11% YoY to $5.87B, vs. $5.8B est., Digital Media revenue up 11% to $4.35B, and forecasts Q3 revenue above estimates (Brody Ford/Bloomberg)",
        "url": "http://www.techmeme.com/250612/p40#a250612p40",
        "site": "techmeme.com",
        "time": 1749766201000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Brody Ford / Bloomberg: Adobe reports Q2 revenue up 11% YoY to $5.87B, vs. $5.8B est., Digital Media revenue up 11% to $4.35B, and forecasts Q3 revenue above estimates — Adobe Inc. gave a sales outlook for the current quarter that topped analysts' estimates, but investors remain skeptical that the leader in creative software can outduel AI-focused upstarts.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-3929153299200990105",
        "title": "Earnings Snapshot: Adobe raises FY25 targets after strong Q2 print",
        "url": "https://seekingalpha.com/news/4457768-earnings-snapshot-adobe-raises-fy25-targets-after-strong-q2-print",
        "site": "seekingalpha.com",
        "time": 1749760394000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-3552411955037439801",
        "title": "Adobe's Q2 results surpass estimates as it increases guidance on AI traction",
        "url": "https://seekingalpha.com/news/4457751-adobes-q2-results-surpass-estimates-as-it-increases-guidance-on-ai-traction",
        "site": "seekingalpha.com",
        "time": 1749759987000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1763877353674732897",
        "title": "Adobe Posts Strong Outlook, Touting Traction for AI Tools",
        "url": "https://www.bloomberg.com/news/articles/2025-06-12/adobe-posts-strong-outlook-touting-traction-for-ai-tools",
        "site": "bloomberg.com",
        "time": 1749759286000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe Inc. gave a strong sales outlook for the current quarter, quieting investor anxieties that the leader in creative software is falling behind in a competition with AI-focused upstarts. The Adobe offices in San Francisco, California, US, on Tuesday, June 3, 2025. Adobe Inc. is scheduled to release earnings figures on June 12. Photographer: David Paul Morris/Bloomberg",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "1874641757711288313",
        "title": "4 stocks to watch on Thursday: BA, MU, ADBE and RH",
        "url": "https://seekingalpha.com/news/4457632-4-stocks-to-watch-on-thursday-ba-mu-adbe-and-rh",
        "site": "seekingalpha.com",
        "time": 1749734825000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-7145569350383385734",
        "title": "Adobe Q2 2025 Earnings Preview: Low expectations set up potential upside",
        "url": "https://seekingalpha.com/news/4457319-adobe-q2-2025-earnings-preview-low-expectations-set-up-potential-upside",
        "site": "seekingalpha.com",
        "time": 1749655899000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "4106088575815226140",
        "title": "Adobe needs to demonstrate competitive positioning to silence bears: analysts",
        "url": "https://seekingalpha.com/news/4456889-adobe-needs-to-demonstrate-competitive-positioning-to-silence-bears-analysts",
        "site": "seekingalpha.com",
        "time": 1749562726000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "1163669784411072673",
        "title": "Silicon Valley And Hollywood Identities Invest In San Francisco Unicorns Cricket Franchise",
        "url": "https://www.forbes.com/sites/tristanlavalette/2025/06/09/silicon-valley-and-hollywood-identities-invest-in-san-francisco-unicorns-cricket-franchise/",
        "site": "forbes.com",
        "time": 1749475083000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "San Francisco Unicorns have announced a slew of investors, including Adobe chief executive Shantanu Narayen, YouTube boss Neal Mohan and actor Kunal Nayyar. San Francisco Unicorns have announced a slew of investors, including Adobe chief executive Shantanu Narayen, YouTube boss Neal Mohan and actor Kunal Nayyar.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-4583269348432217252",
        "title": "Sell ADBE Stock Ahead Of Its Earnings?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/09/sell-adbe-stock-ahead-of-its-earnings/",
        "site": "forbes.com",
        "time": 1749463226000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "In the last five years, Adobe’s stock has declined in 70% of cases, with a median drop of 7.4% and a maximum one-day loss of 16.8%. In the last five years, Adobe’s stock has declined in 70% of cases, with a median drop of 7.4% and a maximum one-day loss of 16.8%.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1772069674006189106",
        "title": "Earnings week ahead: ADBE, ORCL, GME, GTLB, CHWY, and more",
        "url": "https://seekingalpha.com/news/4456221-earnings-week-ahead-adbe-orcl-gme-gtlb-chwy-and-more",
        "site": "seekingalpha.com",
        "time": 1749384016000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1525330429096389516",
        "title": "Adobe Reports After Close 6/12 — Options Expire The Next Day",
        "url": "https://www.forbes.com/sites/dividendchannel/2025/06/06/adobe-reports-after-close-612---options-expire-the-next-day/",
        "site": "forbes.com",
        "time": 1749233037000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "According to NextEarningsDate.com the Adobe next earnings date is projected to be 6/12 after the close, with earnings estimates of $4.97/share on $5.80 Billion of revenue According to NextEarningsDate.com the Adobe next earnings date is projected to be 6/12 after the close, with earnings estimates of $4.97/share on $5.80 Billion of revenue",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-2024526207405612687",
        "title": "Inside Adobe: Vision, Strategy & Value",
        "url": "https://www.bloomberg.com/news/videos/2025-06-05/inside-adobe-vision-strategy-value-video",
        "site": "bloomberg.com",
        "time": 1749140925000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Paul J. Schroeder, QQQ Equity Product Strategist, Invesco speaks with Bloomberg Live Experiences' Mark Miller about rethinking innovation at The Future Investor: Finding the Opportunities event in San Francisco. (Source: Bloomberg)",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-5057144029904424900",
        "title": "Adobe finally releases Photoshop for Android, and it’s free (for now)",
        "url": "https://arstechnica.com/gadgets/2025/06/adobe-finally-releases-photoshop-for-android-and-its-free-for-now/",
        "site": "arstechnica.com",
        "time": 1748968583000,
        "favicon_url": "https://static.tickertick.com/website_icons/arstechnica.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "After releasing Photoshop for iPhone in February, the promised Android version is here. Adobe has spent years releasing mobile apps that aren't Photoshop, and now it's finally giving people what they want. Yes, real Photoshop. After releasing a mobile version of Photoshop on iPhone earlier this year, the promised Android release has finally arrived. You can download it right now in beta, and it's free to use for the duration of the beta period. The mobile app includes a reasonably broad selection of tools from the desktop version of Adobe's iconic image editor, including masks, clone stamp, layers, transformations, cropping, and an array of generative AI tools. The app looks rather barebones when you first start using it, but the toolbar surfaces features as you select areas and manipulate layers. Depending on how you count, this is Adobe's third attempt to do Photoshop on phones. So far, it appears to be the most comprehensive, though. It's much more capable than Photoshop Express or the ancient Photoshop Touch app, which Adobe unpublished almost a decade ago. If you're not familiar with the ins and outs of Photoshop, the new app comes with a robust collection of tutorials—just tap the light bulb icon to peruse them.Read full article Comments",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "2722947371192851976",
        "title": "Adobe launches a Photoshop app for Android in beta for devices running Android 11 or later with 6GB+ of RAM, including core desktop features like layering (Aisha Malik/TechCrunch)",
        "url": "http://www.techmeme.com/250603/p18#a250603p18",
        "site": "techmeme.com",
        "time": 1748956801000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Aisha Malik / TechCrunch: Adobe launches a Photoshop app for Android in beta for devices running Android 11 or later with 6GB+ of RAM, including core desktop features like layering — Android users can now download Photoshop for mobile. Adobe announced on Tuesday that it's releasing the beta version of its Android Photoshop app …",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5470251684362804057",
        "title": "Adobe launches beta version of its Photoshop app on Android",
        "url": "https://techcrunch.com/2025/06/03/adobe-launches-beta-version-of-its-photoshop-app-on-android/",
        "site": "techcrunch.com",
        "time": 1748955600000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Android users can now download Photoshop for mobile. Adobe announced on Tuesday that it’s releasing the beta version of its Android Photoshop app, four months after the company launched its iPhone app. The app offers a similar set of editing tools as the desktop version, including layering and masking, but is optimized for mobile screens. […]",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-6879965861282110079",
        "title": "A Smart Bet On Adobe Stock Ahead Of Earnings?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/06/02/a-smart-bet-on-adobe-stock-ahead-of-earnings/",
        "site": "forbes.com",
        "time": 1748876432000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "-7425533314255605522",
            "-8416908606417344934",
            "-4583269348432217252"
        ],
        "description": "Adobe is set to report earnings on June 12, and if you’re the kind of investor who likes to play short-term volatility with defined risk... Adobe is set to report earnings on June 12, and if you’re the kind of investor who likes to play short-term volatility with defined risk...",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5240590046430412141",
        "title": "Utah-based Awardco, which makes HR software that helps AT&T, Adobe, and other clients manage employee rewards, raised a $165M Series B at an over $1B valuation (Ryan Barwick/Axios)",
        "url": "http://www.techmeme.com/250524/p4#a250524p4",
        "site": "techmeme.com",
        "time": 1748064300000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Ryan Barwick / Axios: Utah-based Awardco, which makes HR software that helps AT&T, Adobe, and other clients manage employee rewards, raised a $165M Series B at an over $1B valuation — Awardco announced Tuesday it has raised a $165 million Series B, valuing the employee rewards platform at more than $1 billion.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-3315057983297312818",
        "title": "Time To Buy Adobe Stock? - Adobe stock’s performance over the last five years has been ...",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/05/22/time-to-buy-adobe-stock/",
        "site": "forbes.com",
        "time": 1747904409000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe stock’s performance over the last five years has been underwhelming, as it is currently at nearly the same level it was at in May 2020. Adobe stock’s performance over the last five years has been underwhelming, as it is currently at nearly the same level it was at in May 2020.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "4894511441037181313",
        "title": "Wix.com leads enterprise software stocks lower after earnings results | $WIX $MSFT $ORCL $CRM $ADBE",
        "url": "https://seekingalpha.com/news/4450993-wixcom-leads-enterprise-software-stocks-lower-after-earnings-results",
        "site": "seekingalpha.com",
        "time": 1747839321000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-9082301176190728088",
        "title": "Adobe’s most expensive subscription tier is about to get even more expensive",
        "url": "https://www.fastcompany.com/91337900/adobe-creative-cloud-pro",
        "site": "fastcompany.com",
        "time": 1747770000000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe will be giving its priciest subscription tier an AI-first rebrand—and adding an even higher price tag. Adobe’s Creative Cloud All Apps subscription, which includes access to more than 20 Adobe apps, will soon be known as “Creative Cloud Pro,” the company announced last week. The renamed subscription plan will give users expanded access to Adobe’s AI-powered tools and apps, but for a price: For subscribers on an annual plan, the cost will increase from $59.99 to $69.99 monthly, or from $659.88 to $779.99 annually. Beginning on June 17th, any members of Creative Cloud All Apps will be automatically opted into Creative Cloud Pro. According to Adobe’s announcement of the plan, Creative Cloud Pro pricing will be effective at your next renewal on or after June 17. Currently, these changes are only rolling out in North America. This follows better-than-expected first quarter 2025 financial results for the software company, which reported a record revenue of $5.71 billion, equal to 10% year-over-year growth. Still, Adobe’s shares dropped after the report, as several experts and investors noted concerns that the company might be falling behind competitors with its AI efforts. Creative Cloud Pro appears to be the next step for Adobe to monetize its newly robust suite of AI tools by making them a mandatory investment for the company’s most dedicated users, even as it rolls out “made without generative AI” image labels. Here’s what to know about the new plan. What’s new on Creative Cloud Pro? To start, Creative Cloud Pro comes with all of the features that were included under the Creative All Apps umbrella. The plan includes a portfolio of more than 30,000 fonts, unlimited Creative Cloud libraries, millions of stock photos and videos, and 100GB of cloud storage. In addition to these perks, the upgraded plan will include several new AI features. First, users will gain unlimited access to “standard generative tools” like Photoshop’s Generative Fill, which can essentially “deep fake” anything within a composition, and Lightroom’s Generative Remove, which eliminates unwanted details in a photo. Creative Cloud Pro users will also have 4,000 monthly credits to use for Adobe’s class of “premium generative features,” like Premiere Pro’s Generative Extend, which uses AI to add frames to the beginning or end of any video. The rebranded subscription also includes the most recent Firefly app, which Adobe bills as its “one-stop shop for exploration and ideation with creative AI.” The app comes with Adobe’s new text-to-image generator Image Model 4, as well as its Firefly Video Model, which first entered public beta last month. Another feature called Firefly Boards allows teams to do some Pinterest-style moodboard brainstorming. For any Creative Cloud Pro users who have a different AI model of choice, they can also choose to import Google Imagen 3 and Veo 2, OpenAI image generation, or Flux 1.1 Pro into Firefly. More details on Creative Cloud Pro features are available here. How much will it cost for different kinds of users? Prices are set to rise across the board for all kinds of Creative Cloud All Apps users. For rolling subscribers (those not on an annual plan), prices will rise from $89.99 to $104.99. For teams, prices will jump from $89.99 to $99.99 per month. And for student and teacher plans, renewal prices are set to increase from $34.99 to $39.99 monthly. What if I don’t want to join this new plan? If you’re a current Creative Cloud All Apps user but don’t want to be automatically shuffled into Creative Cloud Pro, Adobe has created another subscription tier called “Creative Cloud Standard.” This tier is the same price as the former Creative Cloud All Apps ($54.99/month for annual users), but it comes with a bit less value. Whereas All Apps included 1,000 monthly credits for the aforementioned standard generative features, Creative Cloud Standard only includes 25 credits. It also limits access to premium features on mobile and web apps, and, of course, does not include premium generative features or Firefly. While Adobe’s webpage states that Creative Cloud Standard is “only available to existing customers,” an Adobe spokesperson clarified that new users can actually join this tier by contacting customer support. It’s a trade-off that essentially means you’ll be paying the same amount for a subscription with fewer bonuses, but it might be the option that makes the most sense for users who have no interest in Adobe’s AI features. On Reddit, plenty of users have already expressed displeasure with the new plan. It’s easy to see why. Adobe is automatically upgrading subscriptions to the more expensive Creative Cloud Pro tier, a UX pattern that makes it less likely for users to opt-out than if they had to make an active choice and tick a subscribe box, for instance. Both this and the Creative Cloud Standard journey for new users could be seen as dark patterns, which are UX pathways that manipulate users into taking actions that they may not have intended but are in the business interests of the company. The U.S. sued Adobe over its hard-to-cancel subscriptions last year. The goal of the auto upgrade, in combination with the decreased appeal of the Creative Cloud Standard tier due to its reduced features, seems to be to draw more daily active users into the company’s existing AI products. That’d be in close keeping with its recent focus on monetizing gen AI tools following its last earnings report, anyway, which was plagued with fears that Adobe isn’t staying ahead in the AI race. An Adobe spokesperson declined to comment on the reasoning behind the subscription tier rebrand and whether users will be personally notified before the change takes place.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5907582874096159198",
        "title": "Adobe to automatically move subscribers to pricier, AI-focused tier in June",
        "url": "https://arstechnica.com/gadgets/2025/05/adobe-hikes-subscription-prices-to-support-generative-ai-features/",
        "site": "arstechnica.com",
        "time": 1747759540000,
        "favicon_url": "https://static.tickertick.com/website_icons/arstechnica.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Monthly fees for multi-app subscribers to rise by up to 16.7 percent. Subscribers to Adobe’s multi-app subscription plan, Creative Cloud All Apps, will be charged more starting on June 17 to accommodate for new generative AI features. Adobe’s announcement, spotted by MakeUseOf, says the change will affect North American subscribers to the Creative Cloud All Apps plan, which Adobe is renaming Creative Cloud Pro. Starting on June 17, Adobe will automatically renew Creative Cloud All Apps subscribers into the Creative Cloud Pro subscription, which will be $70 per month for individuals who commit to an annual plan, up from $60 for Creative Cloud All Apps. Annual plans for students and teachers plans are moving from $35/month to $40/month, and annual teams pricing will go from $90/month to $100/month. Monthly (non-annual) subscriptions are also increasing, from $90 to $105. Further, in an apparent attempt to push generative AI users to more expensive subscriptions, as of June 17, Adobe will give single-app subscribers just 25 generative AI credits instead of the current 500.Read full article Comments",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-9002137208710040870",
        "title": "Salesforce says it is discounting Slack for US agencies, by as much as 90%, through November, following similar deals by Adobe and Google (Bloomberg)",
        "url": "http://www.techmeme.com/250519/p18#a250519p18",
        "site": "techmeme.com",
        "time": 1747670100000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Bloomberg: Salesforce says it is discounting Slack for US agencies, by as much as 90%, through November, following similar deals by Adobe and Google — The team collaboration software will be available to federal agencies at as much as a 90% discount through November, the General Services Administration said Monday in a statement.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1779715643466889241",
        "title": "Adobe rises as Jefferies sees estimates as 'conservative,' updates Creative Cloud",
        "url": "https://seekingalpha.com/news/4449685-adobe-rises-as-jefferies-sees-estimates-as-conservative-updates-creative-cloud",
        "site": "seekingalpha.com",
        "time": 1747414390000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3070766698805596984",
        "title": "Sohn speakers see value in unloved stocks amid macro uncertainty | $ADBE $AMX $TEVA $FIX $WEX",
        "url": "https://seekingalpha.com/news/4449102-sohn-speakers-see-value-in-unloved-stocks-amid-macro-uncertainty",
        "site": "seekingalpha.com",
        "time": 1747339400000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "416668205900169433",
        "title": "Wex, Adobe, Sea pitched as long ideas at Sohn Conference",
        "url": "https://seekingalpha.com/news/4448205-wex-adobe-sea-pitched-as-long-ideas-at-sohn-conference",
        "site": "seekingalpha.com",
        "time": 1747246345000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "2231713460080622065",
        "title": "Morgan Stanley Is Leading IPO for Design Software Maker Figma",
        "url": "https://www.bloomberg.com/news/articles/2025-05-12/morgan-stanley-is-leading-ipo-for-design-software-maker-figma",
        "site": "bloomberg.com",
        "time": 1747092977000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Design software business Figma Inc. hired Morgan Stanley to lead what could be one of the year’s biggest initial public offerings, according to people familiar with the matter. The Figma logo on a smartphone and the Adobe logo on a laptop arranged in the Brooklyn borough of New York, US, on Friday, July 28, 2023. Adobe Inc.s $20 billion takeover of design startup Figma Inc. is on course for an in-depth investigation from European Union merger regulators, adding to growing global scrutiny of the deal dubbed by Adobes boss as transformational.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3730085465712962099",
        "title": "Adobe reaches deal with US gov't to slash software prices amid spending scrutiny",
        "url": "https://seekingalpha.com/news/4445699-adobe-reaches-deal-with-us-govt-to-slash-software-prices-amid-spending-scrutiny",
        "site": "seekingalpha.com",
        "time": 1746793303000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "1657464107530964143",
        "title": "Figma’s world is growing fast - The design kingpin just entered multiple new categories and ...",
        "url": "https://www.fastcompany.com/91329127/figma-config-2025-dylan-field?.tsrc=rss",
        "site": "fastcompany.com",
        "time": 1746790200000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "The design kingpin just entered multiple new categories and added more AI. CEO Dylan Field says it’s all still about helping humans craft better products.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-7234677664892161834",
        "title": "Adobe to Cut Software Price for US Government After DOGE Review",
        "url": "https://www.bloomberg.com/news/articles/2025-05-08/adobe-to-cut-software-price-for-us-government-after-doge-review",
        "site": "bloomberg.com",
        "time": 1746737661000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe Inc. will offer a package of its products to the government at a discounted rate following scrutiny on software spending by the Trump administration. Adobe headquarters in San Jose, California, US, on Thursday, Nov. 30, 2023. Adobe Inc. is scheduled to release earnings figures on December 13.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-7109180391187271797",
        "title": "Figma releases AI-powered tools to take on Canva and Adobe: Figma Sites for creating sites, Figma Make for app prototypes, and Figma Buzz for marketing assets (Ivan Mehta/TechCrunch)",
        "url": "http://www.techmeme.com/250507/p34#a250507p34",
        "site": "techmeme.com",
        "time": 1746637503000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Ivan Mehta / TechCrunch: Figma releases AI-powered tools to take on Canva and Adobe: Figma Sites for creating sites, Figma Make for app prototypes, and Figma Buzz for marketing assets — Design company Figma today announced multiple features, including AI-powered site and web app creation, a way for marketers to create assets in bulk, and a new drawing tool.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "7838165465935834577",
        "title": "Adobe Creative Cloud deal: Save 40% on Photoshop, Premiere Pro, and more",
        "url": "https://www.businessinsider.com/guides/deals/adobe-creative-cloud-deal-2025",
        "site": "businessinsider.com",
        "time": 1746481697000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "-1779715643466889241"
        ],
        "description": "Adobe Creative Cloud is a great tool for artists, photographers, and creatives. Get 40% off your first year with this Spring 2025 deal. When you buy through our links, Business Insider may earn an affiliate commission. Learn moreThe Adobe Creative Cloud deal lasts until May 12.Mateusz Slodkowski / SOPA Images via Reuters ConnectAdobe's suite of effective and user-friendly apps features helpful tools for any creative, whether you're a photographer, video editor, digital illustrator, or animator. Adobe Creative Cloud allows you to bundle all of Adobe's apps in one subscription, so there's no shortage of things you can design. Plus, the current Adobe Creative Cloud deal means now's a great time to subscribe at a discounted rate.Right now, Adobe is offering a limited-time discount on its Creative Cloud All Apps subscription. While the deal lasts, you can get your first year of the service 40% off, bringing the price down $24 from $59.99 a month to just $35.99 a month. The suite gives you access to programs like Photoshop, Illustrator, InDesign, and more that can help you level up any portfolio, website, or project.Keep in mind that the deal price is only valid for your first year and requires a full-year commitment. Once your first year of the Creative Cloud subscription has passed, you can cancel your subscription or keep it and let it automatically renew at the original price of $59.99 a month. Learn more about pricing and plans in our Adobe Creative Cloud price breakdown.It's rare to see Adobe Creative Cloud on sale outside major shopping events like Black Friday, so this is a deal you won't want to pass up if you've been on the fence. Even if you only use a couple of the included apps, investing in the full Creative Cloud suite gives you a better value than purchasing individual subscriptions to certain apps, especially with the current deal.Adobe Creative Cloud gives you access to apps like Photoshop, Illustrator, and more.AdobeFollow our WhatsApp channel for more deals and buying guides from the Reviews TeamAdobe Creative Cloud deal frequently asked questionsWhen does the Adobe Creative Cloud deal end?The Adobe Creative Cloud deal went live on May 1 and will continue until May 12, so you still have some time to subscribe.What is included with Adobe Creative Cloud?Adobe Creative Cloud includes just about every app in the brand's portfolio, including helpful photo, video, and design tools. Users get access to Photoshop, Illustrator, Premiere Pro, Acrobat Pro, InDesign, After Effects, Lightroom, Adobe XD, Animate, Lightroom Classic, Dreamweaver, Audition, InCopy, Character Animator, Capture, Fresco, Bridge, Express, Photoshop Express, Media Encoder, Aero, Adobe Scan, Fill&Sign, Acrobat Reader, and Firefly. Check out the full list of included apps on Adobe's website.Check out our guide on how to cancel an Adobe subscription to learn more.Read the original article on Business Insider",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-6195206932157486266",
        "title": "Adobe, Harvard Business Review and Disney Advertising are among 2025’s DMA finalists",
        "url": "https://digiday.com/media/adobe-harvard-business-review-and-disney-advertising-are-among-2025s-dma-finalists/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
        "site": "digiday.com",
        "time": 1745944065000,
        "favicon_url": "https://static.tickertick.com/website_icons/digiday.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "The finalists for this year’s Digiday Media Awards showcase how brands push boundaries by smartly integrating emerging technologies. Each entry highlights a commitment to deepening audience engagement with interactive formats, inviting participation and building community. With a sharp focus on measurable outcomes, the campaigns demonstrate clear impact through tangible results, proving that innovation and strategy […] The finalists for this year’s Digiday Media Awards showcase how brands push boundaries by smartly integrating emerging technologies. Each entry highlights a commitment to deepening audience engagement with interactive formats, inviting participation and building community. With a sharp focus on measurable outcomes, the campaigns demonstrate clear impact through tangible results, proving that innovation and strategy can go hand in hand. Adobe earned a finalist spot for Best Use of Audience Insights by tapping into a core challenge facing Photoshop users: remembering keyboard shortcuts. Inspired by mnemonic tricks used by professional designers, Adobe created a catchy jingle paired with dynamic visuals and a choreographed “finger dance” across a Photoshop-themed keyboard. The video struck a chord with audiences, earning over 1 million views across Instagram and TikTok and generating tens of thousands of saves and shares. This playful yet practical approach engaged loyal users while showcasing how creativity can turn learning into an entertaining experience. Harvard Business Review’s “Women at Work” podcast is a finalist for Best Podcast, recognized for its thoughtful exploration of the challenges facing women and nonbinary professionals. Blending research, lived experiences and practical advice, the show tackles topics from workplace anxiety to integrating AI into careers. Hosts Amy Bernstein and Amy Gallo bring humanity and expertise to timely and enduring conversations. With its presence across newsletters, events and social media, “Women at Work” has grown into a vibrant community that uplifts listeners at every stage of their professional journey.Continue reading this article on digiday.com. Sign up for Digiday newsletters to get the latest on media, marketing and the future of TV.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5006954580431543602",
        "title": "SA analyst upgrades: GOOG, NVDA, INTC, XOM, MU, ADBE, NEE, NXPI, WU",
        "url": "https://seekingalpha.com/news/4435783-sa-analyst-upgrades-goog-nvda-intc-xom-mu-adbe-nee-nxpi-wu",
        "site": "seekingalpha.com",
        "time": 1745597869000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "2122084492112994189",
        "title": "Adobe says Firefly users can now generate images using OpenAI's GPT, Google's Imagen 3 and Veo 2, and Flux 1.1 Pro, in addition to its own Firefly image models (Stephen Nellis/Reuters)",
        "url": "http://www.techmeme.com/250425/p2#a250425p2",
        "site": "techmeme.com",
        "time": 1745557500000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Stephen Nellis / Reuters: Adobe says Firefly users can now generate images using OpenAI's GPT, Google's Imagen 3 and Veo 2, and Flux 1.1 Pro, in addition to its own Firefly image models — Adobe (ADBE.O) said on Thursday it is adding image-generation artificial intelligence models from OpenAI and Alphabet's Google …",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-6457232242569706906",
        "title": "Microsoft fixes machine learning bug flagging Adobe emails as spam",
        "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-machine-learning-bug-flagging-adobe-emails-as-spam/",
        "site": "bleepingcomputer.com",
        "time": 1745521327000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Microsoft says it mitigated a known issue in one of its machine learning (ML) models that mistakenly flagged Adobe emails in Exchange Online as spam. [...]",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-9184721363256826331",
        "title": "Adobe releases ‘created without generative AI’ tag to label human-generated art",
        "url": "https://www.fastcompany.com/91321495/adobe-created-without-generative-ai-label?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1745488800000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "The ever-increasing power of generative AI has divided the graphic design community. Many are embracing the tools in their workflows, while others believe they’ve stolen from culture and commoditized a craft. In any case, we all live in a strange time, when people are often presenting fully generative work as their own. Sometimes that’s innocuous. And sometimes that’s icky. But now Adobe wants to offer the public a means to distinguish the authentic from the automated. A new “created without generative AI” tag in Adobe Fresco—the company’s drawing and painting app—will let you mark work as being free from the use of generative AI tools, to certify that you created it by hand. The feature is likely to come to other pieces of the Adobe Suite, according to Eric Snowden, SVP of design at Adobe. [Image: Adobe] “Fresco is one of our tools that we’re not including generative AI, and we wanted to make sure that for someone creating these amazing artworks by hand, they have the ability to say, ‘I did not use generative AI inside of Fresco,” says Snowden. “Those are our customers, too, and we want to support them. If they feel the need to be able to convince clients that they didn’t use generative AI, we want to make that as simple for them to do as possible.” The new optional disclosure comes alongside a greater wave of announcements from Adobe this week that double down on generative AI. Adobe is introducing video and vector support to its own “commercially safe” Firefly model, while also integrating popular generative AI models by third parties—including OpenAI’s ChatGPT, Google’s Imagen and Veo, and Flux—into its software suite. (More partners, including Runway and Luma, will be coming down the line.) Despite Adobe’s lengthy, and even delayed approach to building its proprietary AI model, Snowden says enabling these options that Adobe has tacitly criticized is all about “customer choice.” How Adobe marks work as “created without generative AI” To certify your work as AI-free, Adobe is using its Content Credentials standard. While originally presented as a means to limit misinformation—a topic on which I was more than a little skeptical—this approach to metadata makes a lot more sense in the context of Adobe’s GenAI workflows. These credentials are basically a running receipt of where you did what to any piece of media inside of Adobe’s system. So it will list if you brought your own photo into ChatGPT to restyle it, and then exported it to Adobe Firefly to turn it into video. (Adobe is labeling any media imported into its software that out of its gaze might already be influenced by GenAI as media of unknown origin on this running receipt.) Granted, provenance is almost an oxymoron in any generative AI workflow: ChatGPT 4 was trained on 13 trillion “tokens” of data you’ll never be able to cite. But the Content Credentials standard does offer some sort of ledger of reference to clients or the public at large to how something was created. It’s something a creator can point to and explain or defend the source of their work. “I think illustration is where we’re seeing [demand] . . . but I don’t think it’s specific to only illustration,” Snowden says. Indeed, the competing platform Procreate has taken an anti-GenAI stance, but anti-AI sentiment doesn’t apply to illustrators alone. “I would imagine there are people in every creative discipline where generative AI is not something they’re interested in,” Snowden continues. “And if they feel compelled to communicate—or they’re again being asked to communicate—that they didn’t use generative AI, we should help them do that.” Claiming that any digital work is free from the influence of AI is impossible. For a human gesture to be transformed into a pixel, it’s filtered through all sorts of algorithms that help smooth and make sense of one’s input on a screen—and that’s definitely true for Adobe Fresco as well as the other apps in its suite. Long before GenAI arrived, Adobe products were steeped in the benefits of artificial intelligence and similar coded assistance. That said, Adobe is clearly reading the room, and realizing it must acknowledge that many creators find generative AI to be an assault on their viewpoint and livelihood—even while Adobe is investing more into these technologies that are simply too powerful, and in demand, to be ignored. “Everybody’s going to create in such different ways,” says Snowden. “Which is the exciting thing about working on these kinds of projects—giving people as much choice as possible.”",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-4986674243168651795",
        "title": "LinkedIn expands its free verification system to the wider web, letting sites display LinkedIn verification, starting with Adobe's new Content Authenticity app (Dominic Preston/The Verge)",
        "url": "http://www.techmeme.com/250424/p12#a250424p12",
        "site": "techmeme.com",
        "time": 1745487901000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Dominic Preston / The Verge: LinkedIn expands its free verification system to the wider web, letting sites display LinkedIn verification, starting with Adobe's new Content Authenticity app — ﻿Adobe is one of the first companies to offer users a ‘Verified on LinkedIn’ badge.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5373128941135823853",
        "title": "Adobe Max London Sees Launch Of A Slew Of New Creative Cloud Upgrades And Features",
        "url": "https://www.forbes.com/sites/marksparrow/2025/04/24/adobe-max-london-sees-launch-of-a-slew-of-new-creative-cloud-upgrades-and-features/",
        "site": "forbes.com",
        "time": 1745485999000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe is unveiling lots of updates and features to its Creative Cloud suite of software which provide AI tools and access to models for creating commercially safe images. Adobe is unveiling lots of updates and features to its Creative Cloud suite of software which provide AI tools and access to models for creating commercially safe images.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "4096971431935519977",
        "title": "Adobe to launch mobile app for AI image generation tool as OpenAI steps up rivalry",
        "url": "https://www.cnbc.com/2025/04/24/adobe-plans-mobile-app-for-firefly-ai-image-generator-to-rival-openai.html",
        "site": "cnbc.com",
        "time": 1745485322000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe said Thursday that it will release its Firefly AI image generator on both iOS and Android \"soon,\" without giving a specific date.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-7021873337202236854",
        "title": "Adobe releases new Firefly image generation models and a redesigned Firefly web app",
        "url": "https://techcrunch.com/2025/04/24/adobe-releases-new-firefly-image-generation-models-and-a-redesigned-firefly-web-app/",
        "site": "techcrunch.com",
        "time": 1745485200000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe on Thursday launched the latest iteration of its Firefly family of image generation AI models, a model for generating vectors, and a redesigned web app that houses all its AI models, plus some from its competitors. There’s also a mobile app for Firefly in the works. The new Firefly Image Model 4, Adobe says, […]",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-6990002033943984066",
        "title": "Adobe wants to create a robots.txt styled indicator for images used in AI training",
        "url": "https://techcrunch.com/2025/04/24/adobe-wants-to-create-a-robots-txt-styled-indicator-for-images-used-in-ai-training/",
        "site": "techcrunch.com",
        "time": 1745485200000,
        "favicon_url": "https://static.tickertick.com/website_icons/techcrunch.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "For years, websites included information about what kind of crawlers were not allowed on their site with a robots.txt file. Adobe, which wants to create a similar standard for images, has added a tool to content credentials with an intention to give them a bit more control over what is used to train AI models. […]",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-3489948736824156672",
        "title": "Which Tech Giants Are Leading with the Toughest Interviews and Earning Candidates' Praise?",
        "url": "https://www.digitalinformationworld.com/2025/04/which-tech-giants-are-leading-with.html",
        "site": "digitalinformationworld.com",
        "time": 1745427600000,
        "favicon_url": "https://static.tickertick.com/website_icons/digitalinformationworld.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Some top tech firms often keep interview candidates waiting four weeks for a response - it’s become common practice, from Apple to Adobe. And with over a third of candidates previously rejecting an offer due to a negative interview experience, the processes seem to be getting worse as the competition between candidates gets stiffer. It’s been reported that hiring has also slowed in recent months, meaning recruiters and candidates are battling for fewer roles - 64% of recruiters agree with this. One result of the change in the number of roles available is that companies are now able to extend their interview processes. This is because more candidates are willing to sign up for a long process, due to the lack of opportunities. Digital PR agency Reboot Online was interested in the interview experience for candidates applying to the best companies in the world. They assessed the Glassdoor profiles of the 100 highest-ranking companies in the Forbes World’s Best Employers List . The experiences of more than 300,000 candidates were reported on the website and analyzed by Reboot to reveal which companies had the highest percentage of negative and positive experiences. They also assessed the reviews to find out which companies had the most difficult interviews, based on their difficulty rating submitted by candidates. Which companies have the hardest interview process? Company (Industry)Average Difficulty Score (/5)Google (IT Software & Services)3.4NVIDIA (Semiconductors, Electronics, Electrical Engineering)3.2Rolls-Royce Holdings (Aerospace & Defense)3.2Salesforce (IT Software & Services)3.2Meta Platforms (IT Software & Services)3.2Microsoft (IT Software & Services)3.1Adobe (IT Software & Services)3.1Amazon (IT Software & Services)3.1Alibaba Group (IT Software & Services)3.1Apple (Transportation and Logistics)3.0 The most common trend observed by Reboot Online’s analysis of the most difficult interview processes is that difficult interviews do not always correlate with bad experiences. They discovered that although candidates may report a hard interview, they often report a lower percentage of negative experiences compared to other companies. This is likely because the companies in the top 10 are well-established and could come under scrutiny if their processes are too harsh or dismissive of rejected candidates. Reboot Online found that candidates interviewing for Google / Alphabet report the highest difficulty score among the 100 best companies globally. Renowned for their challenging nature and hiring the best talent in tech, interviewees report an average difficulty score of 3.5 out of 5. The company lives up to its reputation for being tough to break into. Candidates note Google’s focus on complex problem-solving, critical thinking and a deep understanding of technical concepts. Despite this high difficulty score, 67% of Google candidates still left the challenging interview feeling like it was positive. While just 13% described it as negative. A handful of companies fall into second place with an average difficulty score of 3.2. NVIDIA, the computer manufacturing corporation, Rolls-Royce Holdings, an aerospace company, Salesforce Inc., a software company, and Meta Platforms, a technology company, all report the second-highest score. Candidates recall interviews from all companies to be comprehensive and rigorous as they assess both technical proficiency and cultural fit across all difficult types of roles. Their competitive hiring processes attract top-tier candidates, allowing them to be more selective than others. Interestingly, Salesforce and Rolls-Royce candidates both report high levels of positive interview experiences, with 80% and 75% of positive experiences, respectively. Salesforce have an in-depth blog post on their careers page about interviewing with the company, which helps candidates to understand the process. Features like this one help interviewees enter the interview and leave with a positive perception of the company - they feel like they’ve been helped out, rather than left in the dark. Which companies have the worst interview processes? While each candidate has reported their own individual experiences using the Glassdoor reviews, there are some key trends which can be identified and have emerged from each company's processes. Company (Industry)Percentage of Negative InterviewsSpotify Technology (IT Software & Services)37%Indeed (IT Software & Services)29%PayPal (Banking and Financial Services)28%Shopify (IT Software & Services)28%Netflix (Media & Advertising)28%Nintendo (Media & Advertising)26%Logitech International (Semiconductors, Electronics, Electrical Engineering)25%Adobe (IT Software & Services)22%Deutsche Telekom (Telecommunications Services, Cable Supplier)22%Shiseido (Construction, Chemicals, Raw Materials)22% Reboot Online found that the company with the highest percentage of candidates reporting negative experiences is Spotify. Among the world’s top 100 employers, almost two in five report a bad experience interviewing at the company. Some of the complaints among candidates include recruiters ghosting them following an interview, generic rejection emails after their long process and even some interviewers arriving late. Despite this high volume of complaints, 46% reported a positive experience; however, this is still the lowest among all of the top 100 companies. Interestingly, Spotify do have the lowest number of employees among Forbes’ ranking, so it's not surprising their hiring team may be under more stress than others. Surprisingly, 29% of candidates recall negative interviews at Indeed. Despite being the world’s top job site, it ranks second overall for the worst interview experiences. With over 1,800 candidate reports on Glassdoor, Indeed is one of the four IT companies to feature in the top 10, potentially suggesting a wider industry issue. In joint third place are PayPal, a multinational financial technology company; Shopify, an E-commerce company; and Netflix, a media company. These well-known companies follow closely, with 28% of candidates reporting negative interview experiences. Despite all three of these being known as highly desirable places to work, the fast-paced cultures don’t leave all candidates with a good impression, as almost one in three left unhappy with the interview process. However, of these companies, PayPal candidates report the highest percentage of positive experiences at 52%. Shopify follows closely with 51% and Netflix with 49%.Read next: • These Are the Countries Offering the Best Opportunities for Immigrants in Terms of Career Growth• Study Shows Instagram and TikTok Are Toughest for Achieving Social Media Virality• Data Reveals: Meta's Facebook, Twitch, and Likee Experience Major Declines in Popularity",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3980474276711616593",
        "title": "Adobe partners with NFL to provide AI-powered fan experiences",
        "url": "https://seekingalpha.com/news/4433950-adobe-partners-with-nfl-to-provide-ai-powered-fan-experiences",
        "site": "seekingalpha.com",
        "time": 1745411535000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1795609853735535920",
        "title": "Logitech Launches New Lightroom And Final Cut Pro Plugins For MX Creative Console",
        "url": "https://www.forbes.com/sites/marksparrow/2025/04/23/logitech-launches-new-lightroom-and-final-cut-pro-plugins-for-mx-creative-console/",
        "site": "forbes.com",
        "time": 1745391600000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Logitech has launched plugins for its MX Creative Console to boost creative workflow. There are new plugins for Adobe Lightroom, Final Cut Pro, DaVinci Resolve and Figma. Logitech has launched plugins for its MX Creative Console to boost creative workflow. There are new plugins for Adobe Lightroom, Final Cut Pro, DaVinci Resolve and Figma.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "6240843117255042657",
        "title": "I'm a machine learning lead at Adobe. I got ahead by prototyping fast — and by embracing vulnerability.",
        "url": "https://www.businessinsider.com/career-adobe-machine-learning-ai-prototyping-fast-vulnerability-tech-2025-4",
        "site": "businessinsider.com",
        "time": 1745193603000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Surabhi Bhargava recommended getting ideas into people's hands as fast as possible.Surabhi BhargavaSurabhi Bhargava went from an entry-level role to a machine learning lead at Adobe in five years.She said that translating ideas into real products goes much further than just talking about them.Being vulnerable also helped Surabhi build connections and receive valuable support for her career.This as-told-to essay is based on a conversation with Surabhi Bhargava, a machine tech lead at Adobe's San Jose office. It has been edited for length and clarity. Business Insider has verified her employment.In just five years, I went from an entry-level machine learning engineering role to a machine learning tech lead at Adobe. It's been quite the journey.What's been key for me is that I always had the chance to work on Adobe's most relevant AI projects.AI has advanced rapidly over the last five years. I started with computer vision, moved to natural language processing, and now I'm focused on generative AI.The key to my advancement has been consistently finding the right opportunities, being in the right place at the right time, and sometimes starting projects from scratch.Share tangible ideasA key aspect of working in this industry is translating ideas into real products.You've probably heard the phrase \"show, don't tell.\" People often share ideas but don't usually have proof of concept or something tangible people can interact with.Having something real that others can test goes much further than just talking about ideas.I've always made it a point to translate my ideas into something people can try. I'd create initial prototypes and give them to product managers or senior folks. If they liked it, we'd move forward with developing the product.If not, I'd get feedback and useful information to iterate it further.It doesn't need to be an entire product or have a shiny user interface — just something tangible they can engage with. A simple front-end that lets them test the backend tech works just fine.This approach helps me build faster, get feedback faster, and share ideas more broadly, which builds credibility.When people work on similar projects and need collaborators, you want to be the first person they think of. Having visible work behind you makes that much more likely.Embracing vulnerabilityBuilding connections at work is valuable, but it wasn't natural for me to go up and talk to someone randomly.I had to push myself out of my comfort zone. What I found was that the more vulnerable I was — whether talking about the challenges I was facing or the opportunities I was seeking — the more others opened up, too. This wasn't just with my manager — it was across the company.As a minority in tech, having a strong support system, like fellow women engineers, was also important.Being open about my struggles and ambitions encouraged others to share their experiences and offer valuable help. The key was always bringing that advice back to my work and growth.People don't do that enough. You won't always get what you ask for, but you definitely won't get it unless you ask. This applies not only to career progression but also to life advice.Vulnerability helps create those connections — people are more likely to support you when you let them in. Be open, reach out without hesitation, and help will come in unexpected ways.Do you have a story to share about working in AI? Contact this reporter at cmlee@businessinsider.com.Read the original article on Business Insider Surabhi Bhargava recommended getting ideas into people's hands as fast as possible.Surabhi BhargavaSurabhi Bhargava went from an entry-level role to a machine learning lead at Adobe in five years.She said that translating ideas into real products goes much further than just talking about them.Being vulnerable also helped Surabhi build connections and receive valuable support for her career.This as-told-to essay is based on a conversation with Surabhi Bhargava, a machine tech lead at Adobe's San Jose office. It has been edited for length and clarity. Business Insider has verified her employment.In just five years, I went from an entry-level machine learning engineering role to a machine learning tech lead at Adobe. It's been quite the journey.What's been key for me is that I always had the chance to work on Adobe's most relevant AI projects.AI has advanced rapidly over the last five years. I started with computer vision, moved to natural language processing, and now I'm focused on generative AI.The key to my advancement has been consistently finding the right opportunities, being in the right place at the right time, and sometimes starting projects from scratch.Share tangible ideasA key aspect of working in this industry is translating ideas into real products.You've probably heard the phrase \"show, don't tell.\" People often share ideas but don't usually have proof of concept or something tangible people can interact with.Having something real that others can test goes much further than just talking about ideas.I've always made it a point to translate my ideas into something people can try. I'd create initial prototypes and give them to product managers or senior folks. If they liked it, we'd move forward with developing the product.If not, I'd get feedback and useful information to iterate it further.It doesn't need to be an entire product or have a shiny user interface — just something tangible they can engage with. A simple front-end that lets them test the backend tech works just fine.This approach helps me build faster, get feedback faster, and share ideas more broadly, which builds credibility.When people work on similar projects and need collaborators, you want to be the first person they think of. Having visible work behind you makes that much more likely.Embracing vulnerabilityBuilding connections at work is valuable, but it wasn't natural for me to go up and talk to someone randomly.I had to push myself out of my comfort zone. What I found was that the more vulnerable I was — whether talking about the challenges I was facing or the opportunities I was seeking — the more others opened up, too. This wasn't just with my manager — it was across the company.As a minority in tech, having a strong support system, like fellow women engineers, was also important.Being open about my struggles and ambitions encouraged others to share their experiences and offer valuable help. The key was always bringing that advice back to my work and growth.People don't do that enough. You won't always get what you ask for, but you definitely won't get it unless you ask. This applies not only to career progression but also to life advice.Vulnerability helps create those connections — people are more likely to support you when you let them in. Be open, reach out without hesitation, and help will come in unexpected ways.Do you have a story to share about working in AI? Contact this reporter at cmlee@businessinsider.com.Read the original article on Business Insider",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-7437260238799081335",
        "title": "Figma files for IPO after failed $20 billion Adobe takeover",
        "url": "https://www.fastcompany.com/91317881/figma-files-ipo-after-failed-20-billion-adobe-takeover",
        "site": "fastcompany.com",
        "time": 1744815328000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Cloud-based designer platform Figma on Tuesday confidentially filed for an initial public offering in the United States, more than a year after a $20 billion deal to be acquired by Adobe was shelved due to regulatory roadblocks. Figma had been widely considered as a candidate to go public after antitrust regulators in Europe and Britain blocked Adobe’s deal in December 2023 in what would have been one of the biggest acquisitions of a software startup. Last year, Figma was valued at $12.5 billion after it closed a deal to allow its employees and early investors to sell their stake to new and existing investors. The U.S. IPO market, which made a strong comeback last year from a slew of high-profile listings, has been rattled by market volatility stemming from tariff-related uncertainty, with companies adopting a wait-and-see approach before proceeding with their stock market debuts. “Sentiment for the IPO market is relatively low and has been dampened by heightened market volatility stemming from a lack of policy clarity. Over the past few months, we saw a string of tech startups filing to go public, but many subsequently put their IPO plan on hold,” said Kaidi Gao, senior VC analyst at PitchBook. Figma, a design platform with both free and paid offerings, is used to create, share and test designs for websites, mobile apps and other digital products, boasts customers such as Adobe, Uber, Spotify and Alphabet’s search-engine giant Google. The company, co-founded by tech executive Dylan Field in 2012, is cash flow positive and has expanded its offerings to include a broader platform for team collaborations with artificial intelligence features. —Jaiveer Shekhawat, Reuters",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-2195435629328060018",
        "title": "Adobe: Why We're Bullish Now - Let’s not mince words – Adobe (NASDAQ: ADBE) is a compelling ...",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/16/adobe-why-were-bullish-now/",
        "site": "forbes.com",
        "time": 1744806606000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Let’s not mince words – Adobe (NASDAQ: ADBE) is a compelling buy at current levels. The company leads its sector, has exceptional fundamentals... Let’s not mince words – Adobe (NASDAQ: ADBE) is a compelling buy at current levels. The company leads its sector, has exceptional fundamentals...",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-4323822861955912335",
        "title": "Figma confidentially files for IPO more than a year after ditching Adobe deal",
        "url": "https://www.cnbc.com/2025/04/15/figma-confidentially-files-for-ipo-a-year-after-ditching-adobe-deal.html",
        "site": "cnbc.com",
        "time": 1744752179000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Figma, whose software is widely used among app designers, appears headed for the public market after abandoning a tie-up with Adobe in 2023.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-4752267803095254813",
        "title": "Design Software Startup Figma Files Confidentially for IPO",
        "url": "https://www.bloomberg.com/news/articles/2025-04-15/design-software-startup-figma-files-confidentially-for-ipo",
        "site": "bloomberg.com",
        "time": 1744751438000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "2231713460080622065",
            "4473843794303512297",
            "-7437260238799081335",
            "3143077377749809435",
            "-4323822861955912335"
        ],
        "description": "Figma, a startup that makes app design and collaboration software, has filed confidentially for an initial public offering, over a year after a planned merger with Adobe Inc. fell apart. The Figma website on a laptop arranged in the Brooklyn borough of New York, US, on Friday, July 28, 2023. Adobe Inc.s $20 billion takeover of design startup Figma Inc. is on course for an in-depth investigation from European Union merger regulators, adding to growing global scrutiny of the deal dubbed by Adobes boss as transformational.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3182639744103744176",
        "title": "Krea, an Adobe for the AI era, discusses its $500 million vision",
        "url": "https://www.fastcompany.com/91316582/krea-an-adobe-for-the-ai-era-discusses-its-500-million-vision?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1744711200000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "When I first met Krea co-founders Victor Perez and Diego Rodriguez in 2023, the industry was scrambling to understand the a-bomb of generative AI. But inside their work-live condo in Hayes Valley, San Francisco—decorated with an Eiffel Tower built from La Croix cans—the duo painted a confident vision of the future: One where they could build a platform not just about “generating” AI media, but a toolset to offer an artisan level manipulation of this new technology. They wanted to consolidate the world of AI models, then blur the bounds of media as we understand it, erasing the divisions between images, video, and sound in a new era powered by computational intelligence. In a world where you could suddenly create anything, Krea’s core promise was one of controllability—to be a platform to help you make something. While that sounded borderline naive in a visual world ruled by giants including Adobe, Figma, OpenAI, and Canva, two years and 20 million users later, Krea has closed a $43 billion Series B round led by Bain Capital Ventures. Following its Series A led by Andreessen Horowitz, the startup has now raised $83 million on a valuation of half a million dollars. “I always think that we have been very lucky as founders, in being successful with the thing that we wanted to do since the beginning,” says Perez in his first interview since the announcement. “We had a hypothesis that turned out to be real, and it resonated with a lot of the community.” “On that side, I feel really grateful,” he continues. “On the other, we’ve just been working our asses off, just grinding nonstop.” View this post on Instagram A post shared by KREA (@krea_ai) Krea’s blitzkrieg product development cycle Today, Krea offers tools that let you paint in generative AI, use your webcam to feed a real time AI filter, and create images trained on your own artwork (to which you retain rights). Krea continues to ship new features every week, integrating the new models as fast as humanly possible (which usually means within just days or faster). Much of their work is done after midnight. That speed is key in an industry that rides hype cycle after hype cycle. When everyone wants to try the latest and greatest AI tools, integration feeds function and marketing at the same time. Victor Perez (left) and Diego Rodriguez (right) “The industry is still nascent, hence chaotic. Over the next one, two, three, years, who knows?” says Perez. “So one core thing that you can expect from Krea is that we’re going to keep having a very rapid iterative cycle for bringing the latest technology in as soon as it’s available.” That speed is also by design. Until the handshake deal on their Series B a few months ago, Krea was only a team of eight people (it’s now about doubled to 17). But Krea has been able to stay nimble because it didn’t start in the AI industry by attempting to create its own mega models like Anthropic or OpenAI—syncing money and manpower into the core technology. Instead, it’s focused on the manipulation layer. Its value add is largely around UX. “A lot of companies go bottoms up, and they try to first build the technology. They spend millions of dollars on training these AI models. And once they have them trained, and they can generate images or videos, they try to figure out a product for this technology,” says Perez. “That never resonated too much with us, and we have always been tops down.” “There’s an engineer urge to just rewrite from scratch,” adds Rodriguez. “It’s like, no, there’s a lot here that we can already use.” By building tools instead of technology, Krea rapidly tests their own intuitions, and gets feedback on how they’re working from the community. View this post on Instagram A post shared by KREA (@krea_ai) Keeping a low cost footprint Krea has saved a lot of money by focusing on the implementation of existing technology rather than building their own out of the gate. Their $20/month subscription is profitable, and half of all their compute (the big expenditure) goes to new users who are testing Krea’s tools for free. Between closing their series B and this interview months later, the money in Krea’s account actually grew. Only more recently has the company been building optimizations with its own models—run on clusters of over 1,000 GPUs to serve its 750,000 weekly users—which offers benefits ranging from speed to quality. Now, the company says it’s seeing clearer holes in the market, and so it will be launching its own research lab inside Krea focused on the one-two punch of AI aesthetics and controllability. The company will be using its series B funding to staff up this department and fund more AI model training (and, yes, move into official offices, too). View this post on Instagram A post shared by KREA (@krea_ai) Despite all of this investment into their proprietary technology, Krea does not want to moat off their service. Rodriguez recounts early Krea users who screenshared themselves using Photoshop in Krea—ostensibly turning the Adobe interface into one big Krea generative tool. “Suddenly you have everything that you used to with Photoshop, but with the power of AI,” says Rodriguez. That sort of platform-in-a-platform remixing might make some companies queasy, but Krea doesn’t see anything to gain in limiting the workflows of its creative users. “You don’t want them to leave. But at the same time, if they make a very high quality 4K texture in Krea, I want them to take that texture to, say, Autodesk Maya. Because now that texture is in a movie.” Pushing creativity in an industry built on memes When Krea’s fundraising news went public last week, the world was still embroiled in a debate about OpenAI’s latest model (GPT 4o), which countless scores of people used to create Studio Ghibli style images. For anyone who hates the very idea of generative AI, it was fuel on the fire, proof that these tools simply steal creativity and IP from others. View this post on Instagram A post shared by KREA (@krea_ai) But nobody was creating art, nor anything monetizable during this trend. They were making memes. Arguments of taste and ethics aside, Krea is specifically interested in enabling everything that comes after that first image is made. How do you edit it closer to your actual vision? How do you transform it into something else altogether? And their long term business plan is entirely about those ideas. View this post on Instagram A post shared by KREA (@krea_ai) “We need to adapt to this new medium, because right now, we need to take for granted that generating these images is the floor, right?” says Rodriguez. “Generating these kinds of images is like the stroke of a pencil, and that’s and that’s how we should think about them.” That said, Krea still sees GPT 4o as a piece of inspiration, because unlike earlier image models, it was the first that could actually reason, which is why it can understand a human’s instructions so well. And in that technology, Perez suggests that you can squint a bit to see the future. “We will see way more of that. Instructions are like the new coding…So the new creative tools are going to be coded through these instructions,” says Perez. “We’re going to build models that are going to be like, 10x or 100x GPT4o. And they are going to be able to generate all sorts of things.”",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "1492215861130506363",
        "title": "Adobe takes stake in Synthesia, startup behind AI clones for corporate videos",
        "url": "https://www.cnbc.com/2025/04/15/adobe-invests-in-ai-video-platform-synthesia.html",
        "site": "cnbc.com",
        "time": 1744693201000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "5260019866132134116"
        ],
        "description": "Synthesia told CNBC that Adobe's venture capital arm injected an undisclosed amount of funds into the firm in a \"strategic\" partnership.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-5276996188270141804",
        "title": "Canva unveils its biggest redesign in 13 years",
        "url": "https://www.fastcompany.com/91313361/canva-unveils-its-biggest-redesign-in-13-years?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
        "site": "fastcompany.com",
        "time": 1744304400000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Don’t let Canva’s rainbow gradients fool you. The Aussies are relentless, and their global conquest through easy-to-use design software continues as they set their sights on markets owned by Adobe and Microsoft. Even after a controversial price increase last year, growth is still explosive. Canva has added 50 million active users over the past 12 months, bringing its total to 230 million, with $3 billion in annual revenue.But despite this success, Canva decided it was time for a redesign. And it’s launching what the company considers its biggest overhaul since the app launched in 2012. It includes a Teams-crushing approach to file collaboration, a powerful AI-fueled spreadsheet reminiscent of Notion, and the ability to spin up about any project with an AI prompt—including code.[Image: Canva]The file-juggling redesignAt the core of the updates, Canva has reimagined the project interface of its entire Visual Suite. Whereas you used to pick what you wanted to do on a single track—like make a website or design a T-shirt—Canva has been using AI automation to blur the bounds between projects, turning a document into a slide deck, for some time.[Image: Canva]Now, the interface supports this behavior by default. Your canvas sits center screen, and just below it, Canva has added a bar that contains any and all permutations of what else your project can be. So you can be working on a document above, but have thumbnails with decks, social media posts, and other variations below. You just hit a little “plus” sign and determine what sort of template you’d like to add on next, and AI can take the first steps to translate what you already have to this new type of media. All of these media projects can be edited with your colleagues in real time. But conceptually speaking, this UI is also a real time file management system. Instead of digging through a Microsoft Teams directory to find your social media plan for the Q4 strategy doc, those items just sit side by side, editable and interdependent, on the front end. Print, digital, physical brand assets can all live in the same spot, and a brief, pitch, and budget can live side-by-side.As cofounder Melanie Perkins explains, the interface unifies, not just “creation and consumption” but also “context and communication.” “Something our enterprise clients were really excited about was the idea that you’d often have different specialties working in different places and in different tools,” she says. But now, “your team can literally get on the same page.”[Image: Canva]Canva SheetsNo doubt, Canva is developing a lot of these tools for marketers and social media managers. But while the company has made a lot of progress on unifying brand assets, it has only supported simple tables for data management.Canva Sheets is their full blown response to Excel, loaded with AI capabilities reminiscent of Notion. Everything can be programmed in plain language.[Image: Canva]You can type “list restaurants in Milwaukee and their addresses and use an emoji to signify the type of food they sell,” and propagate an organized spreadsheet with all of this information. You can also import data sets of your own (HubSpot, Statista, Snowflake, and Google Analytics at launch—with custom API integration coming down the line), then visualize them. Canva teases how its data visualization can parse insights on ad spend and ROI, even though it doesn’t formally integrate with ad platforms at this time.[Image: Canva]The other thing Sheets is used for is batch content creation, which is a big part of the appeal to AI for marketers. You can take all of your pieces of media on a spreadsheet, each housed in their own cell, and translate them to another language with a button press.But more than any of these examples, spreadsheets will let Canva dig into more complex computational and organizational tasks. “This is going to be a really foundational piece moving forward for our future ambitions,” says Perkins.[Image: Canva]Canva CodeThen on the most experimental arm of Canva’s updates, it’s introducing Canva Code. While most LLMs will attempt to produce code for you these days, Canva has already tightly integrated such capabilities into the rest of the Canva Suite.Starting from a prompt box on top of Canva’s site, you can already type in whatever you’d like to create, like, “poster for Malibu B&B” to automatically generate a first draft. But with Canva Code, you can now type in interactive features—like “build me a math quiz to practice multiplication with lots of dinosaurs” or “make me a map of flights from Chicago to Tokyo.” Canva will start coding these visions in a process that can take a minute or two. [Image: Canva]When attempting to make my map, I asked for a generic “flight tracker to Tokyo,” and the system generated a somewhat abstract ribbon for the map, with arcs flying into the city. (I could have been more specific.) Then below that, the Canva generated interactive tables listing flight times complete with sortable buttons. It listed if the airports were operational, and listed percentages of flights that were running on time. Assuming you like this, a big button labeled “use in a design” will take this code and put into your Canva projects. With a few more taps, you can publish it to the web.The integration is impressive. Without trying it myself, it’s hard to know the limits of the system’s actual coding ability. But Canva is trying to set expectations at a reasonable level with its own prompting in the UI—mortgage calculators, quizzes, and other simple concepts work well, I’m told.“It’s not going to build the entirety of the Canva application, for example, but we think it’ll get better and better over time as well,” says Perkins, in what she frames as a longer term strategy to the company. “It’s really bringing that interactivity, connectivity, and that dynamic content . . . Until today, [Canva] was ending at quite static content, and now all of a sudden, people can bring [in] very rich interactive experiences.”The updates demonstrate that Canva is still not slowing down on its trajectory, and it’s expanding its capabilities to ensure users can make just about anything within its interface. Or as Perkins puts it, “the company is picking off” the features it believes will offer “the biggest unlock for our community” year after year. The challenges now are just how well Canva can actually execute these features, and whether or not they can truly protect operational simplicity with so many disparate tools.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "1585599142674625806",
        "title": "Software Firm Canva Bets on New Creative AI Offerings to Vie With Adobe",
        "url": "https://www.bloomberg.com/news/articles/2025-04-10/canva-bets-on-new-creative-ai-offerings-in-contest-with-adobe",
        "site": "bloomberg.com",
        "time": 1744304400000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Design software provider Canva Inc. unveiled products to boost its generative artificial intelligence offerings, seeking to attract corporate customers away from rival Adobe Inc. as it heads toward an initial public offering. A signage of Canva Inc. at the company's headquarters in Sydney, Australia, on Tuesday, Sept. 17, 2024. To earn a bigger slice of the $15.4 billion creative software market, Canva is focusing on the high-margin enterprise market currently dominated by Adobe. Photographer: Brent Lewin/Bloomberg",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-917859420311671378",
        "title": "Adobe outlines agentic AI features coming to Photoshop, Acrobat, Premiere Pro, and more, including one-click context-aware edits and agents to analyze documents (Sabrina Ortiz/ZDNET)",
        "url": "http://www.techmeme.com/250409/p38#a250409p38",
        "site": "techmeme.com",
        "time": 1744217101000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Sabrina Ortiz / ZDNET: Adobe outlines agentic AI features coming to Photoshop, Acrobat, Premiere Pro, and more, including one-click context-aware edits and agents to analyze documents — Agentic AI is the hottest AI topic because it takes AI assistance as we know it a step further, actually carrying out tasks for users.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-4912267118811511477",
        "title": "Adobe Reveals New Agentic AI System Of Helpers And Aids For Its Software",
        "url": "https://www.forbes.com/sites/marksparrow/2025/04/09/adobe-reveals-new-agentic-ai-system-of-helpers-and-aids-for-its-software/",
        "site": "forbes.com",
        "time": 1744215326000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Ely Greenfield, Adobe’s CTO of Digital Media Business has been outlining how the software giant intends to use AI Agents to help users get even more from its products. Ely Greenfield, Adobe’s CTO of Digital Media Business has been outlining how the software giant intends to use AI Agents to help users get even more from its products.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-316426983973082379",
        "title": "The 20 Hottest AI Software Companies: The 2025 CRN AI 100",
        "url": "https://www.crn.com/news/software/2025/the-20-hottest-ai-software-companies-the-2025-crn-ai-100",
        "site": "crn.com",
        "time": 1744131600000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe, Coupa, Five9, Salesforce and Thread are some of this year’s hottest companies for AI software, agentic AI and more.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "2603144797792435571",
        "title": "Adobe updates Premiere Pro with AI-powered features like Generative Extend, which lets users extend clips by two seconds with 4K quality and background audio (Jess Weatherbed/The Verge)",
        "url": "http://www.techmeme.com/250402/p37#a250402p37",
        "site": "techmeme.com",
        "time": 1743618302000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Jess Weatherbed / The Verge: Adobe updates Premiere Pro with AI-powered features like Generative Extend, which lets users extend clips by two seconds with 4K quality and background audio — ﻿Generative Extend is now rolling out, alongside an AI-powered search panel and caption translations.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-5780413238727064820",
        "title": "Adobe's HR chief tells staff: We're done with DEI hiring goals",
        "url": "https://www.businessinsider.com/adobe-ends-diversity-hiring-targets-following-industry-changes-internal-meeting-2025-4",
        "site": "businessinsider.com",
        "time": 1743526899000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe's HR chief Gloria ChenCourtesy of Gloria ChenAdobe is moving away from its diversity hiring targets.Adobe had set goals in 2020 to increase minority representation in leadership positions.Adobe joins firms like Google and Meta in reducing diversity, equity, and inclusion efforts.Another tech giant — Adobe — is scaling back its diversity hiring goals.At an internal all-hands meeting on Monday, Adobe's chief people officer Gloria Chen said Adobe will no longer keep diversity, equity, and inclusion hiring targets, internally dubbed \"Aspirational Goals,\" according to a recording of the meeting obtained by Business Insider.Aspirational goals were set in 2020 to \"increase global diversity and inclusion\" at leadership levels, according to Adobe's company blog. The goals included increasing female leadership representation to 30% globally, doubling underrepresented minorities in leadership roles, and doubling Black representation as a percentage of US employees by 2025.\"We will discontinue the practice of setting aspirational representation goals while continuing our focus on fair and consistent hiring practices,\" Chen said, adding Adobe has never actually hired based on such quotas.Adobe is the latest in a long list of companies, including Google, Meta, McDonald's, and Deloitte, to reduce its DEI initiatives. The change follows executive orders issued by President Donald Trump in January aimed at ending DEI programs within the federal government and its contractors.Adobe's spokesperson didn't respond to a request for comment.'Need more transparency'During Monday's meeting, HR chief Chen added that executive orders can be \"complex\" to interpret and Adobe is \"evaluating\" many internal programs, activities, and practices to ensure the company complies with them.Chen added that Adobe doesn't believe the DEI pullback applies to countries outside the US for now. As of November, Adobe had a little over 30,000 employees worldwide, of which 50% were in the US, according to a company filing.Adobe also removed all diversity mentions in its latest proxy statement, a change first spotted by Michelle Leder, founder of Footnoted, a site that analyzes SEC filings. Adobe mentioned diversity 22 times in the previous year's proxy. This year's proxy also deleted a chart on director diversity.Some Adobe employees shared their frustration in an internal Slack channel, according to screenshots seen by BI. One employee said Adobe's unique culture of embracing different perspectives, called Adobe for All, now seems \"lost.\" Another said it was \"heartbreaking\" and asked for additional guidance from the leadership team.\"I think we all need more transparency around this issue,\" one of the people said.Have a tip? Contact this reporter via email at ekim@businessinsider.com or Signal, Telegram, or WhatsApp at 650-942-3061. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider Adobe's HR chief Gloria ChenCourtesy of Gloria ChenAdobe is moving away from its diversity hiring targets.Adobe had set goals in 2020 to increase minority representation in leadership positions.Adobe joins firms like Google and Meta in reducing diversity, equity, and inclusion efforts.Another tech giant — Adobe — is scaling back its diversity hiring goals.At an internal all-hands meeting on Monday, Adobe's chief people officer Gloria Chen said Adobe will no longer keep diversity, equity, and inclusion hiring targets, internally dubbed \"Aspirational Goals,\" according to a recording of the meeting obtained by Business Insider.Aspirational goals were set in 2020 to \"increase global diversity and inclusion\" at leadership levels, according to Adobe's company blog. The goals included increasing female leadership representation to 30% globally, doubling underrepresented minorities in leadership roles, and doubling Black representation as a percentage of US employees by 2025.\"We will discontinue the practice of setting aspirational representation goals while continuing our focus on fair and consistent hiring practices,\" Chen said, adding Adobe has never actually hired based on such quotas.Adobe is the latest in a long list of companies, including Google, Meta, McDonald's, and Deloitte, to reduce its DEI initiatives. The change follows executive orders issued by President Donald Trump in January aimed at ending DEI programs within the federal government and its contractors.Adobe's spokesperson didn't respond to a request for comment.'Need more transparency'During Monday's meeting, HR chief Chen added that executive orders can be \"complex\" to interpret and Adobe is \"evaluating\" many internal programs, activities, and practices to ensure the company complies with them.Chen added that Adobe doesn't believe the DEI pullback applies to countries outside the US for now. As of November, Adobe had a little over 30,000 employees worldwide, of which 50% were in the US, according to a company filing.Adobe also removed all diversity mentions in its latest proxy statement, a change first spotted by Michelle Leder, founder of Footnoted, a site that analyzes SEC filings. Adobe mentioned diversity 22 times in the previous year's proxy. This year's proxy also deleted a chart on director diversity.Some Adobe employees shared their frustration in an internal Slack channel, according to screenshots seen by BI. One employee said Adobe's unique culture of embracing different perspectives, called Adobe for All, now seems \"lost.\" Another said it was \"heartbreaking\" and asked for additional guidance from the leadership team.\"I think we all need more transparency around this issue,\" one of the people said.Have a tip? Contact this reporter via email at ekim@businessinsider.com or Signal, Telegram, or WhatsApp at 650-942-3061. Use a personal email address and a nonwork device; here's our guide to sharing information securely.Read the original article on Business Insider",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "2748698655525848186",
        "title": "A survey of 1,450 verified Indian IT professionals by Blind: 83% reported experiencing burnout, with 72% saying they routinely exceed the 48-hour workweek limit (John Xavier/The Hindu)",
        "url": "http://www.techmeme.com/250401/p9#a250401p9",
        "site": "techmeme.com",
        "time": 1743488401000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "John Xavier / The Hindu: A survey of 1,450 verified Indian IT professionals by Blind: 83% reported experiencing burnout, with 72% saying they routinely exceed the 48-hour workweek limit — Organisations like Confluent, Intuit, UiPath, Adobe, Uber, InMobi, Salesforce, Walmart, Oracle, Amazon, and Microsoft lead the list …",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5469238401394631799",
        "title": "Another big bank has slashed its stock-market outlook amid soaring economic uncertainty",
        "url": "https://www.businessinsider.com/stock-market-outlook-sp500-downgrade-recession-economic-growth-hsbc-citi-2025-3",
        "site": "businessinsider.com",
        "time": 1743004334000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "The US economy could be heading for a sharp slowdown \"very very soon,\" an analyst said on Wednesday. Price targets for the S&P 500 have been edging lower. Adobe Firefly, Tyler Le/BIHSBC is the latest big bank to cut its outlook for stocks in 2025.Strategists said the risk of a potential recession and weak economic data are weighing on the outlook. Citi also downgraded its view of US stocks earlier this month on growth concerns.HSBC is the latest banking giant to sour on the outlook for US stocks this year.In a note to clients, strategists at HSBC Securities downgraded their rating of US stocks from \"overweight\" to \"neutral.\" It follows a similar move by Citi, which cut its rating of US stocks to \"neutral\" earlier this month.\"It is important to stress that we are not turning negative on US equities — but tactically, we see better opportunities elsewhere for now. Prevailing uncertainty around tariffs could see US equities remain challenged in the next few weeks, but we are hesitant to turn too cautious on the medium-term outlook,\" HSBC said wrote.Max Kettner, chief multi-asset strategist at the bank, told Bloomberg Television that he believes that the economy is going through a \"confidence and a sentiment shock.\"Kettner pointed to the growing risk of a looming economic slowdown, given recent weakness in economic survey data.For one, manufacturing looks to be on weak footing. Activity in the sector and expectations for future activity dropped for the second month in a row in March, while expectations for new orders and shipments also took a hit, according to the Philadelphia Fed's latest Manufacturing Business Outlook Survey. Federal Reserve Bank of Philadelphia/March 2025 Manufacturing Business Outlook SurveyExpectations for the job market are also falling. The Conference Board's Present Situation Index, which measures how consumers feel about the outlook for their income, business activity, and the labor market, fell to a level of 65.2, the lowest in 12 years, the Conference Board said.The Conference Board/NBERLevels for the index are well below the key threshold of 80, which has typically been consistent with recessions.\"But I do fear that we've seen too much damage, and especially too much broad-based damage in the survey and the broad-based data in order to dismiss it as a one-off,\" Kettner told Bloomberg on Wednesday. \"I don't think this will take three, four, five months. I don't think this is going to be a recession that is basically coming sometime in the second half. I do fear that we might get a pretty sharp slowdown in the data very early on, and very very soon,\" he added.In a note downgrading its outlook for US stocks earlier in March, Citi also cited growth concerns in their outlook for the market. Strategists, meanwhile, upgraded their rating on Chinese stocks from \"neutral\" to \"overweight,\" pointing to stronger growth expectations in the nation.\"In the big picture, US equity outperformance may well return when the AI narrative takes over again, but in the coming months, we expect US growth momentum to undershoot,\" the bank wrote.Meanwhile, Goldman Sachs, RBC, and Barclays have also trimmed their price targets for the S&P 500, reflecting more muted expectations for the US market after Wall Street entered 2025 on a wave of bullish sentiment boosted by Trump's policies. Read the original article on Business Insider",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-2948661221079584309",
        "title": "Adobe Stock Gets an Upgrade. It’s ‘Fairly Valued’ Now.",
        "url": "https://www.barrons.com/articles/adobe-stock-upgrade-value-d3e077de?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1742570280000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "2061474928614135838",
        "title": "Adobe gets upgrade at KeyBanc on limited downside",
        "url": "https://seekingalpha.com/news/4423380-adobe-gets-upgrade-at-keybanc-on-limited-downside",
        "site": "seekingalpha.com",
        "time": 1742561850000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3974821781848674551",
        "title": "Adobe Partner Perficient Invests In ‘Personalization At Scale’",
        "url": "https://www.crn.com/news/ai/2025/adobe-partner-perficient-invests-in-personalization-at-scale",
        "site": "crn.com",
        "time": 1742477700000,
        "favicon_url": "https://static.tickertick.com/website_icons/crn.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe partner Perficient leverages Firefly, AEP, CDP and other offerings from the vendor for the GenAI, AI future.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-2333630379374704461",
        "title": "Adobe Expands AI Model Partnerships",
        "url": "https://www.bloomberg.com/news/videos/2025-03-19/adobe-expands-ai-model-partnerships-video",
        "site": "bloomberg.com",
        "time": 1742416737000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "David Wadhwani, president of Adobe's Digital Media Business, says the company’s new AI products will allow it to deliver most free and paid tier options for users. He joins Caroline Hyde and Tim Stenovec on “Bloomberg Technology.\" (Source: Bloomberg)",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-8019611766932980056",
        "title": "Adobe previews AI generated PowerPoints from raw customer data with ‘Project Slide Wow’",
        "url": "https://venturebeat.com/ai/adobe-previews-ai-generated-powerpoints-from-raw-customer-data-with-project-slide-wow/",
        "site": "venturebeat.com",
        "time": 1742402750000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "The fate of Project Slide Wow depends on user interest and engagement, as Adobe monitors social media conversations. The fate of Project Slide Wow depends on user interest and engagement, as Adobe monitors social media conversations.Read More",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "463787086358243954",
        "title": "Adobe expects AI-driven ARR to double by end of fiscal 2025",
        "url": "https://seekingalpha.com/news/4422110-adobe-expects-ai-driven-arr-to-double-by-end-of-fiscal-2025",
        "site": "seekingalpha.com",
        "time": 1742389390000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-136676810466957432",
        "title": "Adobe on Mastering the Content Supply Chain: Tech Disruptors",
        "url": "https://www.bloomberg.com/news/audio/2025-03-19/adobe-on-mastering-the-content-supply-chain-tech-disruptors",
        "site": "bloomberg.com",
        "time": 1742385600000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "“For every knowledge worker, every business professional, an important element of what they do is creativity,” Anil Chakravarthy, Adobe’s Digital Experience president, tells Bloomberg Intelligence senior technology analyst Anurag Rana. On his third appearance on the Tech Disruptors podcast, Chakravarthy goes in depth on how Adobe is integrating its enterprise marketing tools, along with its creative-application portfolio. Additionally, Chakravarthy discusses the importance of the content supply",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1467904949837899202",
        "title": "Retailers, Airlines, and Banks Didn’t See This Coming — AI Is Sending Them a Flood of Customers",
        "url": "https://www.digitalinformationworld.com/2025/03/retailers-airlines-and-banks-didnt-see.html",
        "site": "digitalinformationworld.com",
        "time": 1742369400000,
        "favicon_url": "https://static.tickertick.com/website_icons/digitalinformationworld.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "According to new analysis by Adobe, the US retail stores that got traffic from generative AI during the holiday season are still continuing to get it in 2025. There was a 1300% increase in traffic from generative AI from November 1 to December 31 as compared to the holiday season in 2023. Adobe also found that there was a 1200% increase in traffic from generative AI in February 2025 as compared to July 2024. Generative AI is still new and even though the traffic from it is still less than from email or paid search, it is showing fast growth. 5,000 US adult consumers were surveyed by Adobe and it was found that 39% of the US consumers are using GenAI for online shopping, while 53% said that they will do it in 2025. It was also found that 55% are using AI for research while 47% are using it to seek product recommendations. Generative AI is also being used for seeking deals (43%), finding unique products (35%), getting gift ideas (35%), and creating shopping lists (33%) among US consumers. Another finding from Adobe’s study shows that generative AI generates more engaged traffic than other sources. Consumers who are directed by AI spend 8% more time on retail websites, browse 12% more pages per visit, and have a 23% lower bounce rate compared to traffic from social media, email, and paid search. Even though generative AI generates more engagements, there is a problem with its conversion rate with consumers using AI being 9% less likely to convert than from other sources. But this trend has also decreased since July 2024 which shows that users are slightly getting comfortable. In February 2025, sites related to travel, hospitality, and leisure saw a 1700% increase in traffic through generative AI, with 29% of consumers reporting using AI for travel planning and 84% using it to improve their experiences. Most of the users reported using AI for general research (54%), travel inspiration (43%), local food recommendations (43%,) and transportation planning (41%). There is a 45% lower bounce rate when a user lands on a travel site through AI. US banking sites also saw a 1200% increase in traffic from AI in February 2025 as compared to July 2024. The report also found that 27% of US consumers have also used generative AI for banking and financial tasks. The top tasks US consumers are using generative AI are seeking recommendations for checking and saving accounts (42%), creating personalized budgets (39%), asking for investment strategy explainers (40%), and understanding tax implications (35%). Read next: ChatGPT Mobile App Hits $100M Monthly Revenue, Setting Industry Record",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "2771809247147325109",
        "title": "Adobe’s new AI agents can make personal websites for your customers",
        "url": "https://venturebeat.com/ai/adobes-new-ai-agents-can-make-personal-websites-for-your-customers/",
        "site": "venturebeat.com",
        "time": 1742321370000,
        "favicon_url": "https://static.tickertick.com/website_icons/venturebeat.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe's new Brand Concierge feature lets customers create websites that respond to visitors with personalization. Adobe's new Brand Concierge feature lets customers create websites that respond to visitors with personalization.Read More",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-5802237676888729664",
        "title": "AI-Powered Shopping Growing Dramatically, Adobe Reports",
        "url": "https://www.forbes.com/sites/joanverdon/2025/03/17/ai-powered-shopping-growing-dramatically-adobe-reports/",
        "site": "forbes.com",
        "time": 1742212800000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "AI-driven traffic to U.S. ecommerce sites has been doubling every two months since September, and is generating increased engagement. AI-driven traffic to U.S. ecommerce sites has been doubling every two months since September, and is generating increased engagement.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "2427321444430342317",
        "title": "Malicious Adobe, DocuSign OAuth apps target Microsoft 365 accounts",
        "url": "https://www.bleepingcomputer.com/news/security/malicious-adobe-docusign-oauth-apps-target-microsoft-365-accounts/",
        "site": "bleepingcomputer.com",
        "time": 1742134769000,
        "favicon_url": "https://static.tickertick.com/website_icons/bleepingcomputer.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "3534964930039206931",
            "2146575517831950117",
            "2771809247147325109",
            "-8150959774848446570"
        ],
        "description": "Cybercriminals are promoting malicious Microsoft OAuth apps that masquerade as Adobe and DocuSign apps to deliver malware and steal Microsoft 365 accounts credentials. [...]",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1524276102786775932",
        "title": "Can Adobe Stock Fall To $200? - Adobe (NASDAQ; ADBE) recently announced its fiscal first quarter ...",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/03/14/can-adobe-stock-fall-to-200/",
        "site": "forbes.com",
        "time": 1741957386000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe (NASDAQ; ADBE) recently announced its fiscal first quarter results for the period ending February 2025, reporting earnings of $5.08 per share on revenues of $5.7... Adobe (NASDAQ; ADBE) recently announced its fiscal first quarter results for the period ending February 2025, reporting earnings of $5.08 per share on revenues of $5.7...",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1537878739857364074",
        "title": "Adobe's stock falls 12%+ after reporting a disappointing Q2 outlook and investor concerns that it is falling behind some rivals and losing its AI advantage (CNBC)",
        "url": "http://www.techmeme.com/250313/p35#a250313p35",
        "site": "techmeme.com",
        "time": 1741883101000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "CNBC: Adobe's stock falls 12%+ after reporting a disappointing Q2 outlook and investor concerns that it is falling behind some rivals and losing its AI advantage — Adobe shares dropped 13% following the company's quarterly earnings report, as investors fretted over lingering growth concerns …",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "1365356855303763523",
        "title": "Adobe shares drop 13% as concerns about AI growth overshadow better-than-expected results",
        "url": "https://www.cnbc.com/2025/03/13/adobe-adbe-q1-earnings-report-2025.html",
        "site": "cnbc.com",
        "time": 1741881105000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe shares fell on Thursday as investors fretted over lingering growth concerns and the company's artificial intelligence monetization strategy.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-2754367224932514081",
        "title": "Adobe slides on mixed guidance, but Gen-AI monetization provides upside",
        "url": "https://seekingalpha.com/news/4420331-adobe-slides-on-mixed-guidance-but-gen-ai-monetization-provides-upside",
        "site": "seekingalpha.com",
        "time": 1741874266000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-3129325871660213468",
        "title": "These Stocks Are Moving the Most Today: Intel, Nvidia, Adobe, Tesla, UiPath, SentinelOne, Dollar General, and More",
        "url": "https://www.barrons.com/articles/stock-market-movers-7339a877?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1741869960000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "8830781399865027358",
        "title": "Adobe's execs are trying to get their investors on the AI hype train with this new little nugget of intel",
        "url": "https://www.businessinsider.com/adobe-ceo-ai-arr-investors-earnings-annual-recurring-revenue-2025-3",
        "site": "businessinsider.com",
        "time": 1741859489000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Shantanu Narayen, Adobe's CEO, said the company plans to double its annual recurring revenue from AI by the year end.SAJJAD HUSSAIN/AFP via Getty ImagesOne number stood out in Adobe's earnings report: AI's annual recurring revenue.Investors are eyeing Adobe's ARR from AI as the company bets big on the technology.CEO Shantanu Narayen says Adobe plans to double its AI ARR by year-end.One number from Adobe's quarterly earnings on Wednesday caught investors' attention: annual recurring revenue from AI.At $125 million from the first quarter this year, it's a small slice of Adobe's $5.71 billion in total quarterly revenue. But analysts were quick to talk about the breakout number on Wednesday's earnings call.Shantanu Narayen, Adobe's CEO, said on the call that the company expects to double its AI ARR by the end of the financial year.\"Whether it is innovation, having our own models, integrating it across all of our products, brand new revenue streams like GenStudio in the enterprise and then usage and monetization, I feel really good about it,\" Narayen said on the call. The company said it expects revenue to increase to between $5.77 billion and $5.82 billion in the second quarter.Adobe's stock dipped 4.5% in after-hours trading, extending a rough year that has seen shares slide 23%, even as the S&P 500 climbed 8%.As AI spending surges, investors are watching closely to see if tech companies can turn big bets into real returns. Narayen said on the earnings call that future info on AI's ARR would be released \"periodically\" — not quarterly.In a research note ahead of earnings, Gregg Moskowitz, a managing director at Mizuho, wrote, \"Adobe is unquestionably a frustrating stock in 2024.\" He wrote that analysts remain optimistic that Adobe would successfully monetize its generative AI offerings and see strong growth in ARR and revenue guidance for the financial year.Equity analysts from Jefferies said in a report published on Sunday that chief information officers they surveyed expect their companies' spend on Adobe's creative software to accelerate in 2025.The surveys included 15 chief information officers and 40 end users. The report said that Adobe's AI offerings are \"competitive\" and that \"fears of AI reducing the need for Adobe may be overblown.\"Of end users surveyed, 65% told Jefferies their use of Adobe's creative software would increase within the next three years, while 50% evaluated Adobe's AI offerings \"as better than competitors.\"Adobe did not respond to a request for comment from Business Insider, sent outside business hours.Read the original article on Business Insider Shantanu Narayen, Adobe's CEO, said the company plans to double its annual recurring revenue from AI by the year end.SAJJAD HUSSAIN/AFP via Getty ImagesOne number stood out in Adobe's earnings report: AI's annual recurring revenue.Investors are eyeing Adobe's ARR from AI as the company bets big on the technology.CEO Shantanu Narayen says Adobe plans to double its AI ARR by year-end.One number from Adobe's quarterly earnings on Wednesday caught investors' attention: annual recurring revenue from AI.At $125 million from the first quarter this year, it's a small slice of Adobe's $5.71 billion in total quarterly revenue. But analysts were quick to talk about the breakout number on Wednesday's earnings call.Shantanu Narayen, Adobe's CEO, said on the call that the company expects to double its AI ARR by the end of the financial year.\"Whether it is innovation, having our own models, integrating it across all of our products, brand new revenue streams like GenStudio in the enterprise and then usage and monetization, I feel really good about it,\" Narayen said on the call. The company said it expects revenue to increase to between $5.77 billion and $5.82 billion in the second quarter.Adobe's stock dipped 4.5% in after-hours trading, extending a rough year that has seen shares slide 23%, even as the S&P 500 climbed 8%.As AI spending surges, investors are watching closely to see if tech companies can turn big bets into real returns. Narayen said on the earnings call that future info on AI's ARR would be released \"periodically\" — not quarterly.In a research note ahead of earnings, Gregg Moskowitz, a managing director at Mizuho, wrote, \"Adobe is unquestionably a frustrating stock in 2024.\" He wrote that analysts remain optimistic that Adobe would successfully monetize its generative AI offerings and see strong growth in ARR and revenue guidance for the financial year.Equity analysts from Jefferies said in a report published on Sunday that chief information officers they surveyed expect their companies' spend on Adobe's creative software to accelerate in 2025.The surveys included 15 chief information officers and 40 end users. The report said that Adobe's AI offerings are \"competitive\" and that \"fears of AI reducing the need for Adobe may be overblown.\"Of end users surveyed, 65% told Jefferies their use of Adobe's creative software would increase within the next three years, while 50% evaluated Adobe's AI offerings \"as better than competitors.\"Adobe did not respond to a request for comment from Business Insider, sent outside business hours.Read the original article on Business Insider",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "4622681732080517483",
        "title": "Biggest stock movers Thursday: INTC, ADBE, and more",
        "url": "https://seekingalpha.com/news/4420147-biggest-stock-movers-thursday-intc-adbe-and-more",
        "site": "seekingalpha.com",
        "time": 1741856407000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "5554388208332933217",
        "title": "Adobe Stock Slides Despite Earnings Beat. The CFO Is Confident About AI.",
        "url": "https://www.barrons.com/articles/adobe-earnings-stock-price-4d3801c7?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1741823520000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-2695326189150240030",
        "title": "Adobe’s stock has been an AI laggard. A ho-hum earnings forecast is adding to its declines.",
        "url": "https://www.marketwatch.com/story/adobes-stock-has-been-an-ai-laggard-a-ho-hum-earnings-forecast-is-adding-to-its-declines-dac50087?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1741813620000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe Systems Inc. shares fell in after-hours trading Wednesday after disappointing quarterly earnings guidance, amid criticism on Wall Street that the software company is not yet monetizing artificial intelligence.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "8623170139264036024",
        "title": "Adobe in charts: Digital Media revenue continues to improve in double-digits in FQ1",
        "url": "https://seekingalpha.com/news/4420060-adobe-in-charts-digital-media-revenue-continues-to-improve-in-double-digits-in-fq1",
        "site": "seekingalpha.com",
        "time": 1741812364000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "7223941610577838663",
        "title": "Adobe reports Q1 revenue up 10% YoY to $5.71B, vs. $5.66B est., Digital Media revenue up 11% to $4.23B, and issues a disappointing outlook for Q2 revenue growth (Brody Ford/Bloomberg)",
        "url": "http://www.techmeme.com/250312/p35#a250312p35",
        "site": "techmeme.com",
        "time": 1741812301000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Brody Ford / Bloomberg: Adobe reports Q1 revenue up 10% YoY to $5.71B, vs. $5.66B est., Digital Media revenue up 11% to $4.23B, and issues a disappointing outlook for Q2 revenue growth — Sales in the period ending in May will be $5.77 billion to $5.82 billion, the company said Wednesday in a statement.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3396907065936471484",
        "title": "Adobe tops Q1 estimates with 10% growth as outlook falls shy of expectations",
        "url": "https://seekingalpha.com/news/4419966-adobe-tops-q1-estimates-with-10-growth-as-outlook-falls-shy-of-expectations",
        "site": "seekingalpha.com",
        "time": 1741811759000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-1585142978593174926",
        "title": "Earnings Snapshot: Adobe tops FQ1 consensus, reaffirms FY25 targets",
        "url": "https://seekingalpha.com/news/4420013-earnings-snapshot-adobe-tops-fq1-consensus-reaffirms-fy25-targets",
        "site": "seekingalpha.com",
        "time": 1741811226000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "647206108305075758",
        "title": "Adobe Gives Tepid Revenue Outlook With Focus on AI Tools",
        "url": "https://www.bloomberg.com/news/articles/2025-03-12/adobe-gives-tepid-revenue-outlook-with-focus-on-ai-tools",
        "site": "bloomberg.com",
        "time": 1741810665000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "5060216963140847151"
        ],
        "description": "Adobe Inc. gave a disappointing outlook for revenue growth in the current quarter despite a recent focus on monetizing its new generative artificial intelligence features. Adobe headquarters in San Jose, California.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "4402992740295044137",
        "title": "The Estée Lauder Companies partners with Adobe to scale digital marketing production using Firefly generative AI",
        "url": "https://seekingalpha.com/news/4419819-the-este-lauder-companies-partners-with-adobe-to-scale-digital-marketing-production-using-firefly-generative-ai",
        "site": "seekingalpha.com",
        "time": 1741785915000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3430310119116303264",
        "title": "These Stocks Are Moving the Most Today: Nucor, Alcoa, Intel, Tesla, Super Micro, Stitch Fix, Adobe, and More",
        "url": "https://www.barrons.com/articles/stock-market-movers-f739509d?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1741772100000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "8848119369238074150",
        "title": "How Adobe Stock Might React To Upcoming Earnings?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/03/10/how-adobe-stock-might-react-to-upcoming-earnings/",
        "site": "forbes.com",
        "time": 1741612092000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "adbe"
        ],
        "similar_stories": [
            "-4710386242965858787"
        ],
        "description": "Adobe (NASDAQ:ADBE) is set to report its earnings on Thursday, March 13, 2025. The company has $198 Bil in current market capitalization. Adobe (NASDAQ:ADBE) is set to report its earnings on Thursday, March 13, 2025. The company has $198 Bil in current market capitalization.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-4484949641120565767",
        "title": "Adobe in spotlight as Citi sees 'mixed' Q1 amid recent software weakness",
        "url": "https://seekingalpha.com/news/4418875-adobe-in-spotlight-as-citi-sees-mixed-q1-amid-recent-software-weakness",
        "site": "seekingalpha.com",
        "time": 1741609359000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "adbe"
        ],
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "1407196831847445261",
        "title": "Inflation and tariffs might scare shoppers. Have they scared CEOs?",
        "url": "https://www.marketwatch.com/story/inflation-and-tariffs-might-scare-shoppers-have-they-scared-ceos-0e5c199f?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1741517940000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Executives are talking a lot about tariffs, but little about a recession. Adobe, Oracle and more retailers report during the week.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-8601321243129083140",
        "title": "Cramer's week ahead: New inflation data, earnings from Oracle and Adobe",
        "url": "https://www.cnbc.com/2025/03/07/cramers-week-ahead-new-inflation-data-earnings-from-oracle-and-adobe.html",
        "site": "cnbc.com",
        "time": 1741392453000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "CNBC's Jim Cramer told investors what to look for on Wall Street next week.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-7321361619002969391",
        "title": "Sources: Figma has met with banks in recent weeks to discuss an IPO that could come as soon as 2025; EU and US regulators stymied its $20B sale to Adobe in 2023 (New York Times)",
        "url": "http://www.techmeme.com/250307/p18#a250307p18",
        "site": "techmeme.com",
        "time": 1741385701000,
        "favicon_url": "https://static.tickertick.com/website_icons/techmeme.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "New York Times: Sources: Figma has met with banks in recent weeks to discuss an IPO that could come as soon as 2025; EU and US regulators stymied its $20B sale to Adobe in 2023 — The design tech company is exploring a public offering after regulators stymied its $20 billion sale to the software giant Adobe in 2023.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "3698272396109363389",
        "title": "Figma in Talks With Bankers to Explore an I.P.O. This Year",
        "url": "https://www.nytimes.com/2025/03/07/technology/figma-ipo.html",
        "site": "nytimes.com",
        "time": 1741385060000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "The design tech company is exploring a public offering after regulators stymied its $20 billion sale to the software giant Adobe in 2023. Dylan Field, Figma’s chief executive, said at a conference last year that the company is on a path to going public.",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "-3774629723131231584",
        "title": "Investors are acting like recession may strike",
        "url": "https://www.businessinsider.com/stock-market-recession-selloff-russell-small-caps-treasury-yields-economy-2025-3",
        "site": "businessinsider.com",
        "time": 1741294622000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "The S&P 500 and the small-cap Russell 2000 have plunged. As risk appetite fades, yields have come down amid rising calls for a 2025 US recession. Adobe Firefly, Tyler Le/BIGrowth fears are on the rise, causing markets to trade as if a recession is coming.Major US indexes are in the red this year, with growth-sensitive sectors hit the hardest.Bond yields are falling as investors eye lower interest rates in response to a recession. It wasn't long ago when economists predicted the odds of a 2025 recession were zero. How the times have changed.The stock market's jubilant mood coming into this year has been flipped on its head, as a surge of growth fears has slashed investor optimism. Forecasts for more record highs have been replaced by fears of a sputtering US economy. Policy decisions coming out of the White House are generating intense uncertainty. Constant back-and-forth decisions on tariffs have unleashed chaos in markets, while investors fear a prolonged trade war will send the US economy into a slump. The GDPNow Tracker from Atlanta's Fed has adjusted considerably since earlier this year and now estimates first-quarter real GDP at a negative 2.4%.Here's how recent market moves show investors may be breaking out the recession playbook. The wipeout in the S&P 500 US indexes have been caught in a brutal sell-off as risk appetite plummets. The benchmark S&P 500 continues to grind lower, trading back at levels not seen since November. The index has shed nearly 7% since a mid-February peak, wiping out its entire postelection gain and pushing it into negative territory for the year.Rising uncertainty around the impacts of President Donald Trump's protectionist trade agenda has investors fleeing risk-assets, and the decline has intensified amid a rise in talk of a recession and even a bout of stagflation as growth dwindles and inflation remains high.Thursday's session brought more pain. The index was down over 2% in afternoon trading, recovering only slightly as Trump announced another monthlong pause on tariffs on most goods from Canada and Mexico. Small-cap slumpThe same story can be seen among small-cap shares in the Russell 2000. Smaller companies are typically more sensitive to shifting growth dynamics given they're often more debt-dependent and have a smaller cash pile to fall back on when the economy turns. The threat of higher import costs from tariffs is also no joke for smaller firms, and industry leaders have spoken out against the risk Trump's trade policy poses to their businesses. The Russell 2000's 7% year-to-date drop has outpaced the declines in major indexes and is now about 16% below its November peak.Though some warned that the postelection small-caps rally would not last, analysts saw a bull case forming in this corner of the market last year. Hope for lower interest rates and expectations for a broadening of the market rally stoked excitement for the sector.Plummeting bond yieldsWhile stock market sentiment may wax and wane on abrupt changes to trade policy these days, observers should watch the bond market for real clues about what investors are thinking. US Treasurys ultra-safe reputation means they're a safe haven in times of volatility. Bond yields fall as prices rise, and the 10-year has plunged from January highs of 4.8% in early January to around 4.2% on Thursday. But the race into Treasurys might also highlight growing expectations for the Federal Reserve to cut interest rates, which the central bank would do to stimulate the economy in the face of a recession. According to CME FedWatch data, as many as three quarter-point rate cuts are expected by the end of the year, a sudden jump from just one cut priced in about a month ago as traders saw high inflation making the Fed reluctant to loosen financial conditions any further. 10-year yields rose slightly on Thursday by about two basis points, as another delay in tariffs relieved some of the buying pressure.Read the original article on Business Insider",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "7025409058054630104",
        "title": "Graphic Designers and Content Creators See Profitable Freelance Careers, US and Australia Lead Pay Rates",
        "url": "https://www.digitalinformationworld.com/2025/03/graphic-designers-and-content-creators.html",
        "site": "digitalinformationworld.com",
        "time": 1741278600000,
        "favicon_url": "https://static.tickertick.com/website_icons/digitalinformationworld.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "A recent study from Adobe talks about rates of freelancers and content creators working in different geographical locations, which skills are in demand, and which pay the most. According to the study, graphic design and content creation have high profit jobs, with graphic designers having a $49.65 hourly rate and short-form content creation having a $50.62 hourly rate on average. The annual salary of a freelance graphic designer is $92.5K and $94.3K for a freelance short-form content creator on average. One in four U.S.-based freelancers can also earn $100,000 and more annually, while only 20% do so in Australia. Freelance graphic designers earn the most in Australia while short-form content creators earn the highest in the US, while the freelancers in the UK charge comparatively lower rates. The most common freelance graphic design skills that are in demand are logo design (40%), Adobe Illustrator (37%), Adobe Photoshop (35%) and Adobe InDesign (18%). On the other hand, TikTok (29%), Video Editing (23%), Content Creation (22%) and Adobe Premiere Pro (18%) are the most common in-demand skills for freelance short-form video creators. Related: Top Skills for 2025: AI, Web Development, and Marketing Expertise in High DemandThere is also a small gender gap when it comes to rates for men and women who are freelancing as graphic designers or content creators. Women graphic designers tend to earn a bit higher ($51.12 hourly) than men graphic designers ($47.55) when it comes to freelancing. Similarly, the hourly rate for women short-form content creators is $53.88 on average while men get paid $46.38 on average hourly. Men in the US have 43 more jobs on average as compared to women on Upwork, while women working freelance in Australia have 4 more jobs on average than men. 24% of men and 26% of women on Upwork are earning more than $100,000 annually through freelancing.Read next: New Study Says More Than 50% of American Workers Worry About the Impact of AI on Their Jobs",
        "tickers": [
            "adbe"
        ]
    },
    {
        "id": "9030205321910034439",
        "title": "Social Media Trends Across Countries: Who Posts, Who Engages, and What Drives Users?",
        "url": "https://www.digitalinformationworld.com/2025/03/social-media-trends-across-countries.html",
        "site": "digitalinformationworld.com",
        "time": 1741213800000,
        "favicon_url": "https://static.tickertick.com/website_icons/digitalinformationworld.com.ico",
        "tags": [
            "adbe"
        ],
        "description": "Adobe recently surveyed 1010 social media users from six different countries to find out what their social media habits are and how they differ from each other. According to the survey, Instagram is the top social media platform for users across the globe. It is followed by Facebook, X, TikTok and YouTube. People from Mexico prefer Instagram and X the most, while people from South Africa prefer Facebook and TikTok the most. YouTube is most preferred in Germany, followed by Mexico and the US. According to the study, people spend 2.3 hours on average per day on social media, with South Africa spending the most hours on social media per day (3.5 hours). 42% of the participants said that they spend less than one hour on social media, while 35% spend 1-2 hours and 16% spend 3-4 hours. 7% of the participants said that they spend more than 4 hours on social media daily. When participants were asked how they feel when they cannot access social media, they answered with boredom (53%), FOMO (22%) and loveliness (14%). Gen-Z were most affected when they cannot have access to social media and 14% of the participants overall said that they rely on social media for their mental well being.The study also examined the global posting trends on social media and found that users from South Africa post the most per day on social media, with average 3.3 posts. 11% users from South Africa, 10% from Mexico and 8% from the US also reported posting more than 5 posts per day on social media. 41% of the users post images the most on social media, followed by text (31%), stories (19%) and videos (10%). 43% of the participants said that afternoon is the best time to share posts while 32% favored evening posts and 16% favored morning posts. Sharing personal experiences (73%), staying connected with friends and families (56%) and relieving boredom (38%) were some primary motivations for participants to post on social media. 2 in 3 participants of the survey said that they don't like using filters on their social media posts. The participants who use filters reported using filters like The Glow (25%), Lo-Fi (23%) and Valencia (21%). Overall, 20% of the participants said that they find other people liking and commenting on their posts important, while 37% said that they have deleted a post before because it didn't have sufficient engagement. Read next: Consumers Are Hitting ‘Unsubscribe’, Here’s Why Brands Are Losing Them",
        "tickers": [
            "adbe"
        ]
    }
]