[
    {
        "id": "291672388062565746",
        "title": "Women’s Soccer Set To Be Fifth Most Popular Sport In The World By 2030",
        "url": "https://www.forbes.com/sites/asifburhan/2025/06/17/womens-soccer-set-to-be-fifth-most-popular-sport-in-the-world-by-2030/",
        "site": "forbes.com",
        "time": 1750146334000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "A new report by Nielsen Sports and PepsiCo suggests that women’s soccer is on course to reach 800 million fans by 2030 and become the fifth biggest sport in the world. A new report by Nielsen Sports and PepsiCo suggests that women’s soccer is on course to reach 800 million fans by 2030 and become the fifth biggest sport in the world.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-4958822551073569419",
        "title": "Frito-Lay shutting down production at Southern California plant",
        "url": "https://seekingalpha.com/news/4457741-frito-lay-shutting-down-production-at-southern-california-plant",
        "site": "seekingalpha.com",
        "time": 1749754246000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-2360057933881550406",
        "title": "Addison Rae’s New Hit Single Brings Several Other Recent Wins With It",
        "url": "https://www.forbes.com/sites/hughmcintyre/2025/06/12/addison-raes-new-hit-single-brings-several-other-recent-wins-with-it/",
        "site": "forbes.com",
        "time": 1749735957000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Addison Rae scores her fifth U.K. hit as “Fame Is a Gun” debuts at No. 27 on the Official Singles chart, while \"Headphones On\" rises and \"Diet Pepsi\" returns. Addison Rae scores her fifth U.K. hit as “Fame Is a Gun” debuts at No. 27 on the Official Singles chart, while \"Headphones On\" rises and \"Diet Pepsi\" returns.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-1865946147567577936",
        "title": "10 dividend stocks to watch ahead of this week's inflation reports | $DVY $IBM $CSCO $PEP $TXN",
        "url": "https://seekingalpha.com/news/4456967-10-dividend-stocks-to-watch-ahead-of-this-weeks-inflation-reports",
        "site": "seekingalpha.com",
        "time": 1749578069000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "7997346148919345728",
        "title": "Ex-Dividend Reminder: Molson Coors Beverage, PepsiCo And Genuine Parts",
        "url": "https://www.forbes.com/sites/dividendchannel/2025/06/04/ex-dividend-reminder-molson-coors-beverage-pepsico-and-genuine-parts/",
        "site": "forbes.com",
        "time": 1749048665000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "On 6/6/25, Molson Coors Beverage, PepsiCo, and Genuine Parts will all trade ex-dividend for their respective upcoming dividends On 6/6/25, Molson Coors Beverage, PepsiCo, and Genuine Parts will all trade ex-dividend for their respective upcoming dividends",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "3118996726448088186",
        "title": "Doritos, M&Ms Could Be Forced to Include Warning Labels in Texas",
        "url": "https://www.bloomberg.com/news/articles/2025-06-02/doritos-m-ms-could-be-forced-to-include-warning-labels-in-texas",
        "site": "bloomberg.com",
        "time": 1748905491000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "A Texas bill on the verge of becoming law would require labels on packaged food from Skittles to Mountain Dew that warn about ingredients “not recommended for human consumption” by other countries.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "265993096182764955",
        "title": "Rays Held Yard Sale Before ‘Turning Over Keys’ To Tropicana Field For Roof Repairs",
        "url": "https://www.forbes.com/sites/tomlayberger/2025/06/01/rays-held-yard-sale-before-turning-over-keys-to-tropicana-field-for-roof-repairs/",
        "site": "forbes.com",
        "time": 1748831556000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Against the backdrop of a roofless Trop, fans browsed tables full of caps, t-shirts, bobbleheads and other giveaways from 28 seasons of Tampa Bay Rays baseball. Against the backdrop of a roofless Trop, fans browsed tables full of caps, t-shirts, bobbleheads and other giveaways from 28 seasons of Tampa Bay Rays baseball.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-7244066223254646744",
        "title": "Tariff Rulings, Fannie-Freddie, FTC v. Pepsi: Votes and Verdicts",
        "url": "https://www.bloomberg.com/news/audio/2025-05-30/tariff-rulings-fannie-freddie-ftc-v-pepsi-votes-and-verdicts",
        "site": "bloomberg.com",
        "time": 1748595600000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Court rulings on May 28 and 29 deeming unlawful US tariffs on China, Canada and Mexico and reciprocal tariffs — with ramifications for retailers like Nike, automakers such as Ford, tech companies including Apple, and other sectors — are among the key catalysts Bloomberg Intelligence litigation and policy analysts are watching this week. The team also discussed President Donald Trump’s social-media posts about Fannie Mae and Freddie Mac and the complexities of exiting conservatorship and governme PepsiCo Inc Photographer: SeongJoon Cho/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "1075766447552957729",
        "title": "PepsiCo defeats lawsuit over Flamin' Hot Cheetos invention claim",
        "url": "https://seekingalpha.com/news/4453722-pepsico-defeats-lawsuit-over-flamin-hot-cheetos-invention-claim",
        "site": "seekingalpha.com",
        "time": 1748584699000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "8999414705642915979",
        "title": "Buy, Sell, Or Hold PepsiCo Stock At $130?",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/05/29/buy-sell-or-hold-pepsico-stock-at-130/",
        "site": "forbes.com",
        "time": 1748514632000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "This drop can be linked to poor consumer sentiment and spending, further affected by the company's mixed Q1 results, where revenue slightly... This drop can be linked to poor consumer sentiment and spending, further affected by the company's mixed Q1 results, where revenue slightly...",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-5092045913311311942",
        "title": "How Olipop CEO Ben Goodwin built a brand new kind of soda brand",
        "url": "https://www.fastcompany.com/91342002/how-olipop-ceo-ben-goodwin-built-a-brand-new-kind-of-soda-brand",
        "site": "fastcompany.com",
        "time": 1748512800000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "pep"
        ],
        "description": "eOlipop’s surging popularity has taken the $60 billion soda industry by storm. As Gen Z and millennials ditch sugary sodas, Olipop is leading the pre-biotic beverage trend, sparking the likes of Coca Cola and PepsiCo to enter the fray. Olipop co-founder, CEO and formulator, Ben Goodwin, shares how the brand is navigating the turbulence of rapid growth amid rising competition, and whether healthy soda is actually healthy or just a TikTok-fueled fad.This is an abridged transcript of an interview from Rapid Response, hosted by the former editor-in-chief of Fast Company Bob Safian. From the team behind the Masters of Scale podcast, Rapid Response features candid conversations with today’s top business leaders navigating real-time challenges. Subscribe to Rapid Response wherever you get your podcasts to ensure you never miss an episode. So for folks who are less familiar, Olipop’s known as a functional soda. What does that mean? What is a prebiotic soda versus a probiotic soda? Give us the landscape. Soda itself has a really, really interesting, very deep history. It goes back a couple hundred years. There’s Middle East roots, there’s European roots. So in the U.S., obviously full-sugar soda in a myriad of forms existed for many, many decades, especially starting in the late 1800s. It actually wasn’t until 1943 that the federal government stepped in and told Coke and Pepsi and Dr. Pepper that they could no longer call soda “healthy.” That’s how long it was they were saying that it was healthy, even though, by that time, it was loaded with caffeine and sugar. And then in the ’60s and ’70s, and then really peaking in the ’80s, you had diet soda come in, and that was this awareness that, “Hey, all the sugar’s not great for you. Let’s go with these kind of artificial sweeteners.” And it’s been that two-horse race for a really long time. Ben Goodwin [Photo: Olipop] Functional soda, which I am fortunate enough to effectively have been the one that created the category and I’ve been working on it since about 2010, is basically this idea that soda can actually be health-contributing. I was looking at the evolution of the science around digestive and microbiome health and decided that this kind of nutritional intervention was, I thought, actually a superior strategy. The base of our nutritional pillars are fiber, prebiotics, and nutritional diversity. So sometimes when I hear people say, “The prebiotic soda category,” I’m like, “Well, that’s true, but that’s just part of the story,” because a lot of the other competitors that have come into the space are just looking to capitalize for the most part on a trend, but it only is actually technically a part of what we offer. The health benefits, not everyone’s on board about them. There have been some class-action lawsuits, not about your claims, but about claims from others. Is Olipop actually healthy for me, or is it just better for me than traditional soda? I’m actually so grateful that you asked that question. I don’t want to wade into trash-talking territory here, but I do think a lot of the other entrants, they’ve either got a really small amount of total fiber or they’re putting some of that fiber in and it’s not even stable in their product. You really want a blend of different high-quality prebiotics. It’s how you get to the best outcome. That’s at least my formulation philosophy. Olipop is actually healthy. We have done multiple in vitro clinical trials now at Purdue. We’ve a partnership with their stability lab, we’ve a partnership with their complex carbohydrates laboratory, and we’ve looked at microbiome and digestive health outputs. We saw incredible bifidogenesis. We saw the fermentation of multiple forms of short-chain fatty acids. And then we just finished our first pilot human clinical trial, and we were looking at blood sugar stability and blood sugar response. And basically, of the folks that we studied, it kept their blood sugar stable for a full three hours. [Photo: Rob Kim/Getty Images for NYCWFF] So if you start stabilizing people’s blood sugar response, you start benefiting their digestive health microbiome outputs. I don’t know exactly what level of data most people need to classify something as healthy, but I’d say that certainly meets my criteria. My goal is to say, “Health and wellness should be actually contributing to your health and wellness,” and you should have some empirical data to validate that. If you’re going to ask consumers to spend a premium, you want to know that you’re actually giving them real outcomes for what they’re spending. You mentioned how fast your business has been growing, and it’s one of the fastest-growing U.S. beverage brands ever. You recently raised funds that, I don’t know, around a $2 billion valuation, but you do have this intense competition, right? Poppi, which is known for these Super Bowl ads, that was recently acquired by PepsiCo for just under $2 billion. Coca-Cola’s launched Simply Pop. How much does that change the game when the big players step in? I really want to see this category live up to its full potential. You’ve got soda, which is a $60 billion, 98% household penetration market in the United States. If we can do good in that category and use that as a kind of a Trojan horse to drive healthy outcomes for people, it’s really powerful. In terms of big players entering the space, to be honest with you, I think it’s fantastic. Some of the largest brands and the largest players in the soda and beverage space in the world getting into your category goes a long way to massively validate what you’re doing. And so hats off to Poppi. I know that getting out, selling their business was really important to them. Coke as well getting involved. It’s like, to be honest with you, it’s a bit of an honor. One of your investors is Indra Nooyi, the former PepsiCo CEO. I imagine that PepsiCo may have approached you at the same time as they did Poppi. I don’t know. Do you consider tying up with a bigger place? Look, I mean, I can’t really speak to that with a lot of detail. I don’t want to be overly coy in terms of Olipop does need to create a liquidity event, right? The reality is we’ve taken on investor capital, you just pointed to that, that was our final round into the business. We’re very, very fully profitable and really liquid, pun intended, but we have raised investor capital, which means you need to generate a liquidity event. There’s multiple ways that you can go through M&A, there’s obviously IPO going public, and so that is where right now—we’re just preserving optionality. I mentioned Poppi’s Super Bowl ad earlier. They spent, I don’t know, $16 million on a one-minute spot. Oh, more than that, yeah. You didn’t make that investment, and, instead, you teased them for their spending on social media, which they then called online bullying. Is that kind of back-and-forth with them, is that strategic? Is that what customers want from brands? You’re laughing. Yeah, I have no idea. The online bullying thing is really good. It’s really good. First of all, there’s a difference between the stuff that I personally authorize, and sometimes the stuff that the social media team decides that they want to get up to. And that was a moment where, to be honest with you, there was a little bit of a gap. I was actually at a friend’s wedding in Puerto Rico. I was not the one hitting send on the whatever platform it is that we were commenting on. But at the same time, I understand where the consumers were coming from, which is we do live in a time with an enormous amount of income inequality. Whatever it was about how Poppi showed up, that hit a nerve for a lot of people. They made their own voices heard. I don’t need to add to that conversation. Our team did say a couple things, but then they stopped, and that’s good because they probably would’ve been fired if they hadn’t, and we just went on with their lives. But yeah, I think that we don’t spend the same amount of money on marketing that Poppi does. I’m okay with that because a lot of what has driven our business has been organic demand and organic word-of-mouth. That is real, sustainable growth that we’re experiencing, and I’m really proud of that. And as long as you can continue to grow the business like that, you should. I think that we will probably have increase in spend in marketing as we go, but it’s okay for us as brands to have different strategies in terms of how we approach growth.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "140276930606382103",
        "title": "In-house agencies navigate a new phase of purpose and pressure",
        "url": "https://digiday.com/marketing/the-fragile-promise-of-in-house-agencies-meets-economic-reality/?utm_campaign=digidaydis&utm_medium=rss&utm_source=general-rss",
        "site": "digiday.com",
        "time": 1748491260000,
        "favicon_url": "https://static.tickertick.com/website_icons/digiday.com.ico",
        "tags": [
            "pep"
        ],
        "description": "The fragile promise of in-house agencies meets economic reality. When the economy turns sour, marketers are the first in their businesses to taste it, especially the ones on in-house teams. Just last month, PepsiCo reportedly handed off parts of its internal creative studio to VaynerMedia, prompting some staff exits. Weeks later, Keurig Dr Pepper pulled the plug on its in-house creative team entirely, according to Ad Age. And this may just be the start. Continue reading this article on digiday.com. Sign up for Digiday newsletters to get the latest on media, marketing and the future of TV.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "6405938229956262225",
        "title": "FTC Nixes Antitrust Lawsuit Against PepsiCo Over Pricing",
        "url": "https://www.bloomberg.com/news/articles/2025-05-22/ftc-nixes-antitrust-lawsuit-against-pepsico-over-pricing",
        "site": "bloomberg.com",
        "time": 1747948403000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo Inc. scored a major legal victory Thursday after the three members of the US Federal Trade Commission voted unanimously to dismiss an antitrust lawsuit that was filed at the very end of the Biden Administration. A worker arranges bottles of Pepsi on a shelf at a supermarket in Clifton Park, New York, US, on Friday, Feb. 2, 2024. PepsiCo Inc. is scheduled to release earnings figures on February 9.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-3131249118588400721",
        "title": "PepsiCo officially adds Poppi to its brand portfolio as it looks to M&A for growth",
        "url": "https://seekingalpha.com/news/4450081-pepsico-officially-adds-poppi-to-its-brand-portfolio-as-it-looks-to-ma-for-growth",
        "site": "seekingalpha.com",
        "time": 1747664188000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "6404178087148479827",
        "title": "PepsiCo signs multi-year contract with AWS",
        "url": "https://www.datacenterdynamics.com/en/news/pepsico-signs-multi-year-contract-with-aws/",
        "site": "datacenterdynamics.com",
        "time": 1747134532000,
        "favicon_url": "https://static.tickertick.com/website_icons/datacenterdynamics.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Part of company's cloud first strategy",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-8914836203040002565",
        "title": "If you happen to have a tattoo of the Mountain Dew logo, we have some great news for you",
        "url": "https://www.fastcompany.com/91332680/mountain-dew-logo-contest-vegas-trip",
        "site": "fastcompany.com",
        "time": 1747128600000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "pep"
        ],
        "description": "The odds of winning the lottery are about one in 300 million. If you have a tattoo of an old Mountain Dew logo on your body, your odds of winning Mountain Dew’s new sweepstakes are much, much higher. The soda’s owner, PepsiCo, is launching the contest to celebrate Mountain Dew’s new logo hitting store shelves. It’s asking people who have a tattoo of the old Mountain Dew logo to upload a photo to social media and tag Mountain Dew for a chance to win a trip for two to Las Vegas to get a tattoo of the new logo. Last year, Mountain Dew retired its jagged, abbreviated “Mtn Dew” logo introduced in 2009 for a new logo that spells out the citrus soda brand’s entire name. If the old visual identity was styled in the fashion of Y2K-era extreme sports and gaming, the new one was designed to look modern, outdoorsy, and retro-inspired. The new brand mascot, “Mountain Dude,” wears long hair, aviators, and a green fur coat to convey its new brand persona. The contest is a bid to promote the rebrand with the drink’s most devoted fans: people who love Mountain Dew so much they already made it permanent. Entrants just have to post a photo of their tattoo with the hashtag #DoTheDewTattooSweepstakes on Instagram or X—and no cheating, since tattoos have to be from before May 6, 2025, when the contest began. PepsiCo estimates there are “hundreds” of people with the old logo, though a cursory search shows just five accounts have posted photos of old Mountain Dew logo tattoos. The contest will award five winners, so if you’re a legal U.S. resident of one of the 50 states or Washington, D.C., and at least 21 years old with an old Mountain Dew logo tattoo, you could likely win one of the sweepstakes prizes: round-trip flights for two to Las Vegas, a three-night’s stay at the Mandalay Bay luxury resort and casino, and some spending money ($500 for fun and $900 in credits for food and beverage). Who is getting this tattoo? Getting a logo tattoo is a high-commitment act of loyalty to a brand, but companies have found plenty of willing fans to trade their skin for prizes. There were 381 people who agreed to get Domino’s logo tattooed on their bodies to win a “100 pizzas a year for 100 years” promotion in Russia in 2019, and Subway awarded as many as nine winners to get tattoos to win free sub sandwiches in 2022. For Mountain Dew, though, it’s latest promotion is all about fan service and the love of the game. It’s not handing out free cases of soda in return for getting a tattoo like brands have done before. Instead it’s rewarding people who already had tattoos of the logo. It’s a branding stunt, sure. But it’s also a brand heritage play, since it’s all about past iterations of the logo. Should winners feel attached to their current Dew tattoo, the sweepstakes fine print is on their side: Instead of getting inked with the new Mountain Dew logo, they can just pocket the $2,000.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-2375935541970471505",
        "title": "Dividend Roundup: Eli Lilly, Pepsico, Ford, Delta Air Lines, and more | $F $PEP $LLY $DAL $VLO",
        "url": "https://seekingalpha.com/news/4445637-dividend-roundup-eli-lilly-pepsico-ford-delta-air-lines-and-more",
        "site": "seekingalpha.com",
        "time": 1746789853000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-2802432207000622949",
        "title": "Tropicana Debt Deal Casts Light on Rampant Creditor Warfare",
        "url": "https://www.bloomberg.com/news/newsletters/2025-05-09/private-equity-owned-firms-are-turning-creditors-into-winners-and-losers",
        "site": "bloomberg.com",
        "time": 1746788777000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "There’s a civil war festering in private credit. PepsiCo Inc. Tropicana brand orange juice is arranged for a photograph in Tiskilwa, Illinois, U.S., on Wednesday, Sept. 28, 2016. PepsiCo Inc. is scheduled to release earnings on September 29. Photographer: Daniel Acker/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-3764161783990904725",
        "title": "How Amazon and Walmart Are Rewiring Retail’s Future With Robotics",
        "url": "https://www.pymnts.com/news/retail/2025/how-amazon-and-walmart-are-rewiring-retails-future-with-robotics/",
        "site": "pymnts.com",
        "time": 1746730334000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Competition comes best in twos. Think Apple and Microsoft, Coke and Pepsi, McDonald’s and Burger King and many other famous pairings. It’s because a dose of healthy competition ultimately benefits the end consumer, and nowhere can this be seen more clearly than in the ongoing battle between retail titans Walmart and Amazon. The two mega […] The post How Amazon and Walmart Are Rewiring Retail’s Future With Robotics appeared first on PYMNTS.com. Competition comes best in twos. Think Apple and Microsoft, Coke and Pepsi, McDonald’s and Burger King and many other famous pairings. It’s because a dose of healthy competition ultimately benefits the end consumer, and nowhere can this be seen more clearly than in the ongoing battle between retail titans Walmart and Amazon. The two mega retailers have evolved far beyond price wars and delivery speed, although those twin pillars remain key goals, and competition today plays out across artificial intelligence (AI), automation and robotics, and omnichannel ecosystems. It can frequently result in new strategies that have the potential to redefine the very fabric of commerce. Robotics Come to Life for Retail Operations Amazon continues to push the boundaries of robotic technology with the introduction on Wednesday (May 7) of Vulcan, a fulfillment center robot and Amazon’s first robot equipped with a sense of touch. It can handle approximately 75% of warehouse items, including those that are oddly shaped or fragile, and operates up to 20-hour shifts, assisting human workers by managing tasks that involve reaching high or low shelves, thereby reducing physical strain on employees. The announcement followed reports from February that Amazon aims to glean savings from its robotics efforts as it increases spending on AI. Amazon has deployed over 750,000 robots across its fulfillment centers, including autonomous mobile robots like Proteus and robotic arms such as Robin and Cardinal. These systems are integrated with AI to enhance efficiency and safety in operations And while Amazon is launching robots that can feel, Walmart is turning to machines that can build. In a literally groundbreaking move, Walmart partnered with Alquist 3D to construct a 5,000-square-foot warehouse extension in Huntsville, Alabama, using robotic 3D printing technology. Completed in just seven days with a five-person crew, the project underscores the commitment of large retailers to leveraging automation to address labor shortages and accelerate construction timelines. Retail Footprints Still Matter Both companies are building for the future. In the U.S., Walmart has unveiled its first new Supercenter in Cypress, Texas, after a four-year hiatus — a 170,000-square-foot “Store of the Future” that blends physical retail with digital innovation. This flagship location is part of a broader plan to build or convert over 150 stores and remodel 650 more, integrating features like expanded departments, private pharmacy screening rooms, and enhanced online pickup and delivery services. Also in the U.S, Walmart is reinforcing its dedication to American manufacturing through initiatives like the “Grow with US” program, designed to assist small businesses in navigating the complexities of retail. These efforts align with Walmart’s pledge to invest an additional $350 billion in U.S.-made products by 2030, aiming to bolster domestic supply chains and create job opportunities. The focus on domestic goods also comes against a backdrop where U.S. tariffs are throwing global supply chains into disarray. Looking abroad, Amazon Web Services (AWS) announced a $4 billion investment to establish its first data centers in Chile, marking its third cloud region in Latin America. This expansion aims to support services like generative AI while addressing environmental concerns through innovative cooling technologies and a commitment to renewable energy. Additionally, Amazon’s latest Alexa+ voice assistant has reached 100,000 users, reflecting the company’s commitment to integrating AI into everyday consumer interactions. Innovating Across an Omnichannel Landscape Consumers expect a future where personalized recommendations, seamless transactions, and rapid fulfillment become standard. And as Amazon’s recent partnership involves delivering pet prescriptions, that promise extends even to Fluffy and Fido and other household pets. For both pets and people, data is becoming table stakes for building better experience. For example Sam’s Club, a Walmart subsidiary, is transforming its Member Access Platform (MAP) into a comprehensive “Retail Experience Network.” By introducing tools like Brand Lift, Customer Lifetime Value measurement, and AI-powered Propensity Modeling, Sam’s Club enables brands to create personalized, omnichannel campaigns that resonate with members both online and in-store. Ultimately, in the intensifying battle for retail dominance, Amazon and Walmart are accelerating innovation across the omnichannel frontier, blending digital convenience with physical presence in ways that reshape consumer expectations. Both giants are converging on a future where retail is channel-agnostic, delivery is instantaneous, and the shopping journey is seamlessly personalized. The arms race is less about stores vs. screens — and more about who can turn both into a single, intelligent system. The post How Amazon and Walmart Are Rewiring Retail’s Future With Robotics appeared first on PYMNTS.com.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "2516432286203277029",
        "title": "Private Equity Firms Send Some Lenders to the Back of the Queue",
        "url": "https://www.bloomberg.com/news/newsletters/2025-05-08/private-equity-firms-send-some-lenders-to-the-back-of-the-queue",
        "site": "bloomberg.com",
        "time": 1746724773000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Hi, it’s Reshmi Basu in New York, reporting on how some lenders to private equity firms are getting bumped to the back of the queue. Also today, Abu Dhabi wealth fund Mubadala builds a $20 billion private credit portfolio. Pepsico brand Tropicana orange juice arranged in Hastings-on-Hudson, New York, U.S., on Wednesday, Aug. 4, 2021. PepsiCo Inc. is to sell Tropicana, Naked and other juice brands to French private equity firm PAI Partners for about $3.3 billion as it seeks to bolster its balance sheet and focus on healthier snacks and zero-calorie drinks. Photographer: Tiffany Hagler-Geard/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-7417564962615451678",
        "title": "Why selling your business isn’t the only path to success",
        "url": "https://www.fastcompany.com/91325908/why-selling-your-business-isnt-the-only-path-to-success-selling-your-business",
        "site": "fastcompany.com",
        "time": 1746541505000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Prioritizing growth to sell is a perfectly reasonable business strategy. Being acquired by a larger group at some point (like Poppi’s recent sale to PepsiCo) makes sense for many—to generate cash flow for expansion, take a shortcut to economies of scale or market penetration, or just cash in for early retirement. But not for me. Early on in my business journey at Bulletproof, we considered a buyout from a renowned global comms agency. But when they starting asking for growth projections and questioning whether we could achieve them, we walked away. We went on to smash those projections within three years—that’s when I truly started to realize we would be better off independent. Really, who would want to report to someone who doesn’t believe in your vision? Putting independence first Growing a good business is about relevance, internal culture, and excellence—qualities that risk dilution under a larger group. You can so easily lose your way and what you stand for—just look at the recent headlines around Ben and Jerry’s, with original CEO, David Stever, ousted for the political activism that was always at the heart of the original business. Also, as you relinquish control, you invariably compromise on how you pursue innovation or map the future. It’s why I’ve always put independence first. But if you don’t want to bank on acquisition in your strategy for scale, how can you nurture expansion, while retaining your independent spirit? In fact, independence and global success go together quite nicely, you just need to embrace the right mindset. Always striving for relevance Different leaders will always have different qualities, but independence, to me, is about embracing a certain restlessness. A business shouldn’t just be about creating great work, but about being at the cutting edge of culture—about being relevant. For that, you need to be constantly moving, searching, never settling. We could be a perfectly good business of 50 people in London, sticking to a clearly defined niche—very well-off but ultimately very bored. Or we can be the business that doesn’t settle, one that embraces new technology, new opportunity and innovation without having to deal with interminable layers of approval. It’s a choice you need to actively make and embrace. Embracing imperfection To do so, though, you need to allow yourself to make mistakes. In fact, being able to make mistakes, without being dragged over the coals for every misstep, is one of the biggest luxuries of independence. We’ve made many mistakes at Bulletproof. For example, we messed up when we thought we could crack New York without having people on the ground and soon learned that it wouldn’t work. From a personal point of view, I made the mistake of thinking I could do it all—run the business and be the creative head. For a long time, I didn’t accept that there were people better suited to running parts of the business. It’s a mistake I wish I’d made a lot earlier. You don’t grow a business, you grow people. So being independent is about embracing that imperfection and learning from those gaffes along the way. If you don’t, you never progress. It goes hand-in-hand with persistence. As a business founder or leader, you take things personally, so you’re protective over the business and its people. But you have to learn from mistakes and move on quickly. The right approach to scale Pursuing scale as a marker of success has its place. But progress means that you must grow for the right reasons—and without compromising quality. For us, scale is about growing talent and capabilities to complement our strengths. It’s never about scale for the sake of it. For example, we dismissed the idea of franchising our name for global expansion, even though we received a few approaches. Maintaining control over quality was far more important than spreading our name in this way. A better way to think about scale is that it’s all about the right talent. Hard work, determination, nurturing, kind individuals who attract the right work and embody your values. If you get this right, you can scale. Articulate your vision To ensure that quality, you also need conviction—and vision. People can help you with every other aspect of running a business, but the vision needs to come from the top. It needs to be both externally and internally facing. That way you will always have a road map of what you want to achieve and why, and you’ll always know how to take your team on that journey, At Bulletproof, our vision is to challenge the creative agency networks through doing the most compelling, commercially creative work on the planet. To prove there is a different way of doing things. Keep your fighting spirit But underpinning it all needs to be a fighting spirit. Things start to fall apart when you think you’ve “made it’” Don’t forget the early days, which invariably are hard. I didn’t come from a lot, for example. You should always nurture the mindset to spot the opportunities when they present themselves. Diageo is now one of our largest clients, but it all started with a $20,000 brief for a cocktail in a can. Sometimes businesses reach a certain size and only go for the million-dollar briefs—but that’s not how you grow, especially not as an independent business. You can see this fight, this alertness to opportunity, in many of the world’s most respected entrepreneurs. These leaders always look to evolve their enterprises, both into new markets and within their business practices, and their fight and drive keeps them relevant. Nike’s Phil Knight is a great example. His book Shoe Dog is a personal favorite. In it, he speaks so honestly about what they went through, and the hustle of the early days. It’s what makes running a fiercely independent business so rewarding. With it will come the growth that is truly rewarding—and the freedom to say no when a buyer comes knocking.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "5703024287262386209",
        "title": "PepsiCo Makes Bigger Bet on Sports With Revamped Marketing Unit",
        "url": "https://www.bloomberg.com/news/articles/2025-05-06/pepsico-makes-bigger-bet-on-sports-with-revamped-marketing-unit",
        "site": "bloomberg.com",
        "time": 1746529200000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo Inc. is making a larger wager on sports marketing partnerships with an eye toward the World Cup. Philadelphia Eagles head coach Nick Sirianni is showered with Gatorade during Super Bowl LIX.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-5642670498596478511",
        "title": "How Ambani's Campa Cola is Hurting Coke, Pepsi in India",
        "url": "https://www.bloomberg.com/news/videos/2025-05-06/how-ambani-s-campa-cola-is-hurting-coke-pepsi-in-india-video",
        "site": "bloomberg.com",
        "time": 1746509606000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Asia's richest man, Mukesh Ambani, is challenging Coca-Cola and PepsiCo's dominance in India with Reliance Industries' Campa Cola brand. Bloomberg's Satviki Sanjay appeared on Insight with Haslinda Amin to discuss what's behind the growing success of the brand. (Source: Bloomberg) PepsiCo Inc Photographer: SeongJoon Cho/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "4827632788432487638",
        "title": "Ambani’s 12-Cent Cola Is Eroding Coke, Pepsi Dominance in India",
        "url": "https://www.bloomberg.com/news/articles/2025-05-06/mukesh-ambani-takes-on-coke-pepsi-with-reliance-s-cheaper-campa-cola-in-india",
        "site": "bloomberg.com",
        "time": 1746489600000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "similar_stories": [
            "-5642670498596478511"
        ],
        "description": "Asia’s richest man is challenging the decades-long dominance of Coca-Cola Co. and PepsiCo Inc. in the most-populous country using a playbook he has practiced to perfection in other sectors: price disruption. Pilgrims walk past advertisements for Reliance Industries Ltd.’s Campa brand during Maha Kumbh Mela 2025 in Prayagraj, India, on Feb. 2, 2025.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "2594017340655560812",
        "title": "Coca-Cola gains after reporting higher organic sales marks than PepsiCo and Keurig Dr Pepper",
        "url": "https://seekingalpha.com/news/4436792-coca-cola-gains-after-reporting-higher-organic-sales-marks-than-pepsico-and-keurig-dr-pepper",
        "site": "seekingalpha.com",
        "time": 1745925891000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "8976746079062059868",
        "title": "Analyst’s Kid Grills Pepsi CEO, as ‘Take A Child to Work’ Meets Earnings Season",
        "url": "https://www.bloomberg.com/news/articles/2025-04-25/pepsi-ceo-dodges-question-from-wall-street-analyst-s-kid-on-earnings-call",
        "site": "bloomberg.com",
        "time": 1745605964000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo Inc. Chief Executive Officer Ramon Laguarta is used to getting asked about the impact of blockbuster weight-loss drugs on his food company’s business, but the questions aren’t usually coming from a 13-year-old. Milena and Kamran Gajrawala",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "8309912928140943557",
        "title": "Top CEOs Sound Alarm on Trump’s Unpredictable Trade Policies, WSJ Reports",
        "url": "https://www.pymnts.com/economy/2025/top-ceos-sound-alarm-on-trumps-unpredictable-trade-policies-wsj-reports/",
        "site": "pymnts.com",
        "time": 1745578442000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Major U.S. corporate leaders are raising serious concerns that President Trump’s constantly shifting tariff policies are spooking consumers and throwing business planning into disarray, according to a Wall Street Journal report. The CEOs of companies like American Airlines, PepsiCo, and Procter & Gamble have warned that the “shape-shifting tariff threats make it virtually impossible to […] The post Top CEOs Sound Alarm on Trump’s Unpredictable Trade Policies, WSJ Reports appeared first on PYMNTS.com. Major U.S. corporate leaders are raising serious concerns that President Trump’s constantly shifting tariff policies are spooking consumers and throwing business planning into disarray, according to a Wall Street Journal report. The CEOs of companies like American Airlines, PepsiCo, and Procter & Gamble have warned that the “shape-shifting tariff threats make it virtually impossible to plan and are spooking consumers.” The uncertainty surrounding tariffs is already having tangible effects. Several airlines, including American, Southwest and Alaska Air Group, have revised their full-year outlooks due to softened leisure travel attributed to the economic climate. American Airlines CEO Robert Isom stated, “We don’t know what is going to happen,” adding that this uncertainty could lead to reduced hiring and investment. Procter & Gamble, the maker of household staples like Pampers and Tide, is considering raising prices on some of its products. The auto industry is particularly concerned, according to the Journal, with groups representing General Motors, Volkswagen and Toyota imploring President Trump to reconsider the impending 25% tariff on car parts, which they say will increase the cost of buying and repairing vehicles. Tech giants like AT&T and Verizon also anticipate having to pass on tariff costs to consumers, potentially increasing the price of smartphones. Homebuilders like PulteGroup predict that tariffs on building materials will add approximately $5,000 to the price of a new home. While the majority of executives expressed concern, some, like Steel Dynamics CEO Mark Millett, voiced support for tariffs on imported steel and aluminum. Whirlpool also believes tariffs will create a more level playing field. However, for many, the unpredictable nature of the tariffs is the primary issue, leading companies like United Airlines to prepare forecasts for both stable and recessionary economic scenarios. Goldman Sachs CEO David Solomon emphasized that “the level of uncertainty is too high,” negatively impacting investment, spending and planning. Even Elon Musk, a known ally of the president, expressed his advocacy for lower tariffs. The International Monetary Fund has also projected slower economic growth globally, including in the U.S., in the wake of President Trump’s tariffs. When PYMNTS Intelligence surveyed chief financial officers at U.S. middle-market firms in mid-February, one in five respondents said they would raise prices on their goods and services in response to the tariffs. “But crucially, only a sliver said they would do so immediately as their first response to the tariffs,” the PYMNTS Intelligence report “Tariffs and Business Uncertainty: The Current State of Play, March 2025” said. “In any case, most companies hadn’t even started to plan for a global trade war.” PYMNTS CEO Karen Webster highlighted the report’s findings that 32% of these businesses said they have missed or will miss opportunities due to that uncertainty, 33% faced delays in getting products to market, and 31% experienced client turnover because of their own uncertain business outlooks. “Let that sink in,” Webster wrote. “That’s roughly a third of U.S. businesses making between $100 million and $1 billion in annual revenue — and the integral bridge between the enterprise and small business supply chains — who face some sort of economic uncertainty.” Retail giants Amazon and Walmart are recalibrating everything from procurement strategies to pricing models to remain resilient amid the newly implemented tariffs, PYMNTS reported on April 11. The post Top CEOs Sound Alarm on Trump’s Unpredictable Trade Policies, WSJ Reports appeared first on PYMNTS.com.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-8561894807120392902",
        "title": "Healthy Sodas Like Poppi, Olipop Are Drawing PepsiCo’s and Coca-Cola’s Attention",
        "url": "https://www.bloomberg.com/news/articles/2025-04-25/healthy-sodas-like-poppi-olipop-are-drawing-pepsi-and-coca-cola-s-attention",
        "site": "bloomberg.com",
        "time": 1745575241000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Big-money deals, new players and promises of healthy guts are building a new generation of soda drinkers.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "5033689744565112206",
        "title": "PEP Stock To $110? - Following this announcement, PepsiCo’s stock saw a 3% decrease ...",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/25/pep-stock-to-110/",
        "site": "forbes.com",
        "time": 1745573415000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Following this announcement, PepsiCo’s stock saw a 3% decrease on Thursday, April 24th. This drop seems to be partially driven by a less favorable outlook... Following this announcement, PepsiCo’s stock saw a 3% decrease on Thursday, April 24th. This drop seems to be partially driven by a less favorable outlook...",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-945280788945013812",
        "title": "Consumer companies are bracing for lower profits as tariffs force shoppers to rethink spending",
        "url": "https://www.cnbc.com/2025/04/24/trump-tariffs-pepsi-chipotle-pg-cut-earnings-forecasts.html",
        "site": "cnbc.com",
        "time": 1745514862000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo, Chipotle and Procter & Gamble are among the companies that lowered their forecasts.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-2844381737479751893",
        "title": "Pepsico Cuts Growth Forecast Amid Tariffs and Slowed Consumer Spending",
        "url": "https://www.nytimes.com/2025/04/24/business/pepsico-earnings-economy-tariffs.html",
        "site": "nytimes.com",
        "time": 1745514679000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo’s earnings call pointed to anxious consumers as to why sales had slowed, echoing comments made by Chipotle and Procter & Gamble. Pepsico cut its growth forecast, pointing to tariff volatility and a pullback in consumer spending.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-1567918130059833837",
        "title": "Stock Movers: Merck Up, Pepsi, American Airlines Fall On Profit Outlook",
        "url": "https://www.bloomberg.com/news/videos/2025-04-24/stock-movers-merck-up-pepsi-american-airlines-down-video",
        "site": "bloomberg.com",
        "time": 1745501506000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Merck (MRK) shares are higher in spite of the company cutting its adjusted earnings per share forecast for the year and saying it expects to lose $200 million to already-announced tariffs in 2025 amid a roiling trade war between the US and China. Still, the company's first-quarter results beat estimates. PepsiCo (PEP) shares are down after lowering its full-year profit outlook due to unpredictable US trade policy and worsening consumer sentiment, driving up costs and denting demand for its products. American Air (AAL) shares dropped after it withdrew its full-year earnings outlook due to economic uncertainty. The airline cited weak domestic leisure travel and economic worries. (Source: Bloomberg)",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-7563694369289503130",
        "title": "Stock Movers: Merck, Pepsi, American Air (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-24/stock-movers-merck-pepsi-american-air-podcast",
        "site": "bloomberg.com",
        "time": 1745501304000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Source: Bloomberg, 3:44 PepsiCo Inc Photographer: SeongJoon Cho/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-979267416802066378",
        "title": "PepsiCo in charts: Seasonal Q/Q decline seen across all realigned business segments in Q1",
        "url": "https://seekingalpha.com/news/4434769-pepsico-in-charts-seasonal-qq-decline-seen-across-all-realigned-business-segments-in-q1",
        "site": "seekingalpha.com",
        "time": 1745494970000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "1318182115275479794",
        "title": "Stock Movers: Merck, Pepsi, Chipotle (Podcast)",
        "url": "https://www.bloomberg.com/news/audio/2025-04-24/stock-movers-merck-pepsi-chipotle-podcast",
        "site": "bloomberg.com",
        "time": 1745493616000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "similar_stories": [
            "-1567918130059833837",
            "-7563694369289503130"
        ],
        "description": "Source: Bloomberg, 4:21 PepsiCo Inc Photographer: SeongJoon Cho/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-4092272789634491514",
        "title": "PepsiCo no longer sees profit growth in 2025 as tariffs lift supply-chain costs",
        "url": "https://www.marketwatch.com/story/pepsico-no-longer-sees-profit-growth-in-2025-as-tariffs-lift-supply-chain-costs-88908298?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1745492460000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "pep"
        ],
        "similar_stories": [
            "-594095091170056468"
        ],
        "description": "PepsiCo’s stock falls after the company reports a rare quarterly earnings miss as tariffs raise costs, slow consumer spending.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-7842851185580405356",
        "title": "Pepsi Cuts Full-Year Profit View Amid Global Trade Uncertainty",
        "url": "https://www.bloomberg.com/news/articles/2025-04-24/pepsi-pep-cuts-full-year-profit-view-amid-global-trade-uncertainty",
        "site": "bloomberg.com",
        "time": 1745489326000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo Inc. lowered its full-year profit outlook, showing that demand for the company’s snacks and soft drinks is wobbling amid unpredictable US trade policy and worsening consumer sentiment. Pepsi soda. Photographer: Gabby Jones/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "1743233897548847155",
        "title": "Pepsico Non-GAAP EPS of $1.48 misses by $0.01, revenue of $17.92B beats by $190M",
        "url": "https://seekingalpha.com/news/4434659-pepsico-non-gaap-eps-of-1_48-misses-by-0_01-revenue-of-17_92b-beats-by-190m",
        "site": "seekingalpha.com",
        "time": 1745488881000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-5433912970216929675",
        "title": "PepsiCo Earnings: What To Expect For PEP Stock",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/04/23/pepsico-earnings-what-to-expect-for-pep-stock/",
        "site": "forbes.com",
        "time": 1745406016000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "similar_stories": [
            "5033689744565112206"
        ],
        "description": "Over the last five years, PEP stock has posted a positive one-day return after earnings 84% of the time, with a median gain of 1.3% and a maximum one-day increase of 3.6% Over the last five years, PEP stock has posted a positive one-day return after earnings 84% of the time, with a median gain of 1.3% and a maximum one-day increase of 3.6%",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-4783874404656160576",
        "title": "Tropicana Wins Support for Deal That Lifts Carlyle and Fidelity",
        "url": "https://www.bloomberg.com/news/articles/2025-04-22/tropicana-gains-support-for-deal-that-boosts-carlyle-fidelity",
        "site": "bloomberg.com",
        "time": 1745359252000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Tropicana Brands Group broadened its support for a restructuring deal that gives lenders including Carlyle Group, Fidelity and CVC Credit Partners better terms than other creditors and allows the company to block firms that don’t participate from selling their debt, according to people familiar with the matter. Boxes of Tropicana Products navel oranges at a packing facility in Vero Beach, Florida.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-6198175276254476925",
        "title": "The Trump Tariffs Are Tilting the Scales in the Coke vs. Pepsi Battle",
        "url": "https://www.wsj.com/business/retail/pepsi-soda-tariffs-manufacturing-coca-cola-76dffe02?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1745141400000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-8183396595448570497",
        "title": "Gatorade Enlists Kendrick Lamar to Help Keep Its Sports Drink Lead",
        "url": "https://www.bloomberg.com/news/articles/2025-04-18/gatorade-pep-enlists-kendrick-lamar-to-keep-its-sports-drink-lead",
        "site": "bloomberg.com",
        "time": 1744972501000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Rapper Kendrick Lamar will headline one of the biggest marketing campaigns ever for Gatorade, as owner PepsiCo Inc. looks to defend its lead in the increasingly competitive sports drink category. Kendrick Lamar Photographer: Michael Owens/Getty Images",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-5458533370664607688",
        "title": "PepsiCo dips after Bank of America heads to the sidelines despite the consumer staples revival",
        "url": "https://seekingalpha.com/news/4431151-pepsico-dips-after-bank-of-america-heads-to-the-sidelines-despite-the-consumer-staples-revival",
        "site": "seekingalpha.com",
        "time": 1744720030000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-9160453247665490787",
        "title": "Rick Levine, Who Gave Commercials Cinematic Flair, Dies at 94",
        "url": "https://www.nytimes.com/2025/04/11/business/media/rick-levine-dead.html",
        "site": "nytimes.com",
        "time": 1744407685000,
        "favicon_url": "https://static.tickertick.com/website_icons/nytimes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "An award-winning director, he created ads for brands like Diet Pepsi (starring Michael J. Fox) and Wells Fargo by bringing a Hollywood sensibility to the small screen. Rick Levine in 1988. “People don’t come to me just for pictures; they come with stories,” he said.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-42436091448886192",
        "title": "Tropicana’s Debt Deal Divides Creditors Into Winners and Losers",
        "url": "https://www.bloomberg.com/news/articles/2025-04-10/tropicana-s-debt-deal-divides-creditors-into-winners-and-losers",
        "site": "bloomberg.com",
        "time": 1744307214000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Tropicana Brands Group finalized a deal that saw a select group of lenders guarantee that the struggling juice maker would get $400 million in fresh cash, according to people familiar with the matter.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "3148105674348981672",
        "title": "Arizona Lawmakers Approve Bill to Bar Soda From SNAP Purchases",
        "url": "https://www.bloomberg.com/news/articles/2025-04-08/arizona-lawmakers-approve-bill-to-bar-soda-from-snap-purchases",
        "site": "bloomberg.com",
        "time": 1744147574000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Arizona is poised to join a growing list of states seeking to stop low-income residents from using government-issued food benefits to purchase sugary beverages, including those made by Coca-Cola Co., PepsiCo Inc. and Keurig Dr. Pepper Inc. A shopper walks past Pepsi products at a supermarket in Clifton Park, New York, US, on Friday, Feb. 2, 2024. PepsiCo Inc. is scheduled to release earnings figures on February 9. Photographer: Angus Mordant/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-6572313154556964797",
        "title": "Playing defense: Kroger, General Mills, and PepsiCo are notable gainers amid the tariff turmoil",
        "url": "https://seekingalpha.com/news/4428524-playing-defense-kroger-general-mills-and-pepsico-are-notable-gainers-amid-the-tariff-turmoil",
        "site": "seekingalpha.com",
        "time": 1743702913000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-3920239570581963081",
        "title": "Mauro Porcini will be Samsung’s first Chief Design Officer",
        "url": "https://www.fastcompany.com/91307104/mauro-porcini-will-be-samsungs-first-chief-design-officer",
        "site": "fastcompany.com",
        "time": 1743087417000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "pep"
        ],
        "description": "In a significant design appointment, Mauro Porcini has been announced as the Chief Design Officer at Samsung. The position, newly created for Porcini, is his third time establishing a Chief Design Officer role at a major company—following 3M and PepsiCo. It’s also the first time that Samsung has hired a foreign design lead. It’s an aggressive move at a time when Samsung’s business is facing “crisis”-level headwinds. The company just lost its co-CEO Jong-Hee to cardiac arrest. Meanwhile, it’s shed marketshare in semiconductors to competitors, all while China is becoming better and better at building almost everything. And Samsung’s Mexico-based production (which represents a significant part of the business) faces 25% tariffs under the Trump administration. On the other hand, when I visited Samsung’s headquarters outside Seoul in late 2023 and met with the design team, I encountered a grounding confidence I’ve never sensed during any U.S. corporate tour, when the team stated simply, “Samsung is a thousand-year company.” During a time when some companies—including Apple—are investing less in design leadership, Samsung is doubling down on the approach. Porcini has been tasked with an incredible opportunity, and he will have his work cut out for him.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-6433140490810481454",
        "title": "Mauro Porcini, PepsiCo’s first chief design officer, is leaving the company",
        "url": "https://www.fastcompany.com/91304550/mauro-porcini-pepsico-chief-design-officer-leaving",
        "site": "fastcompany.com",
        "time": 1742826014000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "pep"
        ],
        "similar_stories": [
            "-3920239570581963081"
        ],
        "description": "After nearly 13 years leading PepsiCo design, its first chief design officer—Mauro Porcini—is departing the company. (Previous to PepsiCo, he was the first designer named to a chief design officer role at 3M.) Under Porcini, design at the PepsiCo family of brands has seen a significant glow up. He arrived shortly after 2008’s disastrous Pepsi rebrand during the era of flat design. And he spent the next decade investing in more internal talent—successfully arguing that the approach would actually save the company money while offering stronger creative autonomy. Porcini opened a flagship design center in NYC in 2012, then following its success, he added 18 more across the world, creating a team that swelled to 400 designers globally. Pepsi’s revenue has grown 40% over that time, while its stock has tripled. Porcini is leaving on two particular high notes—a well received black and blue Pepsi rebrand launched in 2023, and a new Mountain Dew that embraced its Appalachian roots last year. He also published the business memoir The Human Side of Innovation: The Power of People in Love with People, in 2022. Porcini’s next move is still unknown. Meanwhile, we’ve reached out to PepsiCo to inquire if the company intends to hire a new chief design officer and will update this story if we hear back.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-288397970729514272",
        "title": "Tampa Bay Rays Owner Angers City by Bailing From Stadium Deal",
        "url": "https://www.bloomberg.com/news/articles/2025-03-21/tampa-bay-rays-owner-angers-city-by-bailing-from-stadium-deal",
        "site": "bloomberg.com",
        "time": 1742562913000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Stu Sternberg and St. Petersburg, Florida, were meant to have a deal. Roof damage at Tropicana Field after Hurricane Milton made landfall in St. Petersburg on Oct. 10, 2024.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-4907993796204119735",
        "title": "Brands Briefing: Poppi scores a big exit, but dealmaking is still off to a slow start in 2025",
        "url": "https://www.modernretail.co/operations/brands-briefing-poppi-scores-a-big-exit-but-dealmaking-is-still-off-to-a-slow-start-in-2025/?utm_campaign=modernretaildis&utm_medium=rss&utm_source=general-rss",
        "site": "modernretail.co",
        "time": 1742306400000,
        "favicon_url": "https://static.tickertick.com/website_icons/modernretail.co.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo's proposed $1.95 billion acquisition of Poppi was exciting for many in the beverage space. But dealmaking is off to a slow start in 2025 for other types of brands as uncertainty clouds the market. Welcome to the first edition of the Modern Retail Brands Briefing, covering the growth strategies of Modern Brands. You can read more about our vision for this briefing here. This week, we’re diving into what Poppi’s deal means for M&A, the state of better-for-you soda, job openings to watch and more. So far, 2025 is proving to be a great year if you are a CEO looking to sell your nine-figure beverage brand. But for other types of brands, dealmaking is off to a stubbornly slow start this year. This is a member-exclusive article from Modern Retail. Continue reading it on modernretail.co and subscribe to continue reading content like this.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "5381513898431011210",
        "title": "PepsiCo's growth hinges on recovery in snacking division - analyst",
        "url": "https://seekingalpha.com/news/4421679-pepsico-growth-hinges-on-recovery-in-snacking-division",
        "site": "seekingalpha.com",
        "time": 1742303101000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-6040639828282079067",
        "title": "A Genocidal Militia in Sudan Controls a Key Ingredient in Coke and Pepsi",
        "url": "https://www.bloomberg.com/news/features/2025-03-18/sudan-s-genocidal-militia-rsf-controls-key-ingredient-in-coke-and-pepsi",
        "site": "bloomberg.com",
        "time": 1742274017000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Gum arabic acts as an emulsifier in consumer goods and household brands around the world. A Sudanese militia that the US has accused of committing genocide controls essential parts of the supply chain. Pieces of gum arabic, a natural emulsifier, displayed in a warehouse of an exporting company, in Port Sudan, Sudan, on Thursday, Oct. 31, 2024. Millions of dollars worth of weapons, fuel and drones flowing through Port Sudan have given the country's army the upper hand in the world's deadliest war, as Tehran and Moscow jockey for military bases on the Red Sea.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-2381778166016365132",
        "title": "Pepsi Co Buys Prebiotic Soda Brand Poppi For Nearly $2 Billion",
        "url": "https://www.forbes.com/sites/claraludmir/2025/03/17/pepsi-co-buys-poppi-/",
        "site": "forbes.com",
        "time": 1742246630000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo’s Poppi acquisition proves just how rewarding disrupting traditional categories and building a strong brand can be, even in highly competitive spaces. PepsiCo’s Poppi acquisition proves just how rewarding disrupting traditional categories and building a strong brand can be, even in highly competitive spaces.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-6752751649867930465",
        "title": "PepsiCo’s $1.95 Billion Acquisition Of Poppi Is A Lesson For All Marketers",
        "url": "https://www.forbes.com/sites/claraludmir/2025/03/17/pepsicos-195-billion-acquisition-of-poppi-is-a-lesson-for-all-marketers/",
        "site": "forbes.com",
        "time": 1742232693000,
        "favicon_url": "https://static.tickertick.com/website_icons/forbes.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo’s Poppi acquisition proves just how rewarding disrupting traditional categories and building a strong brand can be, even in highly competitive spaces. PepsiCo’s Poppi acquisition proves just how rewarding disrupting traditional categories and building a strong brand can be, even in highly competitive spaces.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-4722439980323022255",
        "title": "Brookfield’s Private Equity Chief Enjoys Busiest Start of a Year",
        "url": "https://www.bloomberg.com/news/newsletters/2025-03-17/brookfield-s-private-equity-chief-enjoys-busiest-start-of-a-year",
        "site": "bloomberg.com",
        "time": 1742232318000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Hello, it’s Dinesh Nair in London, catching up with the CEO of Brookfield’s private equity group, who discussed how the buyout world has been faring this year. Elsewhere, PepsiCo strikes a $2 billion deal while Chevron doubles down on its Hess takeover. Today's top stories The Brookfield Asset Management logo on a laptop computer arranged in New York, US, on Wednesday, Nov. 8, 2023. Brookfield Asset Management raised $26 billion in the third quarter and said it's on track to bring in close to $150 billion in fresh capital this year, despite a tough fundraising environment. Photographer: Gabby Jones/Bloomberg",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "7581588900116537964",
        "title": "Pepsi taps booming gut-health market with $2bn Poppi deal",
        "url": "https://www.ft.com/content/fb41fb3c-50f4-4665-b361-2c66db1ed109",
        "site": "ft.com",
        "time": 1742227762000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Drinks group buys prebiotic brand initially funded by investor on ‘Shark Tank’ show",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-5573592629152058514",
        "title": "Pepsi acquires Poppi prebiotic soda for $1.65 billion in a play to attract Gen Z",
        "url": "https://www.fastcompany.com/91299616/pepsico-buys-poppi-prebiotic-healthy-soda-flavors-attract-gen-z",
        "site": "fastcompany.com",
        "time": 1742226600000,
        "favicon_url": "https://static.tickertick.com/website_icons/fastcompany.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo is sick of being left out of the prebiotic soda craze—and to catch up with competitors, the multinational food and beverage corporation just dropped $1.65 billion to acquire the functional soda startup Poppi. The deal, announced this morning, will bring Poppi’s range of 14 colorful, low-sugar, prebiotic-packed sodas into Pepsi’s expansive existing beverage portfolio. The move comes as young consumers are increasingly turning away from traditional soda in favor of more health-conscious, “functional” beverages, which typically come with a mood or health benefit derived from a specific set of ingredients. Popular prebiotic brands like Poppi and Olipop fit in this category, as do hydration-based drinks like Mio and Magna. While Pepsi already owns Gatorade—which continues to dominate the hydration market, despite an influx of new entrants—the corporation has yet to make a move in the prebiotic space. Meanwhile, its main competitor, the Coca-Cola Company, just announced its own prebiotic soda brand called Simply Pop early last month. Now, Pepsi is ensuring that it leaves no functional beverage category unchecked. “As we look to reorient our portfolio offerings to address white space consumer needs, the Poppi brand’s unique intersection with wellness and culture is a perfect addition to our portfolio,” Ram Krishnan, CEO of PepsiCo Beverages U.S, said in a press release on the acquisition. What’s your function? According to data from NielsenIQ, U.S. sales of functional beverages grew 54% to $9.2 billion between March 2020 and March 2024. As of last March, functional beverages accounted for an impressive 10% of the nonalcoholic beverage market. Poppi has been well-positioned to capitalize on this growing interest: In 2024, the brand made more than $500 million in sales. Poppi’s “healthy soda” premise attracts young consumers, but where the brand really hooks potential drinkers is through its influencer marketing tactics (like its controversial decision to send entire vending machines to TikTokers for the Super Bowl) and an ultra-vibrant, colorful branding approach designed to court Gen Z. Founder Allison Ellsworth says that these efforts have helped to distinguish prebiotic sodas as a new “modern soda” section on grocery store shelves. “Over the last five years, we’ve worked with our buyers and retailers to define this whole new category. It’s what we call the modern soda set,” Ellsworth told Forbes in an interview this month. “It’s a dash destination within the store for this whole new category.” America’s soda-drinking habits are changing, with young consumers leading the way—and Pepsi’s latest acquisition demonstrates that prebiotic soda might just be the next sparkling water.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "6088409817177415800",
        "title": "Pepsi paying $1.7 billion for beverage brand that got its start on ‘Shark Tank’",
        "url": "https://www.marketwatch.com/bulletins/redirect/go?g=3040ce8f-3163-4d3d-8b2d-b13b8d034110&mod=mw_rss_bulletins",
        "site": "marketwatch.com",
        "time": 1742226217000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "4442148708461436664",
        "title": "PepsiCo's deal for Poppi is seen as on-brand with its aggressive M&A strategy",
        "url": "https://seekingalpha.com/news/4421264-pepsicos-deal-for-poppi-is-seen-as-on-brand-with-its-aggressive-ma-strategy",
        "site": "seekingalpha.com",
        "time": 1742226095000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "3730039791376360745",
        "title": "M&A Snapshot: PepsiCo to acquire prebiotic soda brand poppi in $1.95B deal",
        "url": "https://seekingalpha.com/news/4421240-ma-snapshot-pepsico-to-acquire-prebiotic-soda-brand-poppi-in-195b-deal",
        "site": "seekingalpha.com",
        "time": 1742222265000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-5726433592537387238",
        "title": "Pepsi to Purchase Poppi in Nearly $2 Billion Soda Deal",
        "url": "https://www.bloomberg.com/news/videos/2025-03-17/pepsi-to-purchase-poppi-in-nearly-2-billion-soda-deal",
        "site": "bloomberg.com",
        "time": 1742222047000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo Inc. will acquire healthier soda brand Poppi for $1.95 billion, including $300 million in expected cash tax benefits for a net purchase price of $1.65 billion. PepsiCo is working to diversify away from its standard soda and snacks by making acquisitions of healthier brands. Isabelle Lee reports on Bloomberg Television. (Source: Bloomberg)",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "5198294985729209568",
        "title": "Pepsi will pay $1.7 billion for a soft-drink company that got its start on ‘Shark Tank’",
        "url": "https://www.marketwatch.com/story/pepsi-boosts-healthy-offerings-with-poppi-a-maker-of-prebiotic-drinks-8ceb9d31?mod=mw_rss_topstories",
        "site": "marketwatch.com",
        "time": 1742219040000,
        "favicon_url": "https://static.tickertick.com/website_icons/marketwatch.com.ico",
        "tags": [
            "pep"
        ],
        "similar_stories": [
            "6088409817177415800"
        ],
        "description": "Pepsi boosts healthy offerings with Poppi, a maker of prebiotic drinks",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "6168903851457303404",
        "title": "PepsiCo to Acquire Prebiotic Soda Brand Poppi for $1.95 Billion",
        "url": "https://www.wsj.com/business/retail/pepsico-to-acquire-prebiotic-soda-brand-poppi-for-1-95-billion-94b8f773?siteid=yhoof2&yptr=yahoo",
        "site": "wsj.com",
        "time": 1742218500000,
        "favicon_url": "https://static.tickertick.com/website_icons/wsj.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-4249802111410811032",
        "title": "PepsiCo to Acquire Soda Brand Poppi for Nearly $2 Billion",
        "url": "https://www.bloomberg.com/news/articles/2025-03-17/pepsico-to-acquire-soda-brand-poppi-for-nearly-2-billion",
        "site": "bloomberg.com",
        "time": 1742216960000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "similar_stories": [
            "2594017340655560812",
            "-8561894807120392902",
            "-2381778166016365132",
            "-5573592629152058514",
            "6229507133946283739",
            "3730039791376360745",
            "-5726433592537387238",
            "6168903851457303404",
            "-4510666336337937207",
            "1710334271341880285",
            "273500865601322610"
        ],
        "description": "PepsiCo Inc. will acquire healthier soda brand Poppi for $1.95 billion, the Purchase, New York-based soda giant announced on Monday, confirming an earlier Bloomberg News report.",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-4510666336337937207",
        "title": "PepsiCo buys prebiotic soda brand Poppi for more than $1.6 billion",
        "url": "https://www.cnbc.com/2025/03/17/pepsico-buys-prebiotic-soda-brand-poppi-for-more-than-1point6-billion.html",
        "site": "cnbc.com",
        "time": 1742215702000,
        "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "1710334271341880285",
        "title": "PepsiCo strikes deal to acquire prebiotic soda brand Poppi",
        "url": "https://seekingalpha.com/news/4421174-pepsico-strikes-deal-to-acquire-prebiotic-soda-brand-poppi",
        "site": "seekingalpha.com",
        "time": 1742215138000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-3342553180489281701",
        "title": "FX Strategists Call End of Euro Rally; PepsiCo Eyes Poppi Buyout | Bloomberg Markets 03/14/2025",
        "url": "https://www.bloomberg.com/news/videos/2025-03-14/bloomberg-markets-03-14-2025-video",
        "site": "bloomberg.com",
        "time": 1741977374000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. Today's guests; Invesco Head of Alternatives ETF Strategy Kathy Kriskey, Citi Global Markets Head of G10 FX Strategy Daniel Tobon, and Bloomberg's Kenneth Shea. (Source: Bloomberg)",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-3174399228200230264",
        "title": "PepsiCo Eyes $1.5B Buyout Of Poppi",
        "url": "https://www.bloomberg.com/news/videos/2025-03-14/pepsico-eyes-1-5b-buyout-of-poppi-video",
        "site": "bloomberg.com",
        "time": 1741975424000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "PepsiCo Inc. is in advanced talks to buy healthier soda brand Poppi, according to people with knowledge of the matter. Bloomberg's Kenneth Shea has more on the story. (Source: Bloomberg)",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "7034455902815301769",
        "title": "Lutnick’s Cantor Fitzgerald Gives Tech Center Stage at First Annual Conference",
        "url": "https://www.bloomberg.com/news/newsletters/2025-03-14/lutnick-s-cantor-fitzgerald-gives-tech-center-stage-at-first-annual-conference",
        "site": "bloomberg.com",
        "time": 1741972999000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Hi, it’s Maggie Eastland in New York, where this week I attended Cantor Fitzgerald’s first-ever tech investment banking conference. Elsewhere, the soda Poppi could find itself as part of Pepsi soon. Howard Lutnick, chief executive officer of Cantor Fitzgerald LP and US commerce secretary nominee for US President Donald Trump, right, watches as President Donald Trump displays a signed executive order in the Oval Office of the White House in Washington, DC, US, on Thursday, Feb. 13, 2025. The president on Thursday signed a measure directing the US Trade Representative and Commerce secretary to propose new levies on a country-by-country basis in an effort to rebalance trade relations, a sweeping process that could take weeks or months to complete, according to a senior White House official, leaving no clear date when they would take effect. Photographer: Francis Chung/Politico",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "273500865601322610",
        "title": "Pepsi eyes Poppi acquisition to tap into booming prebiotic soda market - Bloomberg",
        "url": "https://seekingalpha.com/news/4420752-pepsi-eyes-poppi-acquisition-tap-booming-prebiotic-soda-market",
        "site": "seekingalpha.com",
        "time": 1741964365000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-2504796780542453155",
        "title": "PepsiCo is rated a notch below Coca-Cola, Keurig Dr Pepper, and Monster Beverage by Jefferies",
        "url": "https://seekingalpha.com/news/4419807-pepsico-is-rated-a-notch-below-coca-cola-keurig-dr-pepper-and-monster-beverage-by-jefferies",
        "site": "seekingalpha.com",
        "time": 1741806890000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "1502022778466760538",
        "title": "Pepsico APAC CEO Tse on Business Strategy",
        "url": "https://www.bloomberg.com/news/videos/2025-03-10/pepsico-apac-ceo-tse-on-business-strategy-video",
        "site": "bloomberg.com",
        "time": 1741586822000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Anne Tse, CEO APAC at Pepsico discusses business strategy for Pepsico in APAC. She says the Chinese market is still very big and scalable despite short-term volatility. She speaks exclusively on 'Insight with Haslinda Amin' (Source: Bloomberg)",
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-7297695540700155914",
        "title": "Insider trades: Pepsico, Moderna among notable names this week",
        "url": "https://seekingalpha.com/news/4418683-insider-trades-pepsico-moderna-among-notable-names-this-week",
        "site": "seekingalpha.com",
        "time": 1741449780000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pep"
        ],
        "tickers": [
            "pep"
        ]
    },
    {
        "id": "-8928790107659523934",
        "title": "Tropicana Mulls Competing Debt Deals from TPG Unit, Lender Group",
        "url": "https://www.bloomberg.com/news/articles/2025-03-03/tropicana-mulls-competing-debt-deals-from-tpg-unit-lender-group",
        "site": "bloomberg.com",
        "time": 1741038125000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pep"
        ],
        "description": "Tropicana Brands Group, facing a liquidity crunch as juice sales lag, is considering competing offers for a cash injection from new lenders and holders of its existing debt, according to people with knowledge of the situation.",
        "tickers": [
            "pep"
        ]
    }
]