[
    {
        "id": "-7706779052830290521",
        "title": "PNC launches new payment processing tool for micro businesses",
        "url": "https://seekingalpha.com/news/4457303-pnc-launches-new-payment-processing-tool-for-micro-businesses",
        "site": "seekingalpha.com",
        "time": 1749653805000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pnc"
        ],
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "5094696083375814222",
        "title": "PNC to Expand Primary Fund Placement Capabilities With Aqueduct Acquisition",
        "url": "https://www.pymnts.com/acquisitions/2025/pnc-to-expand-primary-fund-placement-capabilities-with-aqueduct-acquisition/",
        "site": "pymnts.com",
        "time": 1747792750000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "pnc"
        ],
        "description": "PNC Bank plans to acquire Aqueduct Capital Group to enhance the primary fund placement capabilities of PNC subsidiary Harris Williams. The bank has entered into a definitive agreement for the acquisition, and the transaction is expected to close in midsummer, subject to customary closing conditions, PNC Bank said in a Tuesday (May 20) press release. […] The post PNC to Expand Primary Fund Placement Capabilities With Aqueduct Acquisition appeared first on PYMNTS.com. PNC Bank plans to acquire Aqueduct Capital Group to enhance the primary fund placement capabilities of PNC subsidiary Harris Williams. The bank has entered into a definitive agreement for the acquisition, and the transaction is expected to close in midsummer, subject to customary closing conditions, PNC Bank said in a Tuesday (May 20) press release. “This acquisition is complementary to existing capital advisory capabilities provided through PNC’s subsidiary Harris Williams and will enable us to expand our ability to serve the global capital needs of the private equity industry,” Michael D. Thomas, head of corporate and institutional banking at PNC, said in the release. Harris Williams, a global investment bank specializing in mergers and acquisitions and private capital advisory services, serves clients worldwide, according to the release. Aqueduct Capital Group, a placement agent focused on raising capital for private equity, private credit and real asset managers, has been advising clients on a variety of fundraising solutions since its founding in 2003, per the release. Harris Williams Co-CEO John Neuner said in the release: “With minimal overlap in our respective client bases or limited partner relationships, this agreement increases the ability to serve a broader range of clients.” Aqueduct Founder Frank Edwards said in the release that the partnership “provides a tremendous opportunity to tap into our collective relationships and enable clients to diversify their investor base across North America, Australia, Europe and Asia.” PNC announced in May 2024 that it and global asset manager TCW Group formalized and expanded their partnership to develop a private credit platform focused on middle market lending. “Combining the power and legacy of PNC’s broad lending capabilities with TCW’s private credit group will deliver significant benefit to companies seeking growth opportunities,” PNC Chairman and CEO William S. Demchak said at the time in a press release. PNC acquired point-of-sale and payment solutions firm Linga in 2022, saying this would further its expansion of corporate payments capabilities while enhancing its ability to serve hospitality and restaurant industry clients. In 2021, PNC completed its acquisition of the bank BBVA USA, saying the move would accelerate PNC’s national expansion and bring its technology, products and services to new markets and clients. The post PNC to Expand Primary Fund Placement Capabilities With Aqueduct Acquisition appeared first on PYMNTS.com.",
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "-5292353980607024142",
        "title": "PNC Agrees to Acquire Alternatives Fundraiser Aqueduct Capital",
        "url": "https://www.bloomberg.com/news/articles/2025-05-20/pnc-agrees-to-acquire-alternatives-fundraiser-aqueduct-capital",
        "site": "bloomberg.com",
        "time": 1747777869000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pnc"
        ],
        "description": "PNC Financial Services Group said its bank will acquire Aqueduct Capital Group, a move that expands PNC’s services for alternative asset managers. Pedestrians pass in front of a PNC Financial Services Group Inc. bank branch in New York, U.S., on Saturday, Jan. 11, 2020. PNC Financial Services Group Inc. is scheduled to release earnings figures on January 15. Photographer: Gabriela Bhaskar/Bloomberg",
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "1583358040124071975",
        "title": "PNC unveils no-fee credit card with APR cuts for responsible spending",
        "url": "https://seekingalpha.com/news/4446470-pnc-unveils-no-fee-credit-card-with-apr-cuts-for-responsible-spending",
        "site": "seekingalpha.com",
        "time": 1747061111000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pnc"
        ],
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "-70450990261131243",
        "title": "Consumer Resilience Buoys Big Banks, but CEOs Remain Cautious",
        "url": "https://www.pymnts.com/news/banking/2025/consumer-resilience-buoys-big-banks-but-ceos-remain-cautious/",
        "site": "pymnts.com",
        "time": 1744764567000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "pnc"
        ],
        "description": "In a quarter overshadowed by tariff discussions and global economic jitters, three of the nation’s largest financial institutions — PNC, Citigroup, and Bank of America — presented first-quarter earnings Tuesday (April 15) that pointed to both lingering uncertainties and resilient consumer spending. Analysts and investors were keenly focused on whether consumers would begin to show […] The post Consumer Resilience Buoys Big Banks, but CEOs Remain Cautious appeared first on PYMNTS.com. In a quarter overshadowed by tariff discussions and global economic jitters, three of the nation’s largest financial institutions — PNC, Citigroup, and Bank of America — presented first-quarter earnings Tuesday (April 15) that pointed to both lingering uncertainties and resilient consumer spending. Analysts and investors were keenly focused on whether consumers would begin to show signs of strain amid fluctuating economic signals, but the banks’ results demonstrated that, for now at least, the U.S. consumer remains on solid footing. A unifying thread across all three earnings calls was the emphasis on continuing demand from retail customers, underscored by robust credit- and debit-card activity. Bank of America’s supplemental results revealed that credit and debit spending was up 4%, with the number of transactions rising 2% to total $228 billion. At Citigroup, executives spotlighted comparable momentum in consumer businesses, with U.S. Personal Banking revenue reaching a record $5.2 billion. Meanwhile, PNC underscored its own ability to attract and retain clients, highlighting growth in commercial and industrial (C&I) loan commitments despite the uncertain climate. In short, executives from all three institutions painted a picture of a consumer who, while selective, remains a potent force in sustaining spending. Uncertainty, however, set the broader context for each discussion. Across multiple calls, tariff concerns and the possibility of a near-term recession cast a shadow over corporate and commercial lending decisions. Bank of America CEO Brian Moynihan said that while “organic growth remains strong,” businesses remain “sanguine on the current environment” but are re-evaluating capital expenditures amid shifting trade policy. At PNC, CEO William S. Demchak spoke candidly about volatility, remarking that these “fluid” conditions might ultimately raise the probability of recession if tariffs persist longer than anticipated. Similar caution was evident at Citigroup, which saw strong trading profits partly attributed to hedging and market activities tied to macroeconomic volatility. This environment of uncertainty appeared in loan portfolios as well. PNC Chief Financial Officer Robert Q. Reilly noted that the bank had not changed its guidance precisely because of the evolving situation, while at Bank of America, commercial lending was flat, a signal that corporate clients are deliberate about tapping credit lines in a setting rife with trade policy shifts. Citigroup, for its part, chose to fortify its credit reserves for card losses and set aside an additional allowance for credit losses tied to the “challenging macro environment.” Still, executives repeatedly stressed the relatively healthy state of the consumer. Moynihan pointed out that Bank of America’s internal data suggested that year-over-year consumer spending growth carried into April at a 5% rate. Much of this spending, he said, flows through multiple channels such as debit, credit, Zelle, and checks — indicating consumers are finding ways to keep money circulating in the economy. Citigroup CEO Jane Fraser similarly noted that card portfolios showed “elevated” but still manageable levels of credit losses, aligned with an environment in which rising interest rates and inflation have begun to pinch certain segments of consumers. At PNC, Demchak said while everyday borrowers may well feel the brunt of uncertainty, sophisticated investors and well-capitalized commercial clients can seize opportunities when markets become unsettled. It wasn’t just spending that drew focus; the banks also highlighted the accelerating shift toward digital channels. Bank of America spotlighted a 65% digital sales mix in its most recent quarter — an increase from 53% a year earlier. Zelle payments reached $130 billion, up from $106 billion in the same period last year. Meanwhile, Moynihan touted new achievements for the bank’s virtual assistant Erica, now at 2.7 billion interactions since its 2018 launch. Citigroup showcased its own technological pivot, implementing artificial intelligence tools to modernize onboarding, detect unauthorized trades, and automate code reviews. These moves suggest that, despite caution around economic unknowns, banks continue to invest heavily in digital transformation to meet evolving customer expectations. Concluding the quarter’s discourse was a note of guarded optimism. PNC’s Demchak said the bank is “growing just fine,” with enough capital to support clients, even if a downturn arrives faster or heavier than anticipated. Bank of America’s CFO Alastair Borthwick emphasized that deposit growth has outstripped initial expectations, providing liquidity cushions. Citigroup, while acknowledging higher credit costs and ongoing structural changes, maintained full-year guidance on net interest income and expenses. Across all three calls, the overarching message was that while commercial clients may temporarily hold off on bigger investments, and credit costs could inch upward, the U.S. consumer’s resilience appears to support at least a measured outlook for the remainder of the year. In summary, Tuesday’s first-quarter earnings from Bank of America, PNC and Citigroup reinforced a collective narrative: Robust consumer spending is propping up results, even as companies and institutions grapple with an unclear macroeconomic landscape. Tariffs and the potential for a recession have not yet dramatically curbed consumer appetite, though some pullback in commercial lending and elevated caution on credit were evident. Digital adoption across retail banking and payments continues at a brisk pace, reflecting banks’ strategic push toward technology-driven growth. All three institutions remain watchful but confident that, if the climate grows stormier, they have the balance-sheet strength, client relationships, and technological capabilities to navigate what lies ahead. The post Consumer Resilience Buoys Big Banks, but CEOs Remain Cautious appeared first on PYMNTS.com.",
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "-6171397047864373426",
        "title": "PNC Leverages Technology to Help Clients Manage Uncertainty",
        "url": "https://www.pymnts.com/earnings/2025/pnc-leverages-technology-to-help-clients-manage-uncertainty/",
        "site": "pymnts.com",
        "time": 1744740080000,
        "favicon_url": "https://static.tickertick.com/website_icons/pymnts.com.ico",
        "tags": [
            "pnc"
        ],
        "description": "PNC Financial Services Group is leveraging technology and its other strengths as it helps clients manage the uncertainty caused by tariffs, executives said Tuesday (April 15) during the bank’s quarterly earnings call. With this uncertainty roiling the markets and raising concerns of a potential recession, PNC is monitoring and evaluating the situation and communicating with […] The post PNC Leverages Technology to Help Clients Manage Uncertainty appeared first on PYMNTS.com. PNC Financial Services Group is leveraging technology and its other strengths as it helps clients manage the uncertainty caused by tariffs, executives said Tuesday (April 15) during the bank’s quarterly earnings call. With this uncertainty roiling the markets and raising concerns of a potential recession, PNC is monitoring and evaluating the situation and communicating with its clients about how these events my impact their businesses, William S. Demchak, chairman, president and CEO of PNC, said during the call. “We have demonstrated time and time again that we will perform well in periods of uncertainty,” Demchak said. “The foundation of our success has been built upon the strength of our balance sheet, client selection, our interest rate risk positioning, our diversified business mix, leading technology and our people — and that has not changed.” PNC had a strong first quarter, gaining customers and commercial loans, expanding its net interest margin and capital levels, and maintaining solid credit quality metrics, Demchak said in a Tuesday earnings release. During the call, Demchak highlighted the bank’s increased commercial and industrial (C&I) loan commitments and spot balances. C&I loan commitments increased by $4.7 billion during a quarter in which consumer loans declined by $1.0 billion and commercial real estate (CRE) loans decreased by $1.3 billion, according to a presentation released Tuesday in conjunction with the earnings call. Spot utilization in the commercial and industrial banking (C&IB) business increased by about 80 basis points during the quarter, per the release. When an analyst asked during the call if this growth could have been driven by businesses building up their inventory ahead of tariffs, PNC Chief Financial Officer Robert Q. Reilly said the growth was broad-based across most loan categories and was expected. “We have been calling for this for some time in terms of increased utilization, which we saw in the quarter, so that tracks to what we thought at the beginning of the year,” Reilly said. “As far as some of this being defensive or tariff-driven, it’s hard to say. It’s not all of it, for sure. Maybe there’s a little bit of it in there.” Reilly said during the call that PNC has not changed its guidance because the current environment is too fluid for the bank to do so. He said the proposed tariffs announced April 2 were “more severe than anticipated” and that if they remain in effect for an extended period, “it’s quite possible the probability of a recession will go up.” Reilly added that the bank had a solid first quarter and is well positioned for the rest of the year. Demchak said during the call: “We’re growing just fine. We have lots of capital and ability to support our clients, and we’re likely going into an environment where being a bank is a pretty important thing for the U.S. economy, and we’ll take advantage of that.” The post PNC Leverages Technology to Help Clients Manage Uncertainty appeared first on PYMNTS.com.",
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "5902071254996005449",
        "title": "PNC Financial Services updates 2025 guidance amid strong Q1 results and strategic expansion",
        "url": "https://seekingalpha.com/news/4431329-pnc-financial-services-updates-2025-guidance-amid-strong-q1-results-and-strategic-expansion",
        "site": "seekingalpha.com",
        "time": 1744737059000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pnc"
        ],
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "9047273132333939693",
        "title": "Earnings Snapshot: PNC Financial Services beats Q1 earnings estimates; sees 2Q NII growth about +1% to +2%",
        "url": "https://seekingalpha.com/news/4431042-earnings-snapshot-pnc-financial-services-beats-q1-earnings-estimates-sees-2q-nii-growth-about-1-to-2",
        "site": "seekingalpha.com",
        "time": 1744714982000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pnc"
        ],
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "601373050216139837",
        "title": "PNC Tops Estimates for Net Interest Income, Loan-Loss Provisions",
        "url": "https://www.bloomberg.com/news/articles/2025-04-15/pnc-tops-estimates-for-net-interest-income-loan-loss-provisions",
        "site": "bloomberg.com",
        "time": 1744714354000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pnc"
        ],
        "description": "PNC Financial Services Group Inc. beat expectations for first-quarter net interest income, its largest revenue stream, as expenses and the provision for credit losses came in better than analysts expected. CEO William Demchak",
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "-5722893414485936609",
        "title": "PNC Hires Mark Wiedman, Former Top BlackRock Executive, as President",
        "url": "https://www.barrons.com/articles/pnc-president-mark-wiedman-blackrock-c2e916f4?siteid=yhoof2&yptr=yahoo",
        "site": "barrons.com",
        "time": 1744071660000,
        "favicon_url": "https://static.tickertick.com/website_icons/barrons.com.ico",
        "tags": [
            "pnc"
        ],
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "-5896676513007502522",
        "title": "PNC Names Ex-BlackRock Executive Mark Wiedman as President",
        "url": "https://www.bloomberg.com/news/articles/2025-04-07/pnc-names-ex-blackrock-executive-mark-wiedman-as-president",
        "site": "bloomberg.com",
        "time": 1744070095000,
        "favicon_url": "https://static.tickertick.com/website_icons/bloomberg.com.ico",
        "tags": [
            "pnc"
        ],
        "description": "PNC Financial Services Group Inc. has appointed veteran BlackRock Inc. executive Mark Wiedman as president, as part of its drive to grow rapidly in a new era of banking characterized by technology and consolidation. Mark Wiedman, head of global client business of BlackRock Inc., speaks at the Global Financial Leader's Investment Summit in Hong Kong, China, on Wednesday, Nov. 8, 2023. The de-facto central bank of the Chinese territory is this week holding its global finance summit for a second year in a row. Photographer: Lam Yik/Bloomberg",
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "-4465320391045382691",
        "title": "PNC names ex-BlackRock executive as president as it eyes expansion",
        "url": "https://www.ft.com/content/e6e8e631-2f57-4291-b704-fc7234e807bc",
        "site": "ft.com",
        "time": 1744066328000,
        "favicon_url": "https://static.tickertick.com/website_icons/ft.com.ico",
        "tags": [
            "pnc"
        ],
        "similar_stories": [
            "-5722893414485936609",
            "-5896676513007502522",
            "-1392710433517456409"
        ],
        "description": "Mark Wiedman was a potential future leader of the asset manager but will join a bank seeking to compete with majors",
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "-1392710433517456409",
        "title": "PNC appoints ex-Blackrock exec, Mark Wiedman as president",
        "url": "https://seekingalpha.com/news/4429290-pnc-appoints-ex-blackrock-exec-mark-wiedman-as-president",
        "site": "seekingalpha.com",
        "time": 1744061503000,
        "favicon_url": "https://static.tickertick.com/website_icons/seekingalpha.com.ico",
        "tags": [
            "pnc"
        ],
        "tickers": [
            "pnc"
        ]
    },
    {
        "id": "5818378111466718938",
        "title": "Here's how the 'millionaire next door' is being advised to invest amid economic fears",
        "url": "https://www.businessinsider.com/how-millionaires-invest-stocks-bonds-financial-advice-economic-recession-fears-2025-3",
        "site": "businessinsider.com",
        "time": 1742116441000,
        "favicon_url": "https://static.tickertick.com/website_icons/businessinsider.com.ico",
        "tags": [
            "pnc"
        ],
        "description": "Explore strategic asset allocation and cash management advice for millionaires, with an emphasis on recovery opportunities in stocks. Manuel Tsanoudakis/Getty, PNC/Getty, Marat Musabirov/iStock, Elena Frolova/iStock, Ava Horton/BIWashington's tariff threats and global counter-responses are fueling market uncertainty and risk.Investors face potential stagflation, prompting strategic asset allocation and cash management.Experts advise cautious stock moves, favoring high-quality bonds and Big Tech for recovery.Washington's tariff threats are real but not the only problem: the continued counter-responses from other countries have turned this trade war into a vicious cycle that makes it hard for any seasoned economist to call the endpoint. And that type of ambiguity is making markets nervous.There has been a significant reevaluation of risk and a sentiment shift to the downside for markets, said Jim Baird, the chief investment officer at Plante Moran Financial Advisors. He services clients with net worths beginning at $500,000, which he calls the \"millionaire-next-door\" type. In other words, they aren't yet in the ultrawealthy range where they can sit a downturn out or resort to private investments.This group of investors has enough exposure to public markets that it could seriously impact their wealth. It's a predicament that has put money managers at the forefront of rethinking their clients' exposures relative to their needs amid a rapidly shifting economic environment.Baird isn't expecting a near-term recession but is concerned about the risk of stagflation, when inflation and unemployment both remain high. For that, he's assessing whether clients have enough cash to cover their monthly needs and any big payments they may have coming up. This helps them avoid selling equities when the market is down. It's typically known as the emergency fund. But clients who are retired or nearing retirement should aim to have six to 12 months of their needs in cash. As for those who still have a wage and aren't worried about losing it, carrying too much cash doesn't make sense, he added.He is also coaching clients on strategic asset allocation while reviewing their portfolio positioning. When the stock market is volatile, it could be an opportunity to move some positions around, he noted. But those decisions would be made based on an individual client's needs. For example, if they don't have enough exposure in large caps, this could be a time to top that position while offloading other areas that could be used for tax-loss-harvesting purposes.\"Coming off of the last few years, equity investors, in particular, have done pretty well,\" Baird said. And so they may be in a decent position to reduce portfolio risk without risking their ability to meet their long-term goals and objectives.\"For those who don't want to take too much risk on stocks or are already dependent on their investment portfolio, he advises them to lean into high-quality bonds that still provide a good enough yield. But he doesn't suggest longer-duration bonds in case there's an uptick in inflation.Ken Mahoney, the CEO of Mahoney Asset Management, advises those with net wealth between $1 million to $ 10 million in assets. He has been helping clients trim some of their positions since late last year and into 2025. But not because of the trade wars, per se: He was concerned that the stock market hadn't seen a correction in some time and expected a 10% pullback at some point.While things look gloomy right now, he's also prepared for a large change in the president's tone and policy that could bring markets flying back. His strategy with clients has been to remain tactical while watching for positive signs of change.For those who feel like they missed the curve and the market has already turned for the worst, Mahoney says it's not too late. Investors can still make some tactical moves. Just see this as a time when the good stuff is on sale and go shopping for high-quality stocks.He expects a rally back into Big Tech stocks like Apple, Microsoft, and Nvidia when the market begins to recover— although he can't guarantee when that will happen. But since these names are the most liquid stocks, institutions will add them back into their portfolios as fast as they offloaded them, he said. These companies are also supported by strong fundamentals, big balance sheets, and hefty cash, and they remain key to long-term technological innovations.However, there's still risk in the market, which means sectors like small caps may not be the place to go looking for sales. Mahoney is only sticking to the Mag 7 and potentially other stocks with relative balance sheet strength.\"We are growth managers, so that is where we will stay focused in looking to nibble at tech, and the key word there is nibble as this is not a place to get aggressive at all,\" Mahoney said. \"We like to buy high and sell higher and buy confirmed strength more in the markets we had in 2023 and 2024.\"Once the indexes start making higher lows, Mahoney would consider becoming slightly more aggressive because it's an early sign that the selling pressure is subsiding. Another sign he'll be looking for is the cooling off of the CBOE Volatility Index, a measure of the S&P 500's expected volatility.In the meantime, for investors looking for broader exposure, he suggests dollar-cost averaging — buying fixed amounts at regular intervals — into the indexes if they have time to stay in the market. That's because once we correct, you can gain an extra 10% from the reversal, Mahoney noted. And if we remain in freefall, that means more shares at a lower price, he added.That said, you'll want some cash or what Wall Street calls \"dry powder\" to set aside so you can buy. He recommends keeping that cash in money markets that can be liquidated at the par value of $1 at any point, making them a more flexible option over bonds.Read the original article on Business Insider",
        "tickers": [
            "pnc"
        ]
    }
]